["O documento apresenta o Livro I, que trata das pessoas, com foco nas pessoas naturais. Ele aborda a personalidade e capacidade civil, destacando que toda pessoa é capaz de direitos e deveres na ordem civil. A personalidade civil começa no nascimento, mas a lei protege os direitos do nascituro desde a concepção. Também menciona os casos de incapacidade absoluta e relativa, como menores de 16 anos, ébrios habituais, viciados em tóxicos, entre outros. A menoridade cessa aos 18 anos completos, quando a pessoa pode praticar todos os atos civis. O documento também aborda a morte, a morte presumida, o registro de nascimentos, casamentos e óbitos, entre outros temas relacionados às pessoas naturais.", "O documento apresenta os direitos da personalidade das pessoas naturais, destacando que esses direitos são intransmissíveis e irrenunciáveis, não podendo sofrer limitação voluntária. Também aborda a proteção do corpo, do nome, do pseudônimo e da imagem das pessoas, proibindo o uso não autorizado em publicações, propaganda comercial ou exposição pública. Além disso, destaca a inviolabilidade da vida privada da pessoa natural e a possibilidade de requerer medidas para impedir atos contrários a essa norma. Há também menção à legitimação de parentes para requerer medidas de proteção em caso de morte ou ausência da pessoa.", "O documento trata da ausência de uma pessoa do seu domicílio, sem notícias, e da nomeação de um curador para administrar os seus bens. O juiz pode declarar a ausência e nomear um curador a pedido de interessados ou do Ministério Público. O cônjuge do ausente, se não estiver separado judicialmente, é o curador legítimo, seguido pelos pais e descendentes, conforme a ordem de preferência. Em falta dessas pessoas, o juiz escolherá o curador.", "O documento trata da sucessão provisória em caso de ausência de uma pessoa. Após um ano da arrecadação dos bens do ausente, ou três anos se houver representante ou procurador, os interessados podem requerer a abertura provisória da sucessão. A sentença que determinar a abertura da sucessão provisória só produzirá efeito após 180 dias de sua publicação. Os herdeiros devem dar garantias da restituição dos bens do ausente para se imitirem na posse. Os sucessores provisórios representam ativa e passivamente o ausente e ficam responsáveis pelos frutos e rendimentos dos bens. Se o ausente aparecer, perde sua parte nos frutos e rendimentos. Se a época exata do falecimento do ausente for provada durante a posse provisória, a sucessão é aberta em favor dos herdeiros daquela época. Se o ausente aparecer depois da posse provisória, os sucessores devem tomar medidas assecuratórias até a entrega dos bens.", "O texto trata da sucessão definitiva de bens de pessoas ausentes. Após a abertura da sucessão provisória, os interessados podem requerer a sucessão definitiva e o levantamento das cauções prestadas após dez anos. Também é possível requerer a sucessão definitiva se o ausente tiver oitenta anos de idade e não houver notícias dele nos últimos cinco anos. Caso o ausente ou seus descendentes ou ascendentes retornem nos dez anos seguintes à abertura da sucessão definitiva, terão direito apenas aos bens existentes naquele momento. Se ninguém promover a sucessão definitiva após dez anos, os bens arrecadados passarão para o domínio público.", "O documento trata das pessoas jurídicas, que podem ser de direito público interno, de direito público externo ou de direito privado. As pessoas jurídicas de direito público interno são responsáveis por atos de seus agentes que causem danos a terceiros. Já as pessoas jurídicas de direito privado incluem associações, sociedades, fundações, organizações religiosas e partidos políticos. O registro é necessário para a existência legal das pessoas jurídicas de direito privado, e o juiz pode nomear um administrador provisório em caso de falta de administração. Em casos de abuso da personalidade jurídica, o juiz pode desconsiderá-la para estender os efeitos de certas relações de obrigações aos bens particulares dos administradores ou sócios beneficiados. A proteção dos direitos da personalidade também se aplica às pessoas jurídicas.", "O documento trata das associações, que são constituídas pela união de pessoas para fins não econômicos. O estatuto das associações deve conter informações como denominação, fins, sede, requisitos para admissão e exclusão de associados, direitos e deveres dos associados, fontes de recursos, modo de constituição dos órgãos deliberativos, condições para alteração estatutária e dissolução, forma de gestão administrativa, entre outros. Os associados devem ter iguais direitos, mas o estatuto pode instituir categorias com vantagens especiais. A exclusão de associados só é permitida com justa causa e após procedimento que garanta direito de defesa e recurso. A assembléia geral tem competência para destituir administradores e alterar o estatuto, com quorum e critérios estabelecidos no estatuto. A convocação dos órgãos deliberativos deve seguir o estatuto, com direito a 1/5 dos associados de promovê-la. Em caso de dissolução da associação, o remanescente do patrimônio líquido pode ser destinado a entidades de fins não econômicos designadas no estatuto ou, na ausência de designação, por deliberação dos associados. Em caso de inexistência de entidades adequadas, o patrimônio remanescente pode ser devolvido à Fazenda do Estado, Distrito Federal ou União.", "O documento trata das regras para a criação e funcionamento de fundações, que devem ser instituídas por escritura pública ou testamento, com dotação especial de bens livres e especificação do fim a que se destina. As fundações só podem ser constituídas para fins específicos, como assistência social, cultura, educação, saúde, entre outros. O Ministério Público é responsável por fiscalizar as fundações, velando por sua atuação. Alterações no estatuto da fundação devem ser aprovadas pela maioria dos responsáveis e pelo Ministério Público. Em caso de extinção da fundação, seu patrimônio pode ser incorporado em outra fundação com fins semelhantes.", "O documento trata do domicílio das pessoas naturais e jurídicas, estabelecendo que o domicílio da pessoa natural é o lugar onde ela estabelece residência com ânimo definitivo, podendo ser considerado qualquer lugar onde viva alternadamente. Para as pessoas jurídicas, o domicílio é determinado de acordo com o tipo de entidade. Também são mencionados os domicílios necessários para incapazes, servidores públicos, militares, marítimos e presos. Além disso, é mencionado que nos contratos escritos, os contratantes podem especificar um domicílio para o exercício dos direitos e obrigações resultantes do contrato.", "O documento trata dos bens imóveis, definindo que são considerados como tal o solo e tudo que se incorporar a ele natural ou artificialmente. Também são considerados imóveis os direitos reais sobre imóveis, ações que os asseguram e o direito à sucessão aberta. Além disso, as edificações que forem removidas para outro local mantendo sua unidade e os materiais temporariamente separados de um prédio para serem reutilizados não perdem o caráter de imóveis.", "O Livro II do Código Civil trata dos bens, especificamente dos bens móveis. De acordo com o artigo 82, os bens móveis são aqueles que podem se mover por conta própria ou ser removidos por força externa sem alterar sua substância ou destinação econômico-social. O artigo 83 lista o que é considerado móvel para efeitos legais, incluindo energias com valor econômico, direitos reais sobre objetos móveis e direitos pessoais de caráter patrimonial. Já o artigo 84 estabelece que materiais destinados à construção mantêm sua qualidade de móveis até serem utilizados, e materiais provenientes da demolição de um prédio recuperam essa qualidade.", "O Livro II trata dos bens, especificamente das diferentes classes de bens. Na Seção III, são abordados os bens fungíveis e consumíveis. Os bens fungíveis são móveis que podem ser substituídos por outros da mesma espécie, qualidade e quantidade. Já os bens consumíveis são móveis cujo uso resulta na destruição imediata da própria substância, incluindo aqueles destinados à alienação.", "Os bens divisíveis são aqueles que podem ser fracionados sem alteração na sua substância, diminuição considerável de valor ou prejuízo do uso a que se destinam. Os bens naturalmente divisíveis podem tornar-se indivisíveis por determinação da lei ou por vontade das partes.", "O Livro II trata dos bens, especificamente das diferentes classes de bens. Na Seção V, são abordados os bens singulares e coletivos. Os bens singulares são aqueles que, mesmo reunidos, são considerados independentes dos demais. Já a universalidade de fato é a pluralidade de bens singulares pertencentes à mesma pessoa e com destinação unitária. Os bens que formam essa universalidade podem ser objeto de relações jurídicas próprias. Por fim, a universalidade de direito é o conjunto de relações jurídicas de uma pessoa, dotadas de valor econômico.", "O Livro II trata dos bens, especificamente das diferentes classes de bens. O Capítulo II aborda os bens reciprocamente considerados, definindo o principal como aquele que existe sobre si, abstrata ou concretamente, e o acessório como aquele cuja existência supõe a do principal. Pertenças são bens que, não sendo partes integrantes, se destinam ao uso, serviço ou aformoseamento de outro. Os negócios jurídicos relacionados ao bem principal não abrangem as pertenças, a menos que a lei, a manifestação de vontade ou as circunstâncias do caso determinem o contrário. Frutos e produtos, mesmo não separados do bem principal, podem ser objeto de negócio jurídico. As benfeitorias podem ser voluptuárias, úteis ou necessárias, sendo as voluptuárias aquelas de mero deleite, as úteis as que facilitam o uso do bem e as necessárias as que visam conservar o bem. Não são consideradas benfeitorias os melhoramentos ou acréscimos ao bem sem a intervenção do proprietário, possuidor ou detentor.", "O documento trata dos bens públicos, que são aqueles pertencentes às pessoas jurídicas de direito público interno. São classificados em bens de uso comum do povo, de uso especial e dominicais. Os bens de uso comum do povo, como rios, mares, estradas, ruas e praças, são inalienáveis, assim como os de uso especial, destinados a serviços públicos. Já os bens dominicais, que constituem o patrimônio das pessoas jurídicas de direito público, podem ser alienados. Os bens públicos não estão sujeitos a usucapião e o uso comum pode ser gratuito ou retribuído, conforme estabelecido por lei.", "O Livro III trata dos Fatos Jurídicos, com destaque para o Título I, que aborda o Negócio Jurídico. O Capítulo I apresenta as Disposições Gerais, destacando a necessidade de validade do negócio jurídico, que requer agente capaz, objeto lícito, possível, determinado ou determinável, e forma prescrita ou não defesa em lei. Além disso, são abordadas questões como a incapacidade relativa de uma das partes, a impossibilidade inicial do objeto, a validade da declaração de vontade, a necessidade de escritura pública em negócios imobiliários, entre outros pontos. O artigo 113 destaca a importância da interpretação dos negócios jurídicos conforme a boa-fé e os usos do lugar de sua celebração, com critérios específicos para essa interpretação. Por fim, o artigo 114 ressalta que os negócios jurídicos benéficos e a renúncia devem ser interpretados estritamente.", "O Livro III trata dos Fatos Jurídicos, com o Título I abordando o Negócio Jurídico e o Capítulo II tratando da Representação. Os poderes de representação podem ser conferidos por lei ou pelo interessado, e a manifestação de vontade do representante dentro dos limites de seus poderes produz efeitos em relação ao representado. É anulável o negócio jurídico celebrado pelo representante consigo mesmo, salvo se permitido por lei ou pelo representado. O representante deve provar sua qualidade e a extensão de seus poderes às pessoas com quem trata em nome do representado, sob pena de responder por atos que excedam esses poderes. Negócios concluídos em conflito de interesses com o representado são anuláveis, desde que tal fato fosse ou devesse ser conhecido pela outra parte. O prazo para pleitear a anulação é de cento e oitenta dias a partir da conclusão do negócio ou da cessação da incapacidade. Os requisitos e efeitos da representação legal seguem as normas respectivas, enquanto os da representação voluntária seguem a Parte Especial do Código.", "O Capítulo III do Título I do Livro III trata da condição, do termo e do encargo nos negócios jurídicos. O artigo 121 define condição como a cláusula que subordina o efeito do negócio jurídico a um evento futuro e incerto. O artigo 122 estabelece que as condições devem ser lícitas e não contrárias à lei, à ordem pública ou aos bons costumes. O artigo 123 lista as condições que invalidam os negócios jurídicos, como as impossíveis, ilícitas ou incompreensíveis. O artigo 124 considera inexistentes as condições impossíveis. Os artigos 125 a 137 tratam da eficácia das condições suspensivas e resolutivas, do termo inicial e final, e do encargo nos negócios jurídicos.", "O Livro III trata dos Fatos Jurídicos, mais especificamente do Negócio Jurídico. O Capítulo IV aborda os Defeitos do Negócio Jurídico, com destaque para a Seção I, que trata do Erro ou Ignorância. Segundo o artigo 138, os negócios jurídicos são anuláveis quando as declarações de vontade são feitas com erro substancial que poderia ser percebido por uma pessoa de diligência normal. O erro é considerado substancial quando interessa à natureza do negócio, à identidade da pessoa ou à qualidade essencial da pessoa envolvida, ou quando é o motivo único ou principal do negócio. O falso motivo só vicia a declaração de vontade se for expresso como razão determinante. O erro de cálculo permite apenas a retificação da declaração de vontade, e o erro não prejudica a validade do negócio se a pessoa a quem a manifestação de vontade se dirige se oferecer para executá-la conforme a vontade real do manifestante.", "O texto trata dos defeitos do negócio jurídico relacionados ao dolo. O dolo pode causar a anulação do negócio jurídico quando for a sua causa. O dolo acidental obriga apenas à satisfação das perdas e danos. O silêncio intencional de uma das partes em relação a um fato ou qualidade que a outra parte desconhece constitui omissão dolosa. O negócio jurídico também pode ser anulado por dolo de terceiro, desde que a parte beneficiada tenha conhecimento ou deveria ter conhecimento. O dolo do representante legal só obriga o representado a responder até o valor do proveito obtido, enquanto o dolo do representante convencional faz com que o representado responda solidariamente por perdas e danos. Se ambas as partes agirem com dolo, nenhuma delas pode alegá-lo para anular o negócio ou exigir indenização.", "O documento trata dos defeitos do negócio jurídico relacionados à coação. Para que a declaração de vontade seja viciada, a coação deve incutir ao paciente um fundado temor de dano iminente e considerável à sua pessoa, família ou bens. O juiz decidirá se houve coação caso a pessoa afetada não pertença à família do paciente. Na avaliação da coação, são considerados o sexo, idade, condição, saúde e temperamento do paciente, bem como outras circunstâncias relevantes. Não se considera coação a ameaça do exercício normal de um direito ou o simples temor reverencial. Se a coação for exercida por terceiro e a parte beneficiada tiver conhecimento, esta responderá solidariamente por perdas e danos. Se a coação for realizada por terceiro sem conhecimento da parte beneficiada, o negócio jurídico subsistirá, mas o autor da coação responderá por todas as perdas e danos causados ao coacto.", "O estado de perigo é configurado quando alguém, pressionado pela necessidade de salvar a si mesmo ou a sua família de um grave dano conhecido pela outra parte, assume uma obrigação excessivamente onerosa. No caso de envolver uma pessoa que não faça parte da família do declarante, o juiz decidirá de acordo com as circunstâncias.", "O artigo 157 do Livro III, Título I, Capítulo IV, Seção V do Código Civil trata da lesão no negócio jurídico, que ocorre quando uma pessoa, por necessidade ou inexperiência, se compromete a uma prestação desproporcional ao valor da prestação recebida. A desproporção é avaliada com base nos valores vigentes no momento da celebração do negócio. A anulação do negócio não será decretada se for oferecido um suplemento suficiente ou se a parte favorecida concordar com a redução do benefício.", "O documento trata dos defeitos do negócio jurídico, especificamente da fraude contra credores. Segundo o artigo 158, os negócios de transmissão gratuita de bens ou remissão de dívida feitos por um devedor insolvente podem ser anulados pelos credores quirografários. O artigo 159 também prevê a anulação de contratos onerosos do devedor insolvente. O artigo 160 estabelece que o adquirente dos bens do devedor insolvente pode se desobrigar depositando o preço em juízo. O documento também aborda a responsabilidade do credor quirografário que receber pagamento de dívida ainda não vencida do devedor insolvente. Além disso, menciona a presunção de fraude em garantias de dívidas dadas pelo devedor insolvente a algum credor, mas ressalta que negócios ordinários essenciais à manutenção do estabelecimento do devedor são considerados válidos. Por fim, destaca que, caso os negócios fraudulentos sejam anulados, a vantagem obtida será revertida em benefício do acervo de credores.", "O Livro III, Título I, Capítulo V trata da invalidade do negócio jurídico. O artigo 166 estabelece as condições em que um negócio jurídico é considerado nulo, como quando celebrado por pessoa absolutamente incapaz, quando o objeto é ilícito, impossível ou indeterminável, entre outros casos. O artigo 167 aborda a nulidade do negócio jurídico simulado, ressalvando os direitos de terceiros de boa-fé. O artigo 168 permite que qualquer interessado ou o Ministério Público alegue as nulidades, que devem ser pronunciadas pelo juiz. O artigo 169 estabelece que um negócio jurídico nulo não pode ser confirmado ou validado pelo decurso do tempo. O texto também aborda a anulabilidade do negócio jurídico, os prazos para pleitear a anulação, a confirmação do negócio anulável pelas partes, entre outros aspectos relacionados à invalidade e anulação de negócios jurídicos.", "O Livro III trata dos Fatos Jurídicos, mais especificamente no Título II sobre os Atos Jurídicos Lícitos. O artigo 185 estabelece que aos atos jurídicos lícitos, que não sejam negócios jurídicos, aplicam-se, no que couber, as disposições do Título anterior.", "O Livro III trata dos Fatos Jurídicos, com o Título III abordando os Atos Ilícitos. O artigo 186 define que comete ato ilícito aquele que, por ação ou omissão voluntária, negligência ou imprudência, violar direito e causar dano a outrem. O artigo 187 estabelece que também comete ato ilícito o titular de um direito que excede manifestamente os limites impostos pelo seu fim econômico ou social, pela boa-fé ou pelos bons costumes ao exercê-lo. O artigo 188 lista as situações que não constituem atos ilícitos, como os praticados em legítima defesa ou no exercício regular de um direito reconhecido, e a deterioração ou destruição da coisa alheia para remover perigo iminente, desde que absolutamente necessário e sem exceder os limites do indispensável.", "O Livro III trata dos Fatos Jurídicos, mais especificamente do Título IV que aborda a Prescrição e a Decadência. O Capítulo I trata da Prescrição, com a Seção I abordando as Disposições Gerais. O artigo 189 estabelece que, uma vez violado o direito, nasce a pretensão que se extingue pela prescrição nos prazos estabelecidos nos artigos 205 e 206. O artigo 190 determina que a exceção prescreve no mesmo prazo da pretensão. O artigo 191 fala sobre a renúncia da prescrição, que pode ser expressa ou tácita. O artigo 192 estabelece que os prazos de prescrição não podem ser alterados por acordo das partes. O artigo 193 permite que a prescrição seja alegada em qualquer instância pela parte interessada. O artigo 195 estabelece que os relativamente incapazes e pessoas jurídicas têm ação contra seus assistentes ou representantes legais que causarem a prescrição. O artigo 196 determina que a prescrição iniciada contra uma pessoa continua a correr contra seu sucessor. O artigo 194 foi revogado pela Lei nº 11.280 de 2006.", "O Livro III trata dos Fatos Jurídicos, mais especificamente do Título IV que aborda a Prescrição e a Decadência. No Capítulo I, que trata da Prescrição, a Seção II discute as causas que impedem ou suspendem a prescrição. O artigo 197 lista algumas situações em que a prescrição não corre, como entre cônjuges, ascendentes e descendentes, tutelados ou curatelados e seus tutores ou curadores. O artigo 198 também menciona situações em que a prescrição não corre, como contra incapazes, ausentes do país em serviço público ou servindo nas Forças Armadas em tempo de guerra. O artigo 199 e 200 falam sobre outras situações em que a prescrição não corre, como pendendo condição suspensiva, não estando vencido o prazo ou pendendo ação de evicção. O artigo 201 menciona que a prescrição é suspensa em favor de um dos credores solidários apenas se a obrigação for indivisível.", "O texto trata das causas que interrompem a prescrição, destacando que a interrupção só pode ocorrer uma vez. São elencadas diversas situações que podem interromper a prescrição, como despacho do juiz, protesto, apresentação de título de crédito em juízo, ato judicial que constitua em mora o devedor, entre outros. A interrupção da prescrição pode ser feita por qualquer interessado, mas a interrupção por um credor não beneficia os outros credores. No caso de devedores solidários, a interrupção por um deles beneficia os demais, assim como a interrupção contra um devedor solidário envolve os demais e seus herdeiros. A interrupção contra o principal devedor prejudica o fiador.", "O Livro III, Título IV, Capítulo I do Código Civil trata da prescrição, estabelecendo que a prescrição ocorre em dez anos quando a lei não fixar prazo menor. O artigo 206 lista os prazos de prescrição para diferentes situações, como um ano para pretensões de hospedeiros, segurados, tabeliães, entre outros. O artigo 206-A estabelece que a prescrição intercorrente seguirá o mesmo prazo da pretensão, com as causas de impedimento, suspensão e interrupção previstas no Código Civil e no Código de Processo Civil.", "O Capítulo II do Título IV do Livro III trata da decadência, estabelecendo que as normas que impedem, suspendem ou interrompem a prescrição não se aplicam à decadência, exceto se houver disposição legal em contrário. A renúncia à decadência fixada em lei é nula, e o juiz deve conhecer da decadência de ofício quando estabelecida por lei. Se a decadência for convencional, a parte a quem aproveita pode alegá-la em qualquer grau de jurisdição, mas o juiz não pode suprir a alegação.", "O documento descreve os diferentes meios de prova de fatos jurídicos, como confissão, documento, testemunha, presunção e perícia. Também aborda a eficácia da confissão, os requisitos da escritura pública, a força probante de certidões e traslados, a validade de instrumentos particulares, a autenticidade de telegramas e cópias fotográficas, a tradução de documentos em língua estrangeira, a prova por reproduções mecânicas ou eletrônicas, a prova resultante de livros e fichas empresariais, a admissibilidade da prova testemunhal, e as restrições para testemunhas, como menores de dezesseis anos, partes interessadas no litígio, cônjuges, ascendentes, descendentes e colaterais até o terceiro grau. Também menciona a recusa a exames médicos como forma de suprir a prova pretendida.", "O texto trata das obrigações de dar coisa certa, estabelecendo as regras para casos em que a coisa se perde, se deteriora ou sofre melhoramentos antes da tradição. Define que, se a perda da coisa ocorrer sem culpa do devedor, a obrigação é resolvida para ambas as partes, mas se a perda for por culpa do devedor, ele deve responder pelo equivalente e por perdas e danos. Também aborda a responsabilidade do devedor em casos de deterioração da coisa, estabelecendo as condições para resolução da obrigação. Além disso, menciona a possibilidade de o credor receber a coisa deteriorada sem direito a indenização, dependendo da culpa do devedor. Por fim, trata da situação em que ocorrem melhoramentos na coisa antes da tradição, estabelecendo as regras para a divisão dos frutos percebidos.", "O documento trata das obrigações de dar coisa incerta, onde a coisa deve ser indicada pelo menos pelo gênero e quantidade. O devedor tem o direito de escolher a coisa, desde que não seja pior do que a prometida, e o credor deve ser informado da escolha. Antes da escolha, o devedor não pode alegar perda ou deterioração da coisa.", "O documento trata das obrigações de fazer, onde o devedor que recusar a prestação imposta ou que se tornar impossível sem culpa sua terá que indenizar por perdas e danos. Se o fato puder ser executado por terceiro, o credor pode mandar executar à custa do devedor. Em caso de urgência, o credor pode executar o fato sem autorização judicial e depois ser ressarcido.", "Os artigos 250 e 251 do Livro I, Título I, Capítulo III do Direito das Obrigações tratam das obrigações de não fazer. O artigo 250 estabelece que a obrigação de não fazer se extingue caso se torne impossível ao devedor abster-se do ato que se comprometeu a não praticar, sem culpa sua. Já o artigo 251 determina que, caso o devedor realize o ato do qual se comprometeu a abster-se, o credor pode exigir que ele desfaça o ato, sob pena de fazê-lo às suas custas e ressarcir os prejuízos causados. Em casos de urgência, o credor pode desfazer ou mandar desfazer o ato, sem autorização judicial, e ainda ter direito ao ressarcimento devido.", "O texto trata das obrigações alternativas, onde o devedor tem a escolha de cumprir uma das prestações estipuladas. Caso uma das prestações não possa ser cumprida, o débito permanece em relação à outra. Se nenhuma das prestações puder ser cumprida por culpa do devedor, ele será obrigado a pagar o valor da última prestação impossibilitada, mais perdas e danos. Se a escolha couber ao credor e uma das prestações se tornar impossível por culpa do devedor, o credor poderá exigir a prestação subsistente ou o valor da outra, com perdas e danos. Se todas as prestações se tornarem impossíveis sem culpa do devedor, a obrigação será extinta.", "O texto trata das obrigações divisíveis e indivisíveis. Uma obrigação é divisível quando pode ser dividida entre os devedores ou credores, enquanto uma obrigação é indivisível quando a prestação não pode ser dividida. No caso de uma obrigação indivisível com mais de um devedor, cada um é responsável pela dívida toda. Se um devedor paga a dívida, ele tem o direito de se sub-rogar no direito do credor em relação aos outros devedores. Se um dos credores receber a prestação por inteiro, os outros têm o direito de exigir dele a parte que lhes cabe. A obrigação indivisível pode perder essa característica se for resolvida em perdas e danos, e a responsabilidade por essas perdas e danos pode ser dividida entre os devedores, dependendo da culpa de cada um.", "O documento trata das obrigações solidárias, que ocorrem quando mais de um credor ou devedor concorre na mesma obrigação, cada um com direito ou obrigação à dívida toda. A solidariedade não é presumida, sendo resultado da lei ou da vontade das partes. A obrigação solidária pode ser pura e simples para um dos co-credores ou co-devedores, e condicional, a prazo ou pagável em lugar diferente para o outro.", "O texto trata das obrigações solidárias, onde cada credor solidário tem direito a exigir do devedor o cumprimento da prestação por inteiro. Enquanto alguns credores não demandarem o devedor, este pode pagar a qualquer um deles. O pagamento feito a um dos credores extingue a dívida até o montante pago. Se um dos credores falecer, seus herdeiros só terão direito à quota correspondente ao seu quinhão hereditário, salvo se a obrigação for indivisível. A solidariedade subsiste em caso de conversão da prestação em perdas e danos. O credor que remitir a dívida ou receber o pagamento responderá aos outros pela parte que lhes cabe. O devedor não pode opor exceções pessoais a um dos credores solidários. Um julgamento contrário a um credor não afeta os demais, mas um favorável beneficia a todos, sem prejuízo de exceções pessoais que o devedor possa invocar.", "O documento trata das obrigações solidárias, onde o credor tem o direito de exigir o pagamento parcial ou total da dívida comum de um ou alguns dos devedores, mantendo os demais devedores obrigados solidariamente pelo restante. Caso um dos devedores solidários faleça, seus herdeiros só serão obrigados a pagar a quota correspondente ao seu quinhão hereditário, a menos que a obrigação seja indivisível. Pagamentos parciais feitos por um devedor não beneficiam os outros, e cláusulas adicionais entre um devedor e o credor não podem prejudicar os demais sem o consentimento destes. Todos os devedores respondem pelos juros da mora, e o devedor que paga a dívida por inteiro tem o direito de exigir a quota de cada co-devedor. O credor pode renunciar à solidariedade em favor de um ou mais devedores, mas a solidariedade dos demais permanece.", "O documento trata da cessão de crédito, onde o credor pode transferir seu crédito para outra pessoa, desde que não haja proibição na lei ou na convenção com o devedor. A cessão deve ser feita por instrumento público ou particular com as devidas formalidades. O cessionário tem direito de fazer averbar a cessão no registro do imóvel em caso de crédito hipotecário. O devedor deve ser notificado da cessão para que tenha eficácia, e pode opor exceções ao cessionário. O cedente é responsável pela existência do crédito no momento da cessão, e pode ser responsabilizado por má-fé. O cedente não responde pela solvência do devedor, a menos que haja estipulação em contrário. O crédito penhorado não pode mais ser transferido pelo credor que teve conhecimento da penhora.", "O Capítulo II do Título II do Livro I trata da Assunção de Dívida, onde é permitido a um terceiro assumir a obrigação do devedor com o consentimento expresso do credor, exonerando o devedor original, exceto se este era insolvente e o credor não sabia. Caso o devedor primitivo não consinta, as garantias especiais por ele dadas ao credor são extintas. Se a substituição do devedor for anulada, o débito é restaurado, exceto as garantias prestadas por terceiros que não conheciam o vício. O novo devedor não pode alegar exceções pessoais do devedor original e o adquirente de imóvel hipotecado pode assumir o pagamento do crédito garantido, desde que o credor não se oponha em trinta dias.", "O texto trata do pagamento das obrigações, destacando que qualquer interessado na extinção da dívida pode pagá-la, desde que utilize meios que levem à exoneração do devedor. O terceiro não interessado que paga a dívida em seu próprio nome tem direito a reembolso, mas não se sub-roga nos direitos do credor. Se o pagamento for feito antes do vencimento, o terceiro só terá direito ao reembolso no vencimento. O pagamento feito por terceiro, com desconhecimento ou oposição do devedor, não obriga a reembolsar aquele que pagou se o devedor poderia ter evitado a ação. O pagamento só terá eficácia se houver transmissão da propriedade, e se for feito por quem possa alienar o objeto. Se o pagamento for feito com uma coisa fungível e o credor a consumir de boa-fé, mesmo que o solvente não tivesse o direito de aliená-la, não poderá mais ser reclamada.", "O texto apresenta as regras relacionadas ao pagamento das obrigações, destacando que o pagamento deve ser feito ao credor ou a quem o represente, sob pena de só valer depois de ratificado pelo credor. Além disso, o pagamento feito de boa-fé ao credor putativo é válido, mesmo que depois se prove que não era credor. No entanto, o pagamento feito a um credor incapaz de quitar não é válido, a menos que o devedor prove que o benefício reverteu para ele. O texto também aborda a autorização para receber o pagamento, salvo circunstâncias que contrariem essa presunção, e a situação em que o devedor paga ao credor apesar de penhora ou impugnação, sendo que nesses casos o pagamento não valerá contra terceiros.", "O documento trata do pagamento das obrigações, estabelecendo que o credor não é obrigado a receber prestação diversa da que lhe é devida, nem a receber por partes se não houver acordo. Também aborda a forma de pagamento em dinheiro, a possibilidade de aumento progressivo de prestações, a correção de desproporção entre o valor da prestação e o momento da execução, a nulidade de convenções de pagamento em ouro ou moeda estrangeira, o direito do devedor a quitação regular, a presunção de pagamento dos juros se a quitação do capital for sem reserva, entre outros pontos relacionados ao objeto do pagamento e sua prova.", "O documento trata do pagamento das obrigações, estabelecendo que o pagamento deve ser feito no domicílio do devedor, a menos que as partes tenham acordado de outra forma ou que a lei, a natureza da obrigação ou as circunstâncias determinem o contrário. Se houver mais de um local designado para o pagamento, cabe ao credor escolher entre eles. Se o pagamento envolver a transferência de um imóvel, este deve ser feito no local onde o bem está situado. Em casos de motivo grave que impeça o pagamento no local determinado, o devedor pode fazê-lo em outro local, sem prejudicar o credor. O pagamento repetidamente feito em outro local presume a renúncia do credor em relação ao local previsto no contrato.", "O texto trata do pagamento das obrigações, estabelecendo que, salvo disposição em contrário, o credor pode exigir o pagamento imediatamente caso não tenha sido ajustada uma época para o pagamento. Além disso, as obrigações condicionais são cumpridas na data do implemento da condição, sendo necessário que o credor prove que o devedor teve ciência disso. O credor também tem o direito de cobrar a dívida antes do prazo estipulado no contrato ou no Código Civil, em casos como falência do devedor, penhora dos bens em execução por outro credor, ou cessação das garantias do débito. Nos casos de solidariedade passiva, o débito não será considerado vencido para os outros devedores solventes.", "O documento trata do pagamento em consignação como forma de extinção das obrigações. A consignação tem lugar em diversas situações, como quando o credor recusa receber o pagamento, quando há dúvida sobre quem deve receber, ou quando há litígio sobre o objeto do pagamento. Para que a consignação seja válida, é necessário que todos os requisitos em relação às pessoas, ao objeto, modo e tempo estejam presentes. O depósito deve ser feito no lugar do pagamento e, uma vez julgado procedente, o devedor não poderá levantá-lo sem o consentimento do credor. As despesas com o depósito são de responsabilidade do credor se for julgado procedente, e do devedor se for julgado improcedente. O devedor de uma obrigação litigiosa pode se exonerar mediante consignação, mas assume o risco do pagamento se pagar a qualquer dos pretendidos credores tendo conhecimento do litígio.", "O documento trata da sub-rogação no pagamento de dívidas, onde o credor que paga a dívida do devedor comum, o adquirente do imóvel hipotecado que paga o credor hipotecário e o terceiro interessado que paga uma dívida pela qual era ou podia ser obrigado, têm direito à sub-rogação. A sub-rogação pode ser convencional, quando o credor transfere seus direitos a terceiro que efetua o pagamento, ou quando uma terceira pessoa empresta ao devedor a quantia para pagar a dívida sob a condição de ficar sub-rogado nos direitos do credor. A sub-rogação transfere ao novo credor todos os direitos, ações, privilégios e garantias do primitivo em relação à dívida. Na sub-rogação legal, o sub-rogado só pode exercer os direitos do credor até o valor que desembolsou para desobrigar o devedor. O credor originário terá preferência sobre o sub-rogado na cobrança da dívida restante se os bens do devedor não forem suficientes para saldar a dívida.", "O texto trata da imputação do pagamento em caso de múltiplas dívidas da mesma natureza para um único credor. O devedor tem o direito de indicar a qual dívida quer oferecer o pagamento, desde que todas sejam líquidas e vencidas. Caso não indique, a quitação será imputada primeiro nos juros vencidos e depois no capital, a menos que haja estipulação em contrário. Se a quitação for omissa quanto à imputação, esta será feita nas dívidas líquidas e vencidas em primeiro lugar, ou na mais onerosa se todas forem ao mesmo tempo. O devedor só poderá reclamar contra a imputação feita pelo credor se provar violência ou dolo.", "O documento trata do direito das obrigações, especificamente sobre a dação em pagamento. O credor pode concordar em receber uma prestação diferente daquela devida e, uma vez determinado o preço da coisa dada em pagamento, as relações entre as partes serão regidas pelas normas do contrato de compra e venda. Se a coisa dada em pagamento for um título de crédito, a transferência implicará em cessão. Caso o credor seja desapossado da coisa recebida em pagamento, a obrigação original será restabelecida, anulando a quitação dada, exceto pelos direitos de terceiros.", "O documento trata da novação, que é a substituição de uma obrigação por outra, extinguindo a primeira. A novação pode ocorrer de três formas: quando o devedor contrai uma nova dívida com o credor para substituir a anterior, quando um novo devedor assume a dívida do antigo devedor, e quando um novo credor substitui o antigo. A novação pode ser feita sem o consentimento do devedor, mas se o novo devedor for insolvente, o credor não terá ação regressiva contra o antigo devedor, a menos que este tenha agido de má-fé. A novação extingue os acessórios e garantias da dívida, exceto se houver estipulação em contrário. A novação também exonera os fiadores, a menos que tenham consentido com a nova obrigação. Além disso, não podem ser objeto de novação obrigações nulas ou extintas, exceto as simplesmente anuláveis.", "O texto trata da compensação de dívidas entre duas pessoas que são credoras e devedoras uma da outra. A compensação só pode ser feita entre dívidas líquidas, vencidas e de coisas fungíveis. Existem algumas exceções para a compensação, como quando as dívidas têm causas diferentes, quando uma dívida é de coisa não penhorável, entre outros casos. Também são abordadas questões como a exclusão da compensação por acordo mútuo, a impossibilidade de compensar dívidas de terceiros e a necessidade de dedução de despesas quando as dívidas não são pagáveis no mesmo lugar. Além disso, é destacado que a compensação não pode prejudicar os direitos de terceiros.", "A confusão é um meio de extinção das obrigações que ocorre quando as qualidades de credor e devedor se confundem na mesma pessoa. Pode ocorrer em relação a toda a dívida ou apenas parte dela. Quando a confusão ocorre em um credor ou devedor solidário, a obrigação é extinta apenas até a concorrência da respectiva parte no crédito ou na dívida, mantendo-se a solidariedade para o restante. Após a cessação da confusão, a obrigação anterior é restabelecida com todos os seus acessórios.", "O Título III do Livro I trata do Adimplemento e Extinção das Obrigações, e o Capítulo IX aborda a Remissão das Dívidas. O artigo 385 estabelece que a remissão da dívida, aceita pelo devedor, extingue a obrigação. O artigo 386 diz que a devolução voluntária do título da obrigação prova a desoneração do devedor e seus co-obrigados. O artigo 387 afirma que a restituição voluntária do objeto empenhado prova a renúncia do credor à garantia real. Já o artigo 388 estabelece que a remissão concedida a um dos co-devedores extingue a dívida na parte correspondente a ele.", "O Livro I trata do Direito das Obrigações, e o Título IV aborda o Inadimplemento das Obrigações. O Capítulo I traz as Disposições Gerais, onde o Art. 389 estabelece que o devedor que não cumpre a obrigação deve arcar com perdas e danos, juros, atualização monetária e honorários de advogado. O Art. 390 diz que nas obrigações negativas, o devedor é considerado inadimplente desde o dia em que executou o ato que deveria evitar. O Art. 391 determina que todos os bens do devedor respondem pelo inadimplemento das obrigações. O Art. 392 estabelece que nos contratos benéficos, o contratante que se beneficia responde por simples culpa, enquanto no contrato oneroso, cada parte responde por culpa, exceto as exceções previstas em lei. O Art. 393 diz que o devedor não responde por prejuízos causados por caso fortuito ou força maior, a menos que tenha se responsabilizado expressamente por eles. O parágrafo único define caso fortuito ou força maior como um fato necessário cujos efeitos não era possível evitar ou impedir.", "O documento trata do inadimplemento das obrigações, especificamente da mora. Define-se a mora como a falta de pagamento por parte do devedor ou a recusa do credor em receber o pagamento no tempo, lugar e forma estabelecidos. O devedor em mora é responsável pelos prejuízos causados, juros, atualização monetária e honorários advocatícios. Se a prestação se tornar inútil ao credor devido à mora, ele pode rejeitá-la e exigir perdas e danos. O inadimplemento de uma obrigação líquida e positiva no seu termo constitui automaticamente o devedor em mora. A mora do credor também implica em responsabilidades. A mora pode ser purgada pelo devedor oferecendo a prestação mais os prejuízos decorrentes, ou pelo credor aceitando o pagamento até uma determinada data.", "O texto trata das perdas e danos decorrentes do inadimplemento das obrigações. O artigo 402 estabelece que, salvo exceções previstas em lei, as perdas e danos devidas ao credor incluem não apenas o que ele efetivamente perdeu, mas também o que razoavelmente deixou de lucrar. O artigo 403 determina que, mesmo em caso de dolo do devedor, as perdas e danos se limitam aos prejuízos efetivos e lucros cessantes diretos e imediatos. O artigo 404 estabelece que, nas obrigações de pagamento em dinheiro, as perdas e danos devem ser pagas com atualização monetária, incluindo juros, custas e honorários de advogado. O parágrafo único desse artigo permite ao juiz conceder indenização suplementar ao credor se os juros da mora não cobrirem o prejuízo e não houver pena convencional. O artigo 405 determina que os juros de mora devem ser contados a partir da citação inicial.", "O artigo 406 estabelece que, quando os juros moratórios não forem convencionados, serão fixados de acordo com a taxa em vigor para a mora do pagamento de impostos à Fazenda Nacional. Já o artigo 407 determina que o devedor é obrigado a pagar juros de mora, mesmo que não haja alegação de prejuízo, desde que o valor da dívida esteja fixado por sentença judicial, arbitramento ou acordo entre as partes.", "O texto trata da cláusula penal, que é uma penalidade estipulada no contrato para o caso de inadimplemento da obrigação. O devedor incorre na cláusula penal se deixar de cumprir a obrigação culposamente ou se constituir em mora. A cláusula penal pode referir-se à inexecução completa da obrigação, à mora ou a alguma cláusula especial. Se a cláusula penal for para o caso de total inadimplemento, ela se converte em alternativa a benefício do credor. O valor da penalidade não pode exceder o da obrigação principal e deve ser reduzido pelo juiz se for excessivo. Se a obrigação for indivisível, todos os devedores respondem pela pena, mas apenas o culpado pode ser demandado integralmente. Se a obrigação for divisível, apenas o devedor que a infringir incorre na pena. O credor não precisa alegar prejuízo para exigir a pena convencional, mas se houver prejuízo excedente, o credor só pode exigir indenização suplementar se isso tiver sido convencionado.", "O texto trata das arras ou sinal em contratos, onde uma parte dá dinheiro ou outro bem móvel à outra parte como garantia. Se a parte que deu as arras não cumprir o contrato, a outra parte pode considerá-lo desfeito e reter as arras. Se a inexecução for de quem recebeu as arras, a parte que deu as arras pode considerar o contrato desfeito e exigir sua devolução mais o equivalente. A parte inocente pode pedir indenização suplementar se provar maior prejuízo, sendo as arras consideradas como taxa mínima. Se houver direito de arrependimento no contrato, as arras terão função indenizatória e quem as deu as perderá em benefício da outra parte, sem direito a indenização suplementar.", "O documento apresenta disposições gerais sobre contratos, destacando a importância da função social do contrato, a presunção de paridade e simetria nos contratos civis e empresariais, a necessidade de boa-fé e probidade por parte dos contratantes, a interpretação favorável ao aderente em contratos de adesão, a nulidade de cláusulas que estipulem renúncia antecipada de direitos, a possibilidade de estipular contratos atípicos e a proibição de contratar a herança de pessoa viva. Além disso, ressalta a excepcionalidade da revisão contratual e a importância da alocação de riscos definida pelas partes.", "O documento apresenta as disposições gerais sobre a formação dos contratos, destacando que a proposta de contrato obriga o proponente, a menos que haja indicação contrária nos termos da proposta, na natureza do negócio ou nas circunstâncias do caso. Deixa de ser obrigatória a proposta se não for imediatamente aceita por uma pessoa presente, se decorrer tempo suficiente para uma resposta de uma pessoa ausente, se a resposta não for enviada dentro do prazo dado, ou se houver retratação do proponente antes da aceitação. A oferta ao público equivale a proposta, a menos que as circunstâncias ou usos indiquem o contrário. A aceitação tardia deve ser comunicada imediatamente ao proponente, sob pena de perdas e danos. A aceitação com adições, restrições ou modificações implica em uma nova proposta. O contrato entre ausentes torna-se perfeito quando a aceitação é enviada, exceto em casos específicos. O contrato é considerado celebrado no local em que foi proposto.", "O documento trata das disposições gerais sobre a estipulação em favor de terceiro nos contratos. O artigo 436 estabelece que o terceiro beneficiado pela estipulação pode exigir o cumprimento da obrigação. O parágrafo único ressalta que o terceiro também pode exigir a obrigação, desde que concorde com as condições do contrato. O artigo 437 impede que o estipulante exonere o devedor se o terceiro tiver o direito de exigir a execução do contrato. Já o artigo 438 permite que o estipulante substitua o terceiro designado no contrato, sem a necessidade de anuência do terceiro ou do outro contratante.", "O artigo 439 estabelece que aquele que prometer o fato de um terceiro será responsável por perdas e danos caso o terceiro não cumpra o prometido. O parágrafo único ressalta que essa responsabilidade não existe se o terceiro for o cônjuge do promitente e este concordar com o ato, desde que a indenização recaia sobre os bens do cônjuge. Já o artigo 440 determina que não haverá obrigação para quem se comprometer por outra pessoa se esta não cumprir a prestação após se comprometer.", "O texto trata dos vícios redibitórios em contratos de compra e venda, onde o adquirente pode rejeitar a coisa ou pedir abatimento no preço caso haja defeitos ocultos que a tornem imprópria para o uso ou diminuam o seu valor. O alienante é responsável por restituir o valor recebido com perdas e danos caso conhecesse o vício, e apenas o valor recebido mais as despesas do contrato caso não o conhecesse. O adquirente tem um prazo de trinta dias para reclamar a redibição ou abatimento no preço para bens móveis, e um ano para bens imóveis, contados a partir da entrega efetiva. Em casos onde o vício só pode ser conhecido mais tarde, o prazo é contado a partir do momento em que o adquirente tem ciência do mesmo. Em vendas de animais, os prazos de garantia por vícios ocultos são estabelecidos por lei especial ou usos locais. Não correm os prazos de garantia na presença de cláusula de garantia, mas o adquirente deve denunciar o defeito ao alienante nos trinta dias seguintes ao seu descobrimento.", "O documento trata da evicção nos contratos onerosos, onde o alienante é responsável por garantir que o adquirente não seja privado do bem adquirido por decisão judicial. As partes podem incluir cláusulas para reforçar, diminuir ou excluir essa responsabilidade. Caso ocorra a evicção, o evicto tem direito a receber o preço pago pela coisa, indenização por frutos perdidos, despesas e prejuízos, custas judiciais e honorários advocatícios. O valor a ser restituído será proporcional ao desfalque sofrido. O alienante também é responsável por benfeitorias necessárias ou úteis não abonadas ao evicto. Em casos de evicção parcial, o evicto pode optar pela rescisão do contrato ou restituição parcial do preço. O adquirente não pode demandar pela evicção se sabia que a coisa era alheia ou litigiosa.", "Os artigos 458, 459, 460 e 461 do Livro I, Título V, Capítulo I, Seção VII do Código Civil tratam dos contratos aleatórios. Eles estabelecem que, em contratos aleatórios, se uma das partes assume o risco de coisas ou fatos futuros e estes não se concretizarem, a outra parte tem direito a receber o que lhe foi prometido, desde que não tenha agido com dolo ou culpa. Além disso, se a coisa futura não existir, o contrato pode ser anulado. Também é mencionado que, em contratos aleatórios envolvendo coisas existentes expostas a risco, o alienante tem direito ao preço acordado, mesmo que a coisa não exista mais no momento da realização do contrato.", "O contrato preliminar é um acordo que antecede a celebração do contrato definitivo e deve conter todos os requisitos essenciais deste último. Após a conclusão do contrato preliminar, qualquer das partes pode exigir a celebração do contrato definitivo, desde que não haja cláusula de arrependimento. O contrato preliminar deve ser levado ao registro competente e, caso uma das partes não cumpra com suas obrigações, a outra parte pode considerá-lo desfeito e pedir perdas e danos. Se a promessa de contrato for unilateral, o credor deve manifestar-se dentro do prazo estipulado ou razoavelmente assinado pelo devedor, caso contrário a promessa perde seu efeito.", "O texto trata do contrato com pessoa a declarar, onde uma das partes reserva-se o direito de indicar a pessoa que deve adquirir os direitos e assumir as obrigações decorrentes do contrato. A indicação deve ser comunicada à outra parte em até cinco dias da conclusão do contrato e a aceitação da pessoa nomeada deve ser feita da mesma forma que as partes usaram para o contrato. A pessoa nomeada adquire os direitos e assume as obrigações a partir do momento da celebração do contrato. O contrato será eficaz apenas entre os contratantes originários se não houver indicação de pessoa, se a pessoa nomeada se recusar a aceitar, ou se ela era insolvente e a outra parte desconhecia esse fato. Se a pessoa nomeada era incapaz ou insolvente no momento da nomeação, o contrato produzirá efeitos apenas entre os contratantes originários.", "O documento trata do Direito das Obrigações, especificamente sobre os Contratos em Geral. Na Seção I do Capítulo II, aborda-se o tema da extinção do contrato, destacando o Distrato como forma de encerramento do contrato, que deve seguir a mesma forma exigida para a sua celebração. Além disso, menciona a resilição unilateral, que pode ocorrer nos casos permitidos pela lei, mediante denúncia notificada à outra parte. No entanto, se uma das partes fez investimentos consideráveis para a execução do contrato, a denúncia unilateral só terá efeito após um prazo compatível com a natureza e o vulto dos investimentos.", "O Artigo 474 trata da cláusula resolutiva expressa, que opera de pleno direito, enquanto a tácita depende de interpelação judicial. Já o Artigo 475 estabelece que a parte lesada pelo inadimplemento pode pedir a resolução do contrato ou exigir o cumprimento, cabendo indenização por perdas e danos em ambos os casos.", "No direito das obrigações, no título V sobre os contratos em geral, no capítulo II sobre a extinção do contrato, na seção III sobre a exceção de contrato não cumprido, o artigo 476 estabelece que em contratos bilaterais nenhum dos contratantes pode exigir o cumprimento da obrigação do outro antes de cumprir a sua própria obrigação. Já o artigo 477 prevê que se uma das partes sofrer uma diminuição em seu patrimônio que comprometa a prestação acordada, a outra parte pode recusar-se a cumprir sua obrigação até que a primeira parte satisfaça a sua parte ou dê garantias suficientes.", "O texto trata da resolução por onerosidade excessiva em contratos de execução continuada ou diferida. O devedor pode pedir a resolução do contrato se a prestação se tornar excessivamente onerosa devido a acontecimentos extraordinários e imprevisíveis. A resolução pode ser evitada se o réu se oferecer a modificar equitativamente as condições do contrato. Se as obrigações couberem apenas a uma das partes, ela pode pleitear a redução da prestação ou a alteração do modo de executá-la para evitar a onerosidade excessiva.", "O contrato de compra e venda é definido como a transferência do domínio de uma coisa em troca de um preço em dinheiro. O contrato é considerado válido quando as partes concordam sobre o objeto e o preço. A compra e venda pode ter como objeto uma coisa atual ou futura, e o vendedor deve garantir que a coisa corresponda às amostras apresentadas. O preço pode ser fixado por terceiros, por índices de mercado ou por acordo entre as partes. O vendedor é responsável pelos riscos da coisa até a tradição, enquanto o comprador é responsável pelo preço. Existem regras específicas para a venda de imóveis, incluindo a possibilidade de complemento de área se as dimensões não corresponderem ao que foi acordado. O vendedor responde por débitos que gravem a coisa até a tradição, e um condômino não pode vender sua parte a estranhos se outro consorte quiser comprar pelo mesmo valor.", "O documento trata das cláusulas especiais à compra e venda, abordando a retrovenda, a venda a contento, a venda sujeita a prova, a preempção ou preferência, a venda com reserva de domínio e a venda sobre documentos. São apresentadas as condições e procedimentos para cada uma dessas modalidades de contrato, incluindo prazos, direitos e obrigações tanto do vendedor quanto do comprador. Também são mencionadas as consequências em caso de descumprimento das cláusulas estabelecidas.", "O artigo 533 do Livro I do Direito das Obrigações trata da troca ou permuta, aplicando as disposições referentes à compra e venda com algumas modificações. Estabelece que, salvo disposição em contrário, cada contratante pagará metade das despesas com o instrumento da troca e que a troca de valores desiguais entre ascendentes e descendentes é anulável sem o consentimento dos outros descendentes e do cônjuge do alienante.", "O contrato estimatório é aquele em que o consignante entrega bens móveis ao consignatário, que pode vendê-los ou restituí-los dentro do prazo estabelecido. O consignatário deve pagar o preço acordado, mesmo que a restituição da coisa se torne impossível. A coisa consignada não pode ser penhorada pelos credores do consignatário até que o preço seja integralmente pago. O consignante não pode dispor da coisa antes de ser restituída ou comunicada a restituição.", "O documento trata das disposições gerais sobre doações, definindo o que é uma doação, as formas de aceitação, os tipos de doações (pura, remuneratória, gravada), as formalidades necessárias para sua validade, as condições especiais para doações a nascituros, incapazes e em contemplação de casamento, as possibilidades de anulação de doações, a distribuição entre donatários em caso de doação em comum, as obrigações do doador e do donatário, e as consequências em caso de descumprimento dos encargos da doação. Também aborda a nulidade de doações de todos os bens sem reserva de parte, doações que excedam a parte disponível em testamento, doações de cônjuges adúlteros, e doações a entidades futuras.", "O documento trata da revogação da doação por ingratidão do donatário ou por inexecução do encargo. São listados os motivos pelos quais a doação pode ser revogada, como atentado contra a vida do doador, ofensa física, injúria grave, recusa de alimentos, entre outros. Também são estabelecidas as condições e prazos para pleitear a revogação, bem como as consequências para o donatário. Além disso, são mencionadas as situações em que a revogação não se aplica, como doações remuneratórias, com encargo cumprido, em cumprimento de obrigação natural ou para determinado casamento.", "O documento trata da locação de coisas, onde uma das partes se compromete a ceder o uso de uma coisa não fungível à outra parte mediante uma retribuição. O locador deve entregar a coisa em bom estado e garantir o uso pacífico, resguardando o locatário de embaraços de terceiros. O locatário deve usar a coisa conforme acordado, pagar o aluguel pontualmente e restituí-la no mesmo estado. O contrato pode ser rescindido se houver uso indevido da coisa. O documento também aborda questões como prazo de locação, renovação automática, direito de retenção do locatário, e transferência da locação em caso de morte do locador ou locatário.", "O comodato é o empréstimo gratuito de coisas não fungíveis, que se concretiza com a entrega do objeto. Os tutores, curadores e administradores de bens alheios não podem emprestar bens sem autorização. Se não houver prazo estabelecido, presume-se o prazo necessário para o uso concedido. O comodatário deve cuidar da coisa emprestada como se fosse sua, só podendo usá-la de acordo com o contrato. Se houver risco para a coisa emprestada, o comodatário deve priorizar sua salvação, caso contrário será responsável pelo dano. O comodatário não pode reembolsar o comodante pelas despesas feitas com a coisa emprestada. Se várias pessoas forem comodatárias ao mesmo tempo, serão solidariamente responsáveis perante o comodante.", "O mútuo é um tipo de empréstimo de coisas fungíveis, onde o mutuário deve restituir ao mutuante a mesma coisa em gênero, qualidade e quantidade. O empréstimo transfere o domínio da coisa emprestada ao mutuário, que assume todos os riscos a partir da entrega. Em casos de empréstimo feito a pessoa menor sem autorização, o mutuante não pode reaver o empréstimo, a menos que haja ratificação posterior, necessidade de alimentos habituais, bens ganhos com trabalho, benefício do menor ou obtenção maliciosa do empréstimo. O mutuante pode exigir garantia de restituição se houver mudança na situação econômica do mutuário. Em empréstimos destinados a fins econômicos, são presumidos juros limitados pela taxa do artigo 406, com possibilidade de capitalização anual. O prazo do mútuo pode variar de acordo com o tipo de coisa emprestada.", "O Capítulo VII do Livro I trata da prestação de serviço, que pode ser contratada mediante retribuição, e estabelece regras como a forma de pagamento, a duração do contrato, as condições de rescisão, as responsabilidades das partes e as consequências da falta de habilitação do prestador de serviço. O contrato de prestação de serviço pode ser encerrado por diversos motivos, como a morte de uma das partes, o término do prazo, a conclusão da obra, a rescisão por aviso prévio, o descumprimento de uma das partes ou a impossibilidade de continuação devido a força maior. Também é mencionado que a alienação do prédio agrícola onde os serviços são prestados não implica na rescisão do contrato, cabendo ao prestador a opção de continuar com o novo proprietário ou com o contratante original.", "O documento trata do contrato de empreitada, onde o empreiteiro pode contribuir com seu trabalho ou com materiais, sendo que a obrigação de fornecer os materiais não se presume. O empreiteiro é responsável pelos riscos dos materiais até a entrega da obra, a menos que o dono esteja em mora. Se a obra for apenas de mão-de-obra, os riscos correm por conta do dono. O empreiteiro perde a retribuição se a obra perecer sem culpa sua. O dono deve receber a obra de acordo com o ajuste, podendo rejeitá-la se o empreiteiro não seguir as instruções. O empreiteiro é responsável pela solidez da obra por cinco anos. O dono não pode introduzir modificações no projeto sem autorização do empreiteiro, a menos que seja por motivos técnicos. O contrato não se extingue pela morte de uma das partes, a menos que seja ajustado considerando as qualidades pessoais do empreiteiro.", "O contrato de depósito é regulado pelos artigos 627 a 646 do Livro I, Título VI, Capítulo IX do Código Civil. O depósito é gratuito, a menos que haja acordo em contrário, resulte de atividade negocial ou seja praticado por profissão. O depositário deve cuidar da coisa depositada como se fosse sua, devendo restituí-la com todos os frutos e acrescidos quando solicitado pelo depositante. A restituição deve ser feita no local onde a coisa deve ser guardada, com as despesas por conta do depositante. O depositário não pode se exonerar do depósito sem consentimento do depositante se a coisa foi depositada no interesse de terceiro. O depositário só pode reter o depósito se houver dívidas, despesas ou prejuízos comprovados, podendo exigir caução do depositante ou a remoção da coisa para o Depósito Público. O depósito de coisas fungíveis segue as regras do mútuo e o depósito voluntário deve ser provado por escrito.", "O texto trata do depósito necessário, que é aquele feito em cumprimento de uma obrigação legal ou em situações de calamidade, como incêndio, inundação, naufrágio ou saque. O depósito necessário é regido pela lei correspondente, e na ausência desta, pelas regras do depósito voluntário. Os hospedeiros são equiparados a depositários quando se trata do depósito das bagagens de viajantes ou hóspedes em hospedarias, sendo responsáveis por furtos e roubos cometidos por seus funcionários. A remuneração pelo depósito está incluída no preço da hospedagem. O depositário que não restituir o depósito quando exigido pode ser compelido a fazê-lo mediante prisão e ressarcimento dos prejuízos.", "O mandato é um contrato em que alguém recebe poderes para agir em nome de outra pessoa. Pode ser dado por instrumento particular, que deve conter informações específicas, ou por instrumento público. O mandato pode ser expresso ou tácito, verbal ou escrito. A aceitação do mandato pode ser tácita e resulta do início da execução. O mandato pode ser especial para negócios específicos ou geral para todos os negócios do mandante. Os atos praticados sem mandato válido são ineficazes, a menos que sejam ratificados pelo mandante. O mandatário tem direito a reter parte do objeto da operação para pagamento do que lhe é devido. Se o mandatário exceder os poderes do mandato, será considerado mero gestor de negócios até que o mandante ratifique os atos. Menores de dezesseis a dezoito anos não emancipados podem ser mandatários, mas o mandante só pode agir contra eles de acordo com as regras gerais aplicáveis às obrigações contraídas por menores.", "O documento trata das obrigações do mandatário em um contrato de mandato. O mandatário deve aplicar diligência na execução do mandato e indenizar qualquer prejuízo causado por culpa sua ou do substituto, caso haja. Deve prestar contas ao mandante e transferir-lhe as vantagens do mandato. Não pode compensar prejuízos com proveitos e deve pagar juros se utilizar fundos do mandante para proveito próprio. O mandatário não pode realizar negócios exorbitantes do mandato sem autorização, a menos que haja promessa de ratificação do mandante. Mesmo ciente da morte ou mudança do mandante, o mandatário deve concluir negócios em andamento se houver perigo na demora.", "O mandante é responsável por satisfazer as obrigações contraídas pelo mandatário de acordo com o mandato conferido, adiantar as despesas necessárias, pagar a remuneração e despesas do mandato, ressarcir as perdas do mandatário, mesmo que o negócio não tenha o efeito esperado, e pagar juros sobre as somas adiantadas. Mesmo que o mandatário contrarie as instruções do mandante, este ainda é responsável perante terceiros com quem o mandatário contratou. Se o mandato foi outorgado por várias pessoas para um negócio comum, cada uma é solidariamente responsável, mas tem direito regressivo contra os outros mandantes. O mandatário tem direito de retenção sobre a coisa da qual tem posse até se reembolsar das despesas do mandato.", "O documento trata da extinção do mandato, listando as diversas formas pelas quais o mandato pode cessar, como revogação, renúncia, morte de uma das partes, mudança de estado que inabilite o mandante ou mandatário, término do prazo ou conclusão do negócio. Também aborda a revogação do mandato com cláusula de irrevogabilidade, a revogação do mandato em causa própria, a comunicação da renúncia do mandato, a validade dos atos realizados pelo mandatário em nome do mandante, mesmo após a morte deste, e as responsabilidades dos herdeiros do mandatário em caso de falecimento deste durante um negócio pendente.", "O artigo 692 do Livro I, Título VI, Capítulo X do Código Civil trata do mandato judicial, que está sujeito às normas da legislação processual e, de forma suplementar, às regras estabelecidas no próprio Código Civil.", "O contrato de comissão tem por objeto a compra ou venda de bens ou a realização de mútuo ou outro negócio jurídico de crédito pelo comissário, em seu próprio nome, à conta do comitente. O comissário fica diretamente obrigado para com as pessoas com quem contratar, sem que estas tenham ação contra o comitente, exceto se o comissário ceder seus direitos a qualquer das partes. O comissário deve agir de acordo com as ordens e instruções do comitente, e se não houver instruções, deve proceder segundo os usos em casos semelhantes. O comissário deve agir com cuidado e diligência, evitando prejuízos ao comitente e proporcionando lucro razoável. O comissário não responde pela insolvência das pessoas com quem tratar, exceto em caso de culpa. Se houver a cláusula del credere, o comissário responde solidariamente com as pessoas com quem tratou em nome do comitente. O comissário tem direito a remuneração mais elevada se assumir esse ônus. O comissário pode conceder dilação do prazo para pagamento conforme os usos locais, salvo instruções do comitente em contrário. A remuneração do comissário será arbitrada segundo os usos correntes no lugar. O comitente pode alterar as instruções dadas ao comissário a qualquer momento. O comissário tem direito a remuneração pelos serviços prestados, mesmo se for dispensado sem justa causa. O comitente e o comissário são obrigados a pagar juros um ao outro. O crédito do comissário goza de privilégio geral em caso de falência ou insolvência do comitente. São aplicáveis à comissão, no que couber, as regras sobre mandato.", "O contrato de agência é aquele em que uma pessoa se compromete a promover negócios em nome de outra, em uma zona determinada, sem vínculos de dependência. O agente deve agir com diligência e seguir as instruções do proponente, arcando com as despesas, mas tendo direito à remuneração pelos negócios concluídos. Em caso de rescisão sem justa causa, o agente tem direito a indenização e remuneração pelos serviços prestados. O contrato pode ser rescindido por ambas as partes com aviso prévio, e as regras do contrato de agência seguem as do mandato e comissão, além de leis especiais.", "O contrato de corretagem é aquele em que uma pessoa se compromete a obter negócios para outra, sem que haja uma relação de dependência entre elas. O corretor deve agir com diligência e prudência, fornecendo todas as informações necessárias ao cliente. A remuneração do corretor deve ser estabelecida de acordo com a natureza do negócio e os costumes locais. O corretor tem direito à remuneração mesmo que o negócio não se concretize devido ao arrependimento das partes. Se o negócio for concluído diretamente entre as partes, sem a mediação do corretor, ele não terá direito à remuneração, a menos que tenha um contrato de exclusividade. Se o negócio for realizado posteriormente devido aos esforços do corretor, ele terá direito à remuneração. Se mais de um corretor intermediar o negócio, a remuneração será dividida igualmente entre eles, a menos que haja um acordo em contrário. Os preceitos sobre corretagem no Código Civil não excluem a aplicação de outras normas da legislação especial.", "O contrato de transporte é aquele em que alguém se obriga a transportar pessoas ou coisas de um lugar para outro mediante retribuição. O transporte realizado com autorização, permissão ou concessão segue as normas regulamentares e o que for estabelecido nesses atos. Nos contratos de transporte cumulativo, cada transportador é responsável pelos danos causados durante o percurso, sendo a responsabilidade solidária em caso de substituição de transportadores. O dano resultante do atraso ou interrupção da viagem será determinado com base na totalidade do percurso.", "O documento trata do transporte de pessoas, estabelecendo que o transportador é responsável por danos causados aos passageiros e suas bagagens, salvo em caso de força maior. Também aborda a responsabilidade contratual do transportador em caso de acidente, a necessidade de seguir horários e itinerários previstos, as normas estabelecidas pelo transportador, o direito do passageiro de rescindir o contrato antes da viagem, a possibilidade de desistência durante a viagem com restituição do valor correspondente ao trecho não utilizado, a retenção de até cinco por cento do valor da passagem em caso de desistência, e a obrigação do transportador de concluir o transporte em outro veículo em caso de interrupção por motivo alheio à sua vontade. Além disso, o transportador tem direito de retenção sobre a bagagem do passageiro para garantir o pagamento da passagem.", "O documento trata das regras e responsabilidades relacionadas ao transporte de coisas. Ele aborda a caracterização da coisa a ser transportada, a emissão de conhecimento com os dados necessários para identificação, a recusa de coisas inadequadas, a responsabilidade do transportador, a entrega da mercadoria ao destinatário, a possibilidade de depósito em juízo em caso de impedimento no transporte, a entrega ao destinatário ou a quem apresentar o conhecimento endossado, e a responsabilidade solidária dos transportadores em caso de transporte cumulativo.", "O contrato de seguro é regido pelo segurador, que se compromete a garantir o interesse legítimo do segurado contra riscos predeterminados mediante o pagamento do prêmio. A apólice ou bilhete de seguro deve conter informações essenciais, como os riscos assumidos, o início e fim da validade, o limite da garantia e o prêmio devido. Ambas as partes devem agir com boa-fé e veracidade, e o segurado deve comunicar qualquer incidente que possa agravar o risco. A mora do segurador em pagar o sinistro implica em atualização monetária da indenização devida. O segurador que emite a apólice mesmo sabendo que o risco já passou deve pagar o dobro do prêmio estipulado. A recondução tácita do contrato só pode ocorrer uma vez, e os agentes autorizados do segurador são considerados seus representantes para todos os atos relacionados aos contratos que intermediarem.", "O documento trata do seguro de dano, estabelecendo que a garantia prometida não pode ultrapassar o valor do interesse segurado no momento da conclusão do contrato. Também aborda questões como o risco do seguro, a vigência da garantia, a transferência do contrato a terceiros, a sub-rogação do segurador nos direitos do segurado, o seguro de responsabilidade civil e os seguros legalmente obrigatórios. O documento estabelece regras e procedimentos a serem seguidos pelos segurados e seguradores em caso de sinistro.", "O documento trata das regras e regulamentações relacionadas ao seguro de pessoa. O proponente pode estipular livremente o capital segurado e contratar mais de um seguro sobre o mesmo interesse. É obrigatório declarar interesse na preservação da vida do segurado em seguros sobre a vida de outros. Há regras para substituição de beneficiários, pagamento do capital segurado em caso de falta de indicação de beneficiário, e validade da instituição do companheiro como beneficiário. O capital estipulado em seguros de vida não está sujeito às dívidas do segurado. Existem regras sobre prêmio, prazo de carência, exclusão de pagamento por suicídio, e situações em que o segurador não pode se eximir do pagamento do seguro. O segurador não pode sub-rogar-se nos direitos do segurado contra o causador do sinistro. O seguro de pessoas pode ser estipulado por pessoa natural ou jurídica em benefício de um grupo vinculado a ela, com responsabilidades específicas do estipulante. Não estão incluídas garantias de reembolso de despesas hospitalares, tratamento médico, despesas de luto e funeral do segurado.", "O contrato de constituição de renda permite que uma pessoa se obrigue a realizar uma prestação periódica, seja de forma gratuita ou onerosa, podendo ser garantida por bens móveis ou imóveis. O contrato pode ser feito por prazo certo ou por vida, desde que não ultrapasse a vida do credor. É necessário que o contrato seja feito por escritura pública e é nula a constituição de renda em favor de pessoa já falecida. Em caso de descumprimento da obrigação, o credor pode acionar o rendeiro para pagamento das prestações atrasadas ou para garantir as futuras, sob pena de rescisão do contrato. O credor adquire o direito à renda dia a dia, e em caso de renda constituída em benefício de várias pessoas, sem determinação da parte de cada uma, entende-se que os direitos são iguais. A renda constituída por título gratuito pode ficar isenta de execuções pendentes e futuras, prevalecendo a isenção em favor de montepios e pensões alimentícias.", "O documento trata das dívidas de jogo ou aposta, estabelecendo que não obrigam ao pagamento, exceto se houver dolo, se o perdente for menor ou interdito, ou se o contrato envolver reconhecimento, novação ou fiança de dívida de jogo. Também menciona que as regras se aplicam mesmo a jogos não proibidos, exceto os legalmente permitidos, e que prêmios em competições esportivas, intelectuais ou artísticas estão excluídos. Além disso, não se pode exigir reembolso de empréstimos feitos para jogos ou apostas no momento da aposta. Por fim, os contratos sobre títulos de bolsa, mercadorias ou valores têm regras específicas, assim como o sorteio para resolver questões ou dividir bens comuns.", "O contrato de fiança é uma garantia em que uma pessoa se compromete a cumprir uma obrigação assumida pelo devedor caso este não a cumpra. A fiança deve ser feita por escrito e não admite interpretação extensiva. Pode ser estipulada mesmo sem consentimento do devedor. As dívidas futuras podem ser objeto de fiança, mas o fiador só pode ser demandado depois que a obrigação do devedor principal estiver certa e líquida. A fiança pode ser de valor inferior ao da obrigação principal, mas não pode exceder esse valor. As obrigações nulas não podem ser objeto de fiança, exceto se a nulidade for apenas por incapacidade pessoal do devedor. O credor não é obrigado a aceitar um fiador que não seja idôneo, domiciliado no mesmo município e sem bens suficientes. Se o fiador se tornar insolvente ou incapaz, o credor pode exigir sua substituição.", "O documento trata dos efeitos da fiança, destacando que o fiador tem o direito de exigir que os bens do devedor sejam executados primeiro, até a contestação da lide. Também aborda a solidariedade entre fiadores, a possibilidade de fixar a parte da dívida pela qual cada fiador é responsável, a sub-rogação nos direitos do credor, a responsabilidade do devedor perante o fiador por perdas e danos, entre outros aspectos relacionados à fiança. Além disso, destaca a possibilidade de o fiador se exonerar da fiança após notificação ao credor e que a obrigação do fiador passa aos herdeiros, mas com limitações.", "O artigo 837 estabelece que o fiador pode opor ao credor exceções pessoais e extintivas da obrigação do devedor principal, exceto em casos de incapacidade pessoal. O artigo 838 lista as situações em que o fiador fica desobrigado, como a concessão de moratória sem seu consentimento, impossibilidade de sub-rogação nos direitos do credor e aceitação de objeto diverso em pagamento da dívida. O artigo 839 estabelece que, se o benefício da excussão for invocado e o devedor cair em insolvência, o fiador será exonerado se provar que os bens indicados por ele eram suficientes para pagar a dívida.", "O texto trata da transação, que é a possibilidade de prevenir ou encerrar um litígio por meio de concessões mútuas entre as partes. A transação só é permitida em relação a direitos patrimoniais de caráter privado e deve ser feita por escritura pública ou instrumento particular, dependendo da obrigação em questão. A transação interpreta-se restritivamente e não transmite direitos, apenas declara ou reconhece. Ela não beneficia nem prejudica terceiros que não participaram dela. Além disso, a transação não extingue a ação penal pública em caso de obrigações resultantes de delito. A transação pode ser anulada por dolo, coação ou erro essencial, mas não por erro de direito. Também é nula a transação em relação a litígio decidido por sentença passada em julgado, se os transatores não tinham ciência disso.", "O primeiro documento trata do compromisso como forma de resolver litígios entre pessoas que podem contratar, sendo vedado para questões de estado, direito pessoal de família e outras não patrimoniais. Também menciona a cláusula compromissória nos contratos para resolver divergências por juízo arbitral. Já o segundo documento fala sobre o contrato de administração fiduciária de garantias, onde um agente de garantia pode ser designado pelos credores para gerir e executar garantias, com dever fiduciário em relação aos credores e possibilidade de substituição por decisão dos credores. Além disso, o agente de garantia pode manter contratos com o devedor para auxiliar em procedimentos relacionados a operações de crédito e garantias reais, devendo agir com estrita boa-fé perante o devedor.", "O Título VII do Livro I trata dos Atos Unilaterais, especificamente do Capítulo I que aborda a Promessa de Recompensa. O artigo 854 estabelece que quem se comprometer publicamente a recompensar alguém que cumpra uma condição ou serviço, assume a obrigação de cumprir o prometido. O artigo 855 determina que aquele que realizar o serviço ou cumprir a condição, mesmo que não seja pelo interesse da promessa, tem direito a exigir a recompensa. O artigo 856 permite que o promitente revogue a promessa antes do serviço ser prestado, desde que faça isso publicamente, e o parágrafo único garante o reembolso das despesas ao candidato de boa-fé. Os artigos 857 e 858 estabelecem regras para casos em que mais de uma pessoa execute o ato prometido. O artigo 859 define condições essenciais para concursos com promessa de recompensa, como a fixação de prazo e a decisão do juiz nomeado nos anúncios. O artigo 860 determina que as obras premiadas em concursos pertencem ao promitente apenas se isso for estipulado na publicação da promessa.", "O texto trata da gestão de negócios, um ato unilateral em que alguém intervém na administração de um negócio alheio sem autorização. O gestor deve agir de acordo com o interesse presumível do dono do negócio e é responsável por eventuais prejuízos causados. Ele deve comunicar ao dono a gestão assumida e aguardar sua resposta, agindo com diligência e ressarcindo qualquer prejuízo causado por culpa na gestão. O gestor também pode ser responsabilizado por operações arriscadas ou que prejudiquem o interesse do dono. Em caso de utilidade na administração do negócio, o dono deve cumprir as obrigações contraídas em seu nome e reembolsar o gestor pelas despesas necessárias. A ratificação do dono retroage ao início da gestão e produz os efeitos do mandato. Em casos de desaprovação da gestão pelo dono, aplicam-se as disposições sobre restituição das coisas ao estado anterior ou indenização. Em situações em que os negócios alheios são conexos, o gestor pode ser considerado sócio daquele cujos interesses agencia, sendo responsável na medida das vantagens obtidas.", "O Título VII do Livro I trata dos Atos Unilaterais, e o Capítulo III aborda o Pagamento Indevido. O artigo 876 estabelece que quem recebeu o que não era devido deve restituir, mesmo que seja uma dívida condicional. O artigo 877 diz que quem pagou indevidamente deve provar que o fez por erro. O artigo 878 trata dos frutos, acessões, benfeitorias e deteriorações de uma coisa dada em pagamento indevido. O artigo 879 estabelece as responsabilidades de quem alienou um imóvel recebido indevidamente. O artigo 880 isenta de restituição quem recebeu o pagamento indevido como parte de uma dívida verdadeira. O artigo 881 trata da obrigação de indenizar quem cumpriu uma obrigação indevidamente paga. O artigo 882 estabelece que não se pode repetir o que foi pago para solver uma dívida prescrita. O artigo 883 diz que não se pode repetir o que foi dado para obter um fim ilícito, imoral ou proibido por lei.", "O texto trata do enriquecimento sem causa, estabelecendo que aquele que se enriquecer à custa de outrem sem justa causa deve restituir o valor indevidamente auferido, com atualização monetária. Se o enriquecimento tiver por objeto uma coisa determinada, esta deve ser restituída ou seu valor na época da exigência. A restituição é devida mesmo que a causa do enriquecimento deixe de existir. No entanto, não caberá restituição se a lei conferir outros meios para o lesado se ressarcir do prejuízo.", "O documento trata dos títulos de crédito, que são documentos necessários para o exercício de um direito autônomo neles contido, e que só produzem efeito quando preenchem os requisitos legais. São abordadas questões como a omissão de requisitos legais, a validade do título de crédito em relação ao negócio jurídico que o originou, os requisitos que o título deve conter, a transferência do título e a responsabilidade do avalista. Também são mencionadas questões como a garantia por aval, a responsabilidade do devedor ao pagar o título, a recusa de pagamento antes do vencimento e a regulação dos títulos de crédito pelo Código Civil.", "O texto trata dos títulos de crédito ao portador, estabelecendo que a transferência desses títulos é feita por simples tradição. O possuidor do título ao portador tem direito à prestação indicada no título, apenas apresentando-o ao devedor. O devedor só pode se opor ao portador do título com exceções fundamentadas em direito pessoal ou nulidade da obrigação. É nulo o título ao portador emitido sem autorização de lei especial. O possuidor de título dilacerado tem direito a obter a substituição do mesmo mediante a restituição do primeiro e pagamento das despesas. O proprietário que perder o título pode obter um novo em juízo e impedir que terceiros recebam pagamentos. O pagamento feito antes de ter ciência da ação mencionada exonera o devedor, a menos que se prove que ele tinha conhecimento do fato.", "O documento trata dos títulos de crédito, especificamente do endosso, que é a transferência do título para outra pessoa. O endosso deve ser feito no verso ou anverso do próprio título e pode ser em branco. O portador legítimo do título é aquele com uma série regular de endossos. O endossante não responde pelo pagamento, a menos que assuma responsabilidade expressamente. O devedor só pode opor exceções ao portador relacionadas à forma do título, conteúdo literal, falsidade de assinatura, capacidade ou representação no momento da subscrição. O endosso pode conter cláusulas de mandato ou penhor, conferindo ao endossatário certos direitos. A aquisição do título de outra forma que não seja o endosso é considerada uma cessão civil. O endosso posterior ao vencimento tem os mesmos efeitos do anterior.", "O Título VIII do Livro I trata dos Títulos de Crédito, especificamente do Título Nominativo. O título nominativo é emitido em favor de uma pessoa cujo nome conste no registro do emitente. Ele pode ser transferido mediante termo assinado pelo proprietário e pelo adquirente, ou por endosso que contenha o nome do endossatário. A transferência por endosso só tem eficácia perante o emitente após a competente averbação em seu registro. O endossatário legitimado por série regular de endossos tem direito de obter a averbação no registro do emitente. O título nominativo pode ser transformado em à ordem ou ao portador, a pedido do proprietário e à sua custa. O emitente fica desonerado de responsabilidade ao transferir o título de boa-fé pelos modos indicados. Qualquer negócio ou medida judicial relacionada ao título só produz efeito após a competente averbação no registro do emitente.", "O documento trata da responsabilidade civil por danos causados a terceiros por ato ilícito, estabelecendo que aquele que causar dano a outrem deve repará-lo. Também aborda a responsabilidade de incapazes, empresários, pais, tutores, empregadores, donos de estabelecimentos, entre outros, pelos danos causados por terceiros sob sua responsabilidade. Além disso, discute a responsabilidade por danos causados por animais, edifícios, construções e objetos lançados de lugares indevidos. O documento também trata de questões relacionadas a demandas por dívidas, prescrição, desistência de ação, transmissão da obrigação de reparação com a herança e responsabilidade solidária.", "O documento trata da responsabilidade civil e da indenização em casos de danos causados a terceiros. Define que a indenização deve ser proporcional à extensão do dano, podendo ser reduzida se houver desproporção entre a culpa e o dano. Também estabelece critérios para a fixação da indenização em casos de concorrência culposa da vítima, obrigações indeterminadas, homicídio, lesão à saúde, incapacidade de trabalho, entre outros. Além disso, aborda a indenização por usurpação, injúria, difamação, calúnia e ofensa à liberdade pessoal.", "O documento trata das preferências e privilégios creditórios em caso de insolvência do devedor. São listados os títulos legais de preferência, como privilégios e direitos reais, e as regras para a preferência entre credores. São detalhados os privilégios especiais, como credores de custas judiciais, despesas de salvamento, benfeitorias, entre outros. Também são mencionados os privilégios gerais, como despesas de funeral, custas judiciais, despesas com luto, impostos, salários de empregados domésticos, entre outros.", "O documento trata do Direito de Empresa, especificamente do Empresário. Define empresário como aquele que exerce profissionalmente atividade econômica organizada para a produção ou circulação de bens ou serviços. Estabelece a obrigatoriedade da inscrição do empresário no Registro Público de Empresas Mercantis antes do início de sua atividade, com requisitos específicos para o requerimento de inscrição. Também aborda a possibilidade de transformação do registro de empresário individual para registro de sociedade empresária, tratamento favorecido ao empresário rural e pequeno empresário, e equiparação do empresário rural ao empresário sujeito a registro.", "O documento aborda as regras relacionadas à capacidade do empresário, destacando que apenas aqueles que estiverem em pleno gozo da capacidade civil e não forem legalmente impedidos podem exercer a atividade de empresário. Também menciona que a pessoa legalmente impedida de exercer essa atividade será responsável pelas obrigações contraídas. Além disso, são apresentadas regras específicas para casos de incapazes que desejam continuar uma empresa, incluindo a necessidade de autorização judicial. O documento também aborda a possibilidade de cônjuges contratarem sociedade entre si ou com terceiros, bem como a alienação de imóveis pelo empresário casado. Por fim, menciona a empresa individual de responsabilidade limitada, que foi revogada pela Lei nº 14.382 de 2022.", "O Livro II, Título II, Capítulo Único do Direito de Empresa trata das disposições gerais sobre sociedades. O artigo 981 define que a sociedade é formada por pessoas que se comprometem a contribuir com bens ou serviços para uma atividade econômica e compartilhar os resultados. O artigo 982 diferencia sociedades empresárias, que exercem atividades sujeitas a registro, de sociedades simples. O artigo 983 estabelece que as sociedades empresárias devem se constituir de acordo com os tipos regulados pela lei, enquanto as sociedades simples podem seguir esses tipos ou se submeter a normas próprias. O artigo 984 trata da equiparação de sociedades que exercem atividades rurais e se constituem como empresárias. Por fim, o artigo 985 determina que a sociedade adquire personalidade jurídica com a inscrição de seus atos constitutivos no registro próprio.", "O Livro II trata do Direito de Empresa, com o Título II abordando a Sociedade. O Capítulo I fala sobre a Sociedade em Comum, onde os atos constitutivos devem ser inscritos para reger a sociedade, exceto por ações em organização. Os sócios devem provar a existência da sociedade por escrito, mas terceiros podem prová-la de qualquer modo. Os bens e dívidas sociais constituem um patrimônio especial, do qual os sócios são titulares em comum. Os bens sociais respondem pelos atos de gestão praticados por qualquer sócio, exceto se houver um pacto expresso limitativo de poderes. Todos os sócios respondem solidária e ilimitadamente pelas obrigações sociais, com exceção daquele que contratou pela sociedade.", "O documento trata da sociedade em conta de participação, onde a atividade é exercida apenas pelo sócio ostensivo, que responde perante terceiros, enquanto os demais sócios participam apenas dos resultados. A constituição da sociedade não requer formalidades específicas e o contrato produz efeitos apenas entre os sócios. A contribuição dos sócios constitui um patrimônio especial, com efeitos apenas entre os sócios. Em caso de falência de um dos sócios, a sociedade é dissolvida e a conta é liquidada. O sócio ostensivo não pode admitir novos sócios sem o consentimento dos demais. As normas da sociedade simples são aplicáveis subsidiariamente à sociedade em conta de participação.", "O contrato social de uma sociedade simples deve ser escrito e mencionar informações como nome, nacionalidade, estado civil, profissão e residência dos sócios, denominação, objeto, sede e prazo da sociedade, capital social, quota de cada sócio, prestações dos sócios, administração da sociedade, participação nos lucros e nas perdas, e responsabilidade dos sócios pelas obrigações sociais. Após a constituição da sociedade, o contrato social deve ser registrado no Registro Civil das Pessoas Jurídicas do local de sua sede. Modificações no contrato social devem ser aprovadas por todos os sócios ou por maioria absoluta de votos, dependendo do caso, e devem ser averbadas no registro. Se a sociedade simples instituir sucursal, filial ou agência em outra circunscrição, deve também inscrevê-la no respectivo registro, e a constituição dessas filiais deve ser averbada na sede da sociedade.", "O documento apresenta os direitos e obrigações dos sócios de uma sociedade simples. Os sócios são responsáveis desde o início do contrato até a liquidação da sociedade. Não podem ser substituídos sem o consentimento dos demais sócios. A cessão de quota sem modificação do contrato social não é eficaz sem o consentimento dos demais sócios. Os sócios devem contribuir conforme estabelecido no contrato, e quem não o fizer responderá por danos emergentes da mora. A distribuição de lucros ilícitos ou fictícios acarreta responsabilidade solidária dos administradores e dos sócios que os receberem.", "O documento trata das regras relacionadas à administração de uma sociedade simples, onde as deliberações são tomadas por maioria de votos dos sócios, com a necessidade de formação de maioria absoluta. O administrador deve agir com cuidado e diligência, não podendo ser condenado por crimes específicos. Os administradores respondem solidariamente por culpa no desempenho de suas funções e não podem aplicar créditos ou bens sociais em proveito próprio. Também são obrigados a prestar contas aos sócios e apresentar o inventário anualmente. Os poderes do sócio investido na administração são irrevogáveis, salvo justa causa reconhecida judicialmente. Os administradores não podem se fazer substituir no exercício de suas funções, mas podem constituir mandatários da sociedade.", "O documento trata das relações da sociedade simples com terceiros, destacando que a sociedade adquire direitos, assume obrigações e procede judicialmente por meio de administradores com poderes especiais. Os sócios respondem pelas dívidas da sociedade na proporção em que participem das perdas sociais, exceto se houver cláusula de responsabilidade solidária. Os bens particulares dos sócios não podem ser executados por dívidas da sociedade antes dos bens sociais. O sócio admitido em sociedade já constituída não se exime das dívidas sociais anteriores à admissão. O credor particular de sócio pode fazer recair a execução sobre a parte que lhe couber nos lucros da sociedade. Os herdeiros do cônjuge de sócio não podem exigir imediatamente a parte que lhes couber na quota social, devendo aguardar a liquidação da sociedade.", "O Artigo 1.028 trata da resolução da sociedade em relação a um sócio em caso de morte, onde a quota do sócio falecido será liquidada, salvo se houver disposição contratual em contrário, se os sócios optarem pela dissolução da sociedade ou se houver acordo com os herdeiros para substituição do sócio falecido. O Artigo 1.029 permite que qualquer sócio se retire da sociedade, com prazo de aviso de sessenta dias, ou por justa causa em caso de prazo determinado, podendo os demais sócios optar pela dissolução nos trinta dias seguintes. O Artigo 1.030 prevê a exclusão judicial de um sócio por falta grave no cumprimento de suas obrigações ou por incapacidade superveniente. O Artigo 1.031 estabelece que, em caso de resolução da sociedade em relação a um sócio, o valor da sua quota será liquidado com base na situação patrimonial da sociedade à data da resolução. O Artigo 1.032 determina que a retirada, exclusão ou morte de um sócio não o exime, ou a seus herdeiros, da responsabilidade pelas obrigações sociais anteriores por até dois anos após a averbação da resolução da sociedade.", "O documento trata da dissolução da sociedade simples, indicando as diversas formas pelas quais ela pode ocorrer, como o vencimento do prazo de duração, o consenso unânime dos sócios, a deliberação dos sócios por maioria absoluta, entre outros. Também aborda a possibilidade de dissolução judicial da sociedade, a investidura do liquidante após a dissolução, a liquidação judicial da sociedade em caso de extinção da autorização para funcionar, e a destituição do liquidante. Além disso, menciona que o contrato social pode prever outras causas de dissolução, a serem verificadas judicialmente quando contestadas.", "O documento trata das normas referentes à sociedade em nome coletivo, onde apenas pessoas físicas podem participar, sendo todos os sócios responsáveis solidária e ilimitadamente pelas obrigações sociais. No entanto, é possível limitar a responsabilidade de cada sócio por meio de convenção. O contrato deve mencionar a firma social e a administração da sociedade é exclusiva dos sócios. O credor particular de um sócio não pode exigir a liquidação da quota antes da dissolução da sociedade, exceto em casos específicos. A sociedade pode se dissolver por diversas causas, incluindo a declaração de falência se for empresária.", "O documento trata da sociedade em comandita simples, onde existem dois tipos de sócios: os comanditados, responsáveis ilimitadamente pelas obrigações sociais, e os comanditários, responsáveis apenas pelo valor de sua quota. O contrato deve discriminar os comanditados e os comanditários, e aplicam-se à sociedade em comandita simples as normas da sociedade em nome coletivo, quando compatíveis. O comanditário não pode praticar atos de gestão nem ter seu nome na firma social, mas pode ser constituído procurador da sociedade. A diminuição da quota do comanditário só produz efeito após a modificação do contrato ser averbada. O sócio comanditário não é obrigado a repor lucros recebidos de boa-fé, mas não pode receber lucros se o capital social foi diminuído por perdas. Em caso de morte do sócio comanditário, a sociedade continua com seus sucessores, que designarão um representante. A sociedade dissolve-se por diversas causas, incluindo a falta de uma das categorias de sócio por mais de cento e oitenta dias. Na falta de sócio comanditado, os comanditários podem nomear um administrador provisório para praticar atos de administração.", "O artigo 1.052 estabelece que na sociedade limitada, a responsabilidade de cada sócio é restrita ao valor de suas quotas, mas todos respondem solidariamente pela integralização do capital social. O parágrafo 1º destaca que a sociedade limitada pode ser constituída por uma ou mais pessoas, e o parágrafo 2º menciona que se for unipessoal, as disposições sobre o contrato social devem ser aplicadas ao documento de constituição do sócio único. O artigo 1.053 determina que a sociedade limitada é regida, nas omissões do Capítulo IV, pelas normas da sociedade simples, e o parágrafo único permite que o contrato social preveja a regência supletiva da sociedade limitada pelas normas da sociedade anônima. Por fim, o artigo 1.054 estabelece que o contrato social deve mencionar, quando aplicável, as indicações do artigo 997 e a firma social.", "O documento trata das regras relacionadas às quotas em uma sociedade limitada. O capital social é dividido em quotas, que podem ser iguais ou desiguais, e cada sócio pode ter uma ou várias quotas. Os sócios respondem solidariamente pela exata estimação dos bens conferidos ao capital social por até cinco anos após o registro da sociedade. É vedada a contribuição em prestação de serviços. As quotas são indivisíveis em relação à sociedade, exceto para efeito de transferência. No caso de condomínio de quota, os direitos só podem ser exercidos pelo condômino representante. Na omissão do contrato, o sócio pode ceder sua quota a outro sócio ou a estranho, desde que não haja oposição de titulares de mais de um quarto do capital social. A cessão só tem eficácia após a averbação do instrumento. Em caso de não integralização da quota por um sócio remisso, os outros sócios podem tomar a quota para si ou transferi-la a terceiros, excluindo o titular original. Os sócios são obrigados a repor os lucros e quantias retiradas, mesmo que autorizadas pelo contrato, se isso for feito com prejuízo do capital.", "O documento trata da administração da sociedade limitada, onde é mencionado que a sociedade pode ser administrada por uma ou mais pessoas designadas no contrato social ou em ato separado. A designação de administradores não sócios depende da aprovação da maioria dos sócios. O administrador designado deve investir-se no cargo mediante termo de posse no livro de atas da administração. O exercício do cargo de administrador cessa pela destituição ou pelo término do prazo estabelecido. A renúncia do administrador torna-se eficaz após a comunicação escrita e averbação. O uso da firma ou denominação social é privativo dos administradores com os necessários poderes. Ao final de cada exercício social, é necessário elaborar o inventário, balanço patrimonial e balanço de resultado econômico.", "O artigo 1.066 do Livro II, Título II, Capítulo IV, Seção IV do Direito de Empresa trata do Conselho Fiscal em uma Sociedade Limitada. O contrato pode instituir um conselho fiscal composto por três ou mais membros, eleitos na assembleia anual. O artigo também estabelece quem não pode fazer parte do conselho fiscal e garante aos sócios minoritários o direito de eleger um dos membros. Os membros do conselho fiscal devem assinar um termo de posse e sua remuneração é fixada pela assembleia dos sócios. Suas atribuições incluem examinar os livros da sociedade, apresentar pareceres, denunciar erros e fraudes, convocar assembleias e atuar durante a liquidação da sociedade. O conselho fiscal não pode transferir suas atribuições para outro órgão da sociedade e seus membros têm responsabilidade semelhante à dos administradores. Eles podem escolher um contador para auxiliá-los, com remuneração aprovada pela assembleia dos sócios.", "O documento trata das deliberações dos sócios em uma sociedade limitada, indicando as matérias que dependem da deliberação dos sócios, como aprovação das contas da administração, destituição dos administradores, modificação do contrato social, entre outros. Também aborda a convocação de reuniões ou assembleias, a instalação da assembleia, a representação dos sócios, a lavratura da ata, a realização anual da assembleia, o direito de retirada do sócio em caso de modificação do contrato, e a responsabilidade dos sócios em caso de deliberações infringentes do contrato ou da lei. Além disso, o documento inclui a possibilidade de participação e voto a distância em reuniões ou assembleias, conforme regulamentação do órgão competente do Poder Executivo federal.", "O documento trata do aumento e da redução do capital de uma sociedade limitada. O artigo 1.081 estabelece que, após a integralização das quotas, o capital pode ser aumentado com a correspondente modificação do contrato, dando preferência aos sócios para participar do aumento. O artigo 1.082 permite a redução do capital em casos de perdas irreparáveis ou se o capital for excessivo em relação ao objeto da sociedade. O artigo 1.083 estabelece que a redução do capital por perdas irreparáveis será realizada com a diminuição proporcional do valor nominal das quotas, a partir da averbação da ata da assembleia que aprovou a redução. Já o artigo 1.084 estabelece que a redução do capital por ser excessivo será feita restituindo parte do valor das quotas aos sócios ou dispensando prestações ainda devidas, com diminuição proporcional do valor nominal das quotas. O documento também estabelece prazos e procedimentos para a efetivação da redução do capital, incluindo a possibilidade de oposição por parte de credores quirografários.", "O Artigo 1.085 trata da possibilidade de exclusão de sócios minoritários que estejam colocando em risco a continuidade da empresa, desde que prevista no contrato social e com a maioria dos sócios representativa de mais da metade do capital social. Já o Parágrafo único estabelece que a exclusão de um sócio só pode ser determinada em reunião ou assembleia especialmente convocada para esse fim, garantindo o direito de defesa do acusado. O Artigo 1.086 determina que, após o registro da alteração contratual, serão aplicados os dispositivos dos artigos 1.031 e 1.032.", "O artigo 1.087 do Livro II, Título II, Capítulo IV, Seção VIII do Direito de Empresa trata da dissolução da sociedade limitada, que ocorre de pleno direito por qualquer das causas previstas no artigo 1.044.", "O artigo 1.088 estabelece que na sociedade anônima o capital é dividido em ações, e cada sócio ou acionista é responsável apenas pelo preço de emissão das ações que subscrever ou adquirir. Já o artigo 1.089 determina que a sociedade anônima é regida por uma lei especial, sendo aplicadas as disposições do Código Civil nos casos omissos.", "O documento trata da sociedade em comandita por ações, que tem seu capital dividido em ações e se rege pelas normas da sociedade anônima. Apenas acionistas podem administrar a sociedade e são responsáveis subsidiária e ilimitadamente pelas obrigações. Os diretores são nomeados no ato constitutivo da sociedade e só podem ser destituídos por deliberação de acionistas que representem no mínimo dois terços do capital social. A assembléia geral não pode realizar certas mudanças sem o consentimento dos diretores, como alterar o objeto essencial da sociedade, prorrogar o prazo de duração, aumentar ou diminuir o capital social, criar debêntures ou partes beneficiárias.", "O Capítulo VII do Livro II do Direito de Empresa trata da Sociedade Cooperativa, que se rege pelas características estabelecidas no art. 1.094, como a variabilidade do capital social, o concurso de sócios na administração, a limitação do valor das quotas, a intransferibilidade das quotas, o quorum para deliberações, o direito de voto de cada sócio, a distribuição dos resultados, a indivisibilidade do fundo de reserva, e a responsabilidade limitada ou ilimitada dos sócios. Na ausência de disposições específicas, aplicam-se as regras da sociedade simples, respeitando as características da sociedade cooperativa.", "O Capítulo VIII do Livro II do Direito de Empresa trata das Sociedades Coligadas. O artigo 1.097 define as sociedades coligadas como aquelas que possuem relações de capital de controle, filiação ou simples participação. O artigo 1.098 define o que é considerado uma sociedade controlada. O artigo 1.099 define as sociedades coligadas ou filiadas, enquanto o artigo 1.100 define as sociedades de simples participação. O artigo 1.101 estabelece limites para a participação de uma sociedade em outra, e o parágrafo único determina que, caso esse limite seja excedido, as ações ou quotas em excesso devem ser alienadas nos cento e oitenta dias seguintes à aprovação do balanço.", "O documento trata da liquidação da sociedade após sua dissolução, descrevendo os deveres do liquidante, como arrecadar os bens da sociedade, elaborar o inventário e balanço, realizar os negócios da sociedade, convocar assembleias, confessar falência se necessário, apresentar relatórios e contas finais, entre outros. O liquidante deve representar a sociedade e praticar os atos necessários à liquidação, respeitando os direitos dos credores preferenciais. Após o pagamento do passivo e partilha do remanescente, a sociedade se extingue. Em caso de liquidação judicial, serão observadas as leis processuais. O credor insatisfeito pode exigir dos sócios o pagamento do crédito recebido na partilha e propor ação de perdas e danos contra o liquidante.", "O documento trata das regras e procedimentos relacionados à transformação, incorporação, fusão e cisão de sociedades. A transformação não requer dissolução da sociedade e deve respeitar os preceitos do novo tipo societário. A incorporação envolve a absorção de uma ou mais sociedades por outra, que assume todos os direitos e obrigações. A fusão resulta na extinção das sociedades originais para formar uma nova sociedade. Os procedimentos e aprovações necessárias para cada uma dessas operações são detalhados, assim como os direitos dos credores e a possibilidade de anulação dos atos em até noventa dias.", "O documento trata das regras aplicáveis às sociedades que dependem de autorização do Poder Executivo para funcionar. Estabelece que essas sociedades devem reger-se pelo Livro II do Direito de Empresa, sem prejuízo do disposto em lei especial. Determina que a competência para a autorização é do Poder Executivo federal e que, na falta de prazo estipulado, a autorização será considerada caduca se a sociedade não entrar em funcionamento dentro de doze meses. Além disso, o Poder Executivo tem o poder de cassar a autorização concedida a sociedades que infrinjam disposições de ordem pública ou pratiquem atos contrários aos fins declarados em seu estatuto.", "O documento trata das regras para a constituição e funcionamento de sociedades nacionais no Brasil. Estabelece que a sede da administração da sociedade deve estar no país e que, em caso de exigência de nacionalidade brasileira para os sócios, as ações da sociedade anônima devem ser nominativas. Também prevê que não pode haver mudança de nacionalidade sem consentimento unânime dos sócios, e que o Poder Executivo pode exigir alterações no contrato ou estatuto da sociedade. Além disso, determina que as sociedades anônimas nacionais que dependem de autorização do Poder Executivo não podem se constituir sem obtê-la, e que modificações no contrato ou estatuto devem ser aprovadas.", "O artigo 1.134 do Livro II, Título II, Capítulo XI do Código Civil trata da autorização necessária para que uma sociedade estrangeira funcione no Brasil. Para obter essa autorização, a sociedade deve apresentar diversos documentos, como prova de constituição conforme a lei do país de origem, contrato ou estatuto, relação dos membros da administração, entre outros. Além disso, a sociedade autorizada deve ter um representante no Brasil, estar sujeita às leis brasileiras e ter suas publicações obrigatórias reproduzidas nos órgãos oficiais. A sociedade estrangeira também pode nacionalizar-se, transferindo sua sede para o Brasil, mediante autorização do Poder Executivo e cumprindo as condições estabelecidas.", "O documento trata das disposições gerais relacionadas ao estabelecimento empresarial. Define o estabelecimento como um complexo de bens organizado para o exercício da empresa, podendo ser físico ou virtual. Discute a possibilidade de o estabelecimento ser objeto de direitos e negócios jurídicos, como alienação, usufruto ou arrendamento. Estabelece que contratos relacionados ao estabelecimento só terão efeitos após averbação e publicação. Determina que o adquirente do estabelecimento responde pelos débitos anteriores à transferência e que o alienante não pode concorrer com o adquirente por cinco anos. Aborda a sub-rogação nos contratos de exploração do estabelecimento e a cessão dos créditos relacionados ao mesmo.", "O registro de empresas mercantis e sociedades simples é obrigatório e deve ser feito nas Juntas Comerciais ou no Registro Civil das Pessoas Jurídicas, conforme o caso. O registro deve ser solicitado pela pessoa responsável dentro do prazo de trinta dias, e a falta de registro dentro do prazo pode resultar em perdas e danos. O órgão responsável pelo registro deve verificar a regularidade das publicações exigidas por lei, e antes de efetivar o registro, deve verificar a autenticidade dos documentos apresentados. O ato sujeito a registro não pode ser oposto a terceiros antes do cumprimento das formalidades, e o terceiro não pode alegar ignorância se as formalidades forem cumpridas.", "O documento trata do nome empresarial, que pode ser uma firma ou denominação adotada para o exercício de uma empresa. Ele detalha como o nome empresarial deve ser constituído para diferentes tipos de empresas, como sociedades simples, limitadas, cooperativas, anônimas e em comandita por ações. Além disso, estabelece regras sobre a exclusividade do nome, a possibilidade de uso do nome do empresário anterior em caso de aquisição de estabelecimento, a proibição de alienação do nome empresarial, a exclusão do nome de sócio falecido da firma social, a garantia de uso exclusivo do nome com a inscrição no registro próprio, a possibilidade de anulação da inscrição do nome empresarial em caso de violação da lei ou contrato, e o cancelamento da inscrição em caso de cessação da atividade ou liquidação da sociedade.", "Os artigos 1.169, 1.170 e 1.171 do Livro II, Título IV, Capítulo III, Seção I do Direito de Empresa tratam das disposições gerais sobre os prepostos. O preposto não pode se fazer substituir sem autorização escrita, não pode negociar por conta própria ou de terceiros sem autorização expressa e a entrega de papéis, bens ou valores ao preposto é considerada perfeita se ele os recebeu sem protesto, salvo nos casos em que haja prazo para reclamação. O descumprimento dessas regras pode acarretar em responsabilidade pessoal do preposto e em retenção dos lucros da operação pelo preponente.", "O artigo 1.172 define o gerente como um preposto permanente que exerce a empresa na sede ou em filiais. O artigo 1.173 estabelece que, na ausência de exigência de poderes especiais pela lei, o gerente tem autorização para praticar todos os atos necessários ao exercício dos poderes que lhe foram concedidos. O artigo 1.174 determina que as limitações nos poderes do gerente devem ser arquivadas e averbadas no Registro Público de Empresas Mercantis para serem válidas perante terceiros. O artigo 1.175 estabelece que o preponente é responsável pelos atos do gerente praticados em seu nome. O artigo 1.176 permite que o gerente represente o preponente em juízo pelas obrigações resultantes de sua função.", "O artigo 1.177 estabelece que os assentos feitos nos livros ou fichas do preponente por prepostos responsáveis pela escrituração produzem os mesmos efeitos como se fossem feitos pelo próprio preponente, desde que não tenham agido de má-fé. Já o artigo 1.178 determina que os preponentes são responsáveis pelos atos dos prepostos praticados em seus estabelecimentos e relacionados à atividade da empresa, mesmo que não tenham sido autorizados por escrito. No entanto, se os atos forem praticados fora do estabelecimento, só obrigam o preponente nos limites dos poderes conferidos por escrito.", "O documento trata da obrigatoriedade da escrituração contábil para empresários e sociedades empresárias, incluindo a necessidade de seguir um sistema de contabilidade, levantar anualmente o balanço patrimonial e de resultado econômico, autenticar os livros no Registro Público de Empresas Mercantis, entre outras exigências. Também aborda a forma como a escrituração deve ser feita, os critérios de avaliação para o inventário, a elaboração do balanço patrimonial e de resultado econômico, a conservação dos documentos e a possibilidade de fiscalização por autoridades fazendárias. Além disso, menciona a aplicação das regras para sucursais, filiais ou agências de empresas estrangeiras no Brasil.", "O Livro III, Título I, Capítulo I trata da posse e sua classificação. Define-se possuidor como aquele que exerce algum dos poderes inerentes à propriedade. A posse direta não anula a indireta, e o detentor é aquele que conserva a posse em nome de outro. A posse é considerada justa se não for violenta, clandestina ou precária, e é de boa-fé se o possuidor ignorar qualquer vício ou obstáculo na aquisição da coisa. A posse de boa-fé só perde esse caráter se o possuidor souber que está possuindo indevidamente. A posse mantém o mesmo caráter com que foi adquirida, salvo prova em contrário.", "O documento trata da aquisição da posse, que ocorre no momento em que se torna possível exercer os poderes inerentes à propriedade em nome próprio. A posse pode ser adquirida pela própria pessoa interessada, por seu representante ou por terceiros sem mandato, dependendo de ratificação. A posse é transmitida aos herdeiros ou legatários do possuidor com os mesmos caracteres. O sucessor universal continua com a posse do antecessor, e o sucessor singular pode unir sua posse à do antecessor. Não são considerados atos de posse a mera permissão ou tolerância, nem atos violentos ou clandestinos, a menos que a violência ou clandestinidade cessem. A posse de um imóvel presume a posse das coisas móveis nele presentes, até prova em contrário.", "O artigo 1.210 do Livro III do Direito das Coisas trata dos direitos do possuidor em caso de turbação, esbulho ou violência iminente. Os artigos seguintes abordam questões como a manutenção da posse, a ação de esbulho, a responsabilidade pelos frutos colhidos, a perda ou deterioração da coisa, as benfeitorias necessárias e úteis, entre outros. Os artigos também fazem distinção entre possuidor de boa-fé e possuidor de má-fé, estabelecendo diferentes direitos e responsabilidades para cada um.", "Os artigos 1.223 e 1.224 do Livro III, Título I, Capítulo IV do Código Civil tratam da perda da posse. O artigo 1.223 estabelece que a posse é perdida quando cessa o poder sobre o bem, mesmo que contra a vontade do possuidor. Já o artigo 1.224 determina que a posse só é considerada perdida para quem não presenciou o esbulho se, tendo conhecimento dele, não tentar recuperar a coisa ou se for violentamente impedido de fazê-lo.", "O documento apresenta os direitos reais sobre imóveis e coisas móveis, listando os diferentes tipos de direitos reais, como propriedade, superfície, servidões, usufruto, entre outros. Também destaca que os direitos reais sobre coisas móveis são adquiridos com a tradição, enquanto os direitos reais sobre imóveis são adquiridos com o registro no Cartório de Registro de Imóveis, exceto em casos expressos no Código Civil. Além disso, são mencionados novos direitos reais incluídos por leis posteriores, como a concessão de uso especial para fins de moradia e a laje.", "O documento trata do direito de propriedade, destacando que o proprietário tem o direito de usar, gozar e dispor da coisa, além do direito de reavê-la de quem a possua injustamente. Também ressalta que o exercício do direito de propriedade deve respeitar finalidades econômicas e sociais, preservando o meio ambiente e evitando a poluição. Além disso, aborda a possibilidade de privação da propriedade em casos de desapropriação, requisição e posse ininterrupta por terceiros. O documento também menciona que a propriedade do solo não abrange recursos minerais, monumentos arqueológicos e outros bens específicos, e que os frutos e produtos da coisa pertencem ao proprietário, salvo disposição em contrário.", "O documento trata da propriedade em geral, especificamente da descoberta de coisas alheias perdidas. De acordo com o artigo 1.233, quem encontrar uma coisa perdida deve restituí-la ao dono ou legítimo possuidor, e se não o conhecer, deve entregá-la à autoridade competente. O descobridor tem direito a uma recompensa não inferior a cinco por cento do valor da coisa, além de ser indenizado pelas despesas de conservação e transporte, caso o dono não prefira abandoná-la. O descobridor responde por prejuízos causados ao proprietário se agir com dolo. Após a divulgação da descoberta, se ninguém reclamar a propriedade da coisa em sessenta dias, ela será vendida em hasta pública e o remanescente pertencerá ao Município onde a coisa foi encontrada. Em casos de coisas de diminuto valor, o Município pode abandoná-la em favor do descobridor.", "Os artigos apresentados tratam da usucapião, que é a forma de aquisição da propriedade de um imóvel por meio da posse prolongada e ininterrupta. O prazo para adquirir a propriedade varia de acordo com o tipo de imóvel e as condições estabelecidas em cada artigo. Além disso, são apresentadas as condições necessárias para que a usucapião seja reconhecida, como a posse contínua, pacífica, com justo título e de boa-fé. Também é mencionado que a declaração obtida por meio da usucapião serve como título para registro no Cartório de Registro de Imóveis.", "O registro do título translativo no Registro de Imóveis transfere a propriedade entre vivos. Enquanto o título não for registrado, o alienante continua sendo considerado o dono do imóvel. O registro é eficaz a partir do momento em que o título é apresentado ao oficial do registro e prenotado no protocolo. Se o registro não refletir a verdade, o interessado pode solicitar a retificação ou anulação. Após o cancelamento do registro, o proprietário pode reivindicar o imóvel, independentemente da boa-fé ou do título do terceiro adquirente.", "O documento trata da aquisição da propriedade imóvel por acessão, que pode ocorrer por formação de ilhas, aluvião, avulsão, abandono de álveo, plantações ou construções. As regras para cada tipo de acessão são detalhadas, como a divisão de ilhas entre proprietários ribeirinhos, a propriedade de acréscimos formados por aluvião, a aquisição de terras destacadas por avulsão, a propriedade do álveo abandonado e as regras para construções e plantações em terrenos próprios ou alheios, incluindo casos de boa-fé e má-fé. Também são abordadas as situações em que o construtor pode adquirir a propriedade do solo invadido, mediante pagamento de indenização.", "O documento trata da aquisição da propriedade móvel por meio da usucapião. Segundo o artigo 1.260, aquele que possuir uma coisa móvel como sua de forma contínua e incontestada durante três anos, com justo título e boa-fé, adquirirá a propriedade. Já o artigo 1.261 estabelece que se a posse da coisa móvel se prolongar por cinco anos, ocorrerá a usucapião, independentemente de título ou boa-fé. O artigo 1.262 determina que as regras dos artigos 1.243 e 1.244 também se aplicam à usucapião de coisas móveis.", "O artigo 1.263 do Livro III, Título III, Capítulo III, Seção II do Código Civil estabelece que quem se apossar de uma coisa sem dono adquire a propriedade dela, desde que essa ocupação não seja proibida por lei.", "O documento trata da aquisição da propriedade móvel através do achado do tesouro. Segundo o artigo 1.264, se um tesouro antigo e valioso for encontrado em um terreno e o dono não for conhecido, ele será dividido igualmente entre o proprietário do terreno e quem encontrou o tesouro. Já o artigo 1.265 estabelece que se o tesouro for encontrado pelo proprietário do terreno ou por alguém autorizado por ele, o tesouro pertencerá inteiramente ao proprietário. Por fim, o artigo 1.266 determina que se o tesouro for encontrado em um terreno aforado, ele será dividido igualmente entre o descobridor e o enfiteuta, ou pertencerá inteiramente ao enfiteuta se ele mesmo for o descobridor.", "O texto trata da transferência da propriedade móvel através da tradição, que ocorre quando o transmitente entrega a coisa ao adquirente. A propriedade não se transfere antes da tradição, exceto em casos específicos como quando o transmitente continua a possuir a coisa pelo constituto possessório. Se a tradição for feita por alguém que não é proprietário, a propriedade não é transferida, a menos que o adquirente de boa-fé acredite que o alienante é o dono da coisa. A transferência da propriedade é considerada realizada desde o momento da tradição se o adquirente estiver de boa-fé e o alienante adquirir a propriedade posteriormente. A tradição também não transfere a propriedade se tiver por título um negócio jurídico nulo.", "Os artigos apresentados tratam da especificação, que é a transformação de matéria-prima em uma nova espécie. O artigo 1.269 estabelece que aquele que trabalha em matéria-prima alheia e obtém uma nova espécie será o proprietário, desde que não seja possível retornar à forma anterior. O artigo 1.270 determina que se toda a matéria for alheia e não for possível retornar à forma anterior, a nova espécie pertencerá ao especificador de boa-fé. No entanto, se a nova espécie foi obtida de má-fé, pertencerá ao dono da matéria-prima. O artigo 1.271 estabelece que os prejudicados nas situações dos artigos anteriores serão ressarcidos pelo dano sofrido, exceto no caso do especificador de má-fé quando a especificação for irredutível.", "O artigo 1.272 do Livro III, Título III, Capítulo III do Direito das Coisas trata da confusão, comissão e adjunção de coisas pertencentes a diversos donos, estabelecendo que, se for possível separá-las sem deterioração, elas continuam a pertencer aos respectivos donos. Caso não seja possível separá-las ou haja dispêndio excessivo, o todo permanece indiviso, com cada dono recebendo uma parte proporcional ao valor da coisa que contribuiu. Se uma das coisas puder ser considerada principal, o dono dela será considerado dono do todo, indenizando os outros. O artigo 1.273 estabelece que, se a confusão, comissão ou adjunção foi feita de má-fé, a outra parte pode escolher entre adquirir a propriedade do todo, pagando o que não é seu, ou renunciar ao que lhe pertence, sendo indenizada. O artigo 1.274 trata da formação de uma espécie nova a partir da união de matérias de natureza diversa, aplicando as mesmas normas dos artigos anteriores.", "O documento trata da perda da propriedade, que pode ocorrer por diversas causas, como alienação, renúncia, abandono, perecimento da coisa e desapropriação. No caso de imóveis urbanos ou rurais abandonados pelo proprietário, sem posse de terceiros e sem pagamento de ônus fiscais, após três anos o bem pode ser arrecadado como bem vago e passar à propriedade do Município, Distrito Federal ou União, conforme a localização do imóvel. Os efeitos da perda da propriedade imóvel estão subordinados ao registro do título transmissivo ou do ato renunciativo no Registro de Imóveis.", "O documento trata dos direitos de vizinhança relacionados ao uso anormal da propriedade. O proprietário ou possuidor de um prédio tem o direito de fazer cessar interferências prejudiciais à segurança, sossego e saúde dos que habitam o local causadas pela propriedade vizinha. Proíbem-se as interferências levando em consideração a natureza da utilização, localização do prédio e limites de tolerância dos moradores da vizinhança. Caso as interferências sejam justificadas por interesse público, o causador deve pagar indenização ao vizinho. Mesmo que decisão judicial tolere as interferências, o vizinho pode exigir sua redução ou eliminação. O proprietário ou possuidor pode exigir a demolição ou reparação do prédio vizinho em caso de ameaça de ruína, assim como garantias contra prejuízos em caso de obras realizadas por terceiros.", "O Livro III, Título III, Capítulo V do Código Civil trata dos Direitos de Vizinhança, mais especificamente das Árvores Limítrofes. O artigo 1.282 estabelece que a árvore cujo tronco está na linha divisória pertence em comum aos donos dos prédios confinantes. Já o artigo 1.283 permite que o proprietário do terreno invadido corte as raízes e os ramos da árvore que ultrapassarem a divisa. Por fim, o artigo 1.284 determina que os frutos caídos de uma árvore do terreno vizinho pertencem ao dono do solo onde caíram, desde que seja de propriedade particular.", "O artigo 1.285 do Livro III, Título III, Capítulo V, Seção III do Código Civil trata da passagem forçada, que permite ao dono de um prédio sem acesso a via pública, nascente ou porto, constranger o vizinho a lhe dar passagem mediante pagamento de indenização. O rumo da passagem será judicialmente fixado, se necessário. O constrangimento recairá sobre o vizinho cujo imóvel mais naturalmente se prestar à passagem. Em caso de alienação parcial do prédio, o proprietário da parte que perdeu o acesso deve tolerar a passagem. Mesmo que existisse uma passagem antes da alienação, o proprietário do imóvel vizinho não pode ser constrangido a dar outra passagem.", "O proprietário é obrigado a permitir a passagem de cabos, tubulações e outros condutos subterrâneos de serviços de utilidade pública através de seu imóvel, mediante o recebimento de uma indenização que compense a desvalorização da área remanescente. O proprietário prejudicado pode exigir que a instalação seja feita de forma menos prejudicial ao seu imóvel e que, posteriormente, seja removida para outro local do imóvel, às custas do proprietário beneficiado. Se as instalações representarem um grave risco, o proprietário do imóvel afetado pode exigir a realização de obras de segurança.", "O documento trata dos direitos de vizinhança relacionados às águas, estabelecendo regras para o fluxo natural das águas entre propriedades superiores e inferiores, bem como para o desvio de águas artificiais. Também aborda a construção de barragens, açudes e aquedutos, estabelecendo regras para indenização de danos causados a propriedades vizinhas. Além disso, prevê a possibilidade de construção de canais através de propriedades alheias, desde que haja indenização aos proprietários prejudicados. O documento também estabelece regras para a construção e uso de aquedutos, bem como para o uso de águas supérfluas.", "O proprietário tem o direito de cercar, murar, valar ou tapar seu prédio, urbano ou rural, e pode obrigar o confinante a demarcar os limites entre os dois prédios, dividindo as despesas proporcionalmente. Os intervalos, muros, cercas e tapumes divisórios são presumidos pertencer a ambos os proprietários, que devem contribuir igualmente para sua construção e manutenção. As sebes vivas, árvores ou plantas que servem como marco divisório só podem ser removidas com acordo mútuo. A construção de tapumes especiais para impedir a passagem de animais pode ser exigida do responsável, sem a obrigação do proprietário contribuir para as despesas. Em caso de limites confusos, eles serão determinados com base na posse justa, e se não for possível a divisão conveniente, o terreno contestado será dividido igualmente ou adjudicado a um dos prédios com indenização ao outro.", "O documento trata dos direitos de vizinhança relacionados ao direito de construir. Estabelece regras para a construção de edificações em terrenos vizinhos, como a proibição de despejar águas diretamente sobre o prédio vizinho, a distância mínima para abertura de janelas e varandas, e a possibilidade de exigir a remoção de construções que invadam o terreno vizinho. Também aborda questões como a divisão de despesas para construção de paredes divisórias, a proibição de obras que prejudiquem a água do poço ou nascente do vizinho, e a responsabilidade por danos causados durante obras. Além disso, estabelece o direito de um vizinho entrar no imóvel do outro para realizar reparos ou recuperar objetos, com aviso prévio e possibilidade de ressarcimento em caso de danos.", "O documento trata dos direitos e deveres dos condôminos em um condomínio geral voluntário. Cada condômino pode usar a coisa conforme sua destinação, exercer seus direitos sobre ela, reivindicá-la de terceiros, defender sua posse e alienar sua parte ideal, desde que haja consenso dos demais condôminos. Eles devem contribuir para as despesas de conservação ou divisão da coisa, e cada um responde pelos frutos que percebeu e pelo dano causado. É possível exigir a divisão da coisa comum a qualquer momento, e se a coisa for indivisível, pode ser vendida e o valor repartido entre os condôminos. A administração da coisa comum é decidida pela maioria, calculada pelo valor dos quinhões, e as deliberações devem ser tomadas por maioria absoluta. Em caso de impossibilidade de alcançar maioria absoluta, o juiz decide, ouvindo os condôminos. Os frutos da coisa comum são partilhados na proporção dos quinhões, a menos que haja estipulação em contrário.", "O condomínio por meação de paredes, cercas, muros e valas é regulado pelo Código Civil, onde o proprietário tem direito a estremar um imóvel com essas estruturas e adquirir meação na parede, muro, valado ou cerca do vizinho. Caso não haja acordo sobre o preço da obra, este será arbitrado por peritos, e enquanto o pagamento não for feito, nenhum dos proprietários poderá utilizar a estrutura divisória.", "O documento trata das disposições gerais sobre condomínio edilício, onde partes de edificações podem ser propriedade exclusiva ou comum dos condôminos. As partes suscetíveis de utilização independente são de propriedade exclusiva, enquanto o solo, estrutura do prédio, entre outras partes comuns, são utilizadas em comum. O condomínio edilício é instituído por ato registrado no Cartório de Registro de Imóveis, com discriminação das unidades, fração ideal e destinação. A convenção do condomínio deve ser subscrita por dois terços dos condôminos e registrada para ser oponível a terceiros. São estabelecidos direitos e deveres dos condôminos, como contribuir para as despesas do condomínio, não realizar obras que comprometam a segurança, entre outros. Também são abordadas questões como realização de obras, seguro da edificação e responsabilidade por débitos do antigo proprietário.", "O documento trata das regras e responsabilidades relacionadas à administração do condomínio edilício. O síndico é escolhido pela assembleia dos condôminos e tem diversas atribuições, como convocar reuniões, representar o condomínio, elaborar orçamentos, cobrar contribuições, entre outras. A destituição do síndico pode ocorrer em casos de irregularidades. As assembleias devem ser convocadas anualmente para aprovar orçamentos, contas e eleger substitutos, com possibilidade de realização de forma eletrônica. Também é mencionada a possibilidade de existir um conselho fiscal para dar parecer sobre as contas do síndico.", "O documento trata sobre a multipropriedade em condomínios edilícios, estabelecendo direitos e obrigações dos multiproprietários, regras de administração, transferência da multipropriedade, entre outros aspectos. Define que a multipropriedade é o regime de condomínio em que cada proprietário de um mesmo imóvel é titular de uma fração de tempo para uso exclusivo do imóvel. Estabelece que a administração do imóvel será de responsabilidade de um administrador profissional e que a convenção do condomínio edilício deve prever diversas matérias, como a identificação das unidades sujeitas ao regime da multipropriedade, a forma de rateio das contribuições condominiais, entre outros. Também aborda a transferência da multipropriedade, os direitos e obrigações dos multiproprietários, a renúncia do direito de multipropriedade, e a possibilidade de limitar ou impedir a instituição da multipropriedade nos imóveis.", "O Artigo 1.359 estabelece que, quando a propriedade é resolvida por condição ou termo, os direitos reais concedidos também são resolvidos e o proprietário pode reivindicar a coisa de quem a possua. Já o Artigo 1.360 determina que, se a propriedade for resolvida por outra causa, o possuidor anterior à resolução será considerado proprietário, cabendo à pessoa em cujo benefício ocorreu a resolução ação para reaver a coisa ou seu valor.", "O Capítulo IX do Título III do Livro III trata da propriedade fiduciária, que é a transferência de propriedade resolúvel de uma coisa móvel infungível do devedor para o credor como garantia. O contrato que serve de título para a propriedade fiduciária deve conter informações como o total da dívida, prazo de pagamento, taxa de juros e descrição da coisa transferida. O devedor pode usar a coisa até o vencimento da dívida, sendo obrigado a entregá-la ao credor se a dívida não for paga. Após o vencimento, o credor pode vender a coisa para pagar a dívida, sendo nula a cláusula que permite ao proprietário ficar com a coisa. O terceiro que pagar a dívida se sub-roga no crédito e na propriedade fiduciária. Existem outras espécies de propriedade fiduciária sujeitas a legislação especial. O Capítulo X trata do fundo de investimento, que é uma comunhão de recursos destinada à aplicação em ativos financeiros, bens e direitos. A responsabilidade dos investidores e prestadores de serviços do fundo pode ser limitada, e o patrimônio segregado pode ser estabelecido para cada classe de cotas. Os fundos de investimento respondem diretamente por suas obrigações legais e contratuais, e os prestadores de serviço respondem por prejuízos causados com dolo ou má-fé. Em caso de insolvência, aplicam-se as regras previstas no Código Civil. Fundos de investimento regulamentados pela Comissão de Valores Mobiliários devem seguir as disposições do Capítulo.", "O documento trata do direito de superfície, onde o proprietário pode conceder a outrem o direito de construir ou plantar em seu terreno por tempo determinado. O direito de superfície pode ser gratuito ou oneroso, e o superficiário é responsável pelos encargos e tributos do imóvel. O direito de superfície pode ser transferido a terceiros e, em caso de alienação do imóvel, o superficiário ou o proprietário têm direito de preferência. A concessão pode ser resolvida se o superficiário der ao terreno destinação diversa da concedida, e extinta a concessão, o proprietário passa a ter a propriedade plena. Em caso de desapropriação, a indenização cabe ao proprietário e ao superficiário. O direito de superfície de pessoa jurídica de direito público interno segue as regras do Código Civil, salvo disposição em lei especial.", "O documento trata das servidões, que são direitos reais que proporcionam utilidade para um prédio dominante, gravando o prédio serviente pertencente a outro dono. A servidão pode ser constituída por declaração expressa dos proprietários, por testamento e registro no Cartório de Registro de Imóveis. O exercício incontestado e contínuo de uma servidão aparente por dez anos permite ao interessado registrá-la em seu nome, valendo como título a sentença que julgar consumada a usucapião. Se o possuidor não tiver título, o prazo da usucapião será de vinte anos.", "O documento trata do exercício das servidões, onde o dono de uma servidão pode realizar obras necessárias à sua conservação e uso, sendo as despesas rateadas entre os donos dos prédios envolvidos. As obras devem ser feitas pelo dono do prédio dominante, a menos que o título disponha o contrário. O dono do prédio serviente não pode impedir o exercício legítimo da servidão. A servidão pode ser removida de um local para outro, desde que não prejudique as vantagens do prédio dominante. O exercício da servidão deve se restringir às necessidades do prédio dominante, sem ampliação para outros fins. As servidões prediais são indivisíveis e continuam a gravar cada parte dos prédios envolvidos, a menos que se apliquem apenas a uma parte específica.", "O documento trata da extinção das servidões, estabelecendo que uma vez registrada, a servidão só se extingue com o cancelamento do registro. Caso o prédio dominante esteja hipotecado, é necessário o consentimento do credor para cancelar a servidão. O dono do prédio serviente tem direito ao cancelamento do registro, mesmo que o dono do prédio dominante se oponha, nos casos de renúncia do titular, cessação da utilidade para o prédio dominante ou resgate da servidão. A servidão também pode ser extinta pela reunião dos dois prédios sob o mesmo dono, pela supressão das obras ou pelo não uso por dez anos consecutivos.", "O usufruto pode recair em bens móveis ou imóveis, em um patrimônio inteiro ou parte dele, abrangendo os frutos e utilidades. O usufruto de imóveis deve ser registrado no Cartório de Registro de Imóveis, exceto quando resultar de usucapião. O usufruto se estende aos acessórios da coisa e seus acrescidos, com regras específicas para coisas consumíveis, florestas e recursos minerais. O usufrutuário tem direito a parte do tesouro achado por outrem e ao preço pago pelo vizinho do prédio usufruído para obter meação em estruturas. O usufruto não pode ser transferido por alienação, mas seu exercício pode ser cedido por título gratuito ou oneroso.", "O usufrutuário tem direito à posse, uso, administração e percepção dos frutos, incluindo títulos de crédito, podendo cobrar as dívidas e investir em títulos da mesma natureza ou em títulos da dívida pública federal. Os frutos naturais pendentes ao começar o usufruto pertencem ao usufrutuário, assim como as crias dos animais, com exceção das quantas necessárias para manter o gado existente. Os frutos civis vencidos na data inicial do usufruto pertencem ao proprietário, enquanto os vencidos na data de término pertencem ao usufrutuário. O usufrutuário pode usufruir do prédio em pessoa ou através de arrendamento, mas não pode mudar sua destinação econômica sem autorização do proprietário.", "O documento trata dos deveres do usufrutuário em relação à conservação dos bens recebidos em usufruto. O usufrutuário deve inventariar os bens, dar caução se exigido pelo dono, arcar com despesas ordinárias de conservação, pagar prestações e tributos, e informar o dono sobre qualquer lesão contra a posse da coisa. Além disso, o usufrutuário não é obrigado a pagar deteriorações resultantes do exercício regular do usufruto, mas deve arcar com despesas extraordinárias se necessário. Em caso de destruição do bem, o proprietário não é obrigado a reconstruí-lo, mas se a indenização do seguro for aplicada à reconstrução, o usufruto se restabelecerá.", "O usufruto pode ser extinto de diversas formas, como pela renúncia ou morte do usufrutuário, pelo termo de sua duração, pela extinção da pessoa jurídica em favor de quem foi constituído, pela cessação do motivo de origem, pela destruição da coisa, pela consolidação, pela culpa do usufrutuário, pelo não uso ou fruição da coisa. Se o usufruto foi constituído em favor de duas ou mais pessoas, a parte de cada uma que falecer será extinta, a menos que haja uma estipulação expressa em contrário.", "O Livro III, Título VII trata do Direito das Coisas, especificamente sobre o uso. O usuário tem o direito de usar a coisa e usufruir de seus frutos, de acordo com suas necessidades e as de sua família. As necessidades pessoais do usuário são avaliadas de acordo com sua condição social e local de residência. As necessidades da família do usuário incluem as do cônjuge, filhos solteiros e pessoas do serviço doméstico. As disposições relativas ao usufruto são aplicáveis ao uso, desde que não sejam contrárias à sua natureza.", "O Livro III trata do Direito das Coisas, e o Título VIII aborda o tema da Habitação. O artigo 1.414 estabelece que o titular do direito de habitar gratuitamente uma casa alheia não pode alugá-la ou emprestá-la, apenas ocupá-la com sua família. O artigo 1.415 determina que, se o direito de habitação for concedido a mais de uma pessoa, quem habitar a casa sozinho não precisa pagar aluguel aos outros titulares, mas não pode impedi-los de exercer o direito de habitá-la. Já o artigo 1.416 estabelece que as disposições relativas ao usufruto são aplicáveis à habitação, desde que não sejam contrárias à sua natureza.", "O Livro III trata do Direito das Coisas, mais especificamente do Direito do Promitente Comprador. O artigo 1.417 estabelece que, por meio de uma promessa de compra e venda registrada em cartório, o promitente comprador adquire direito real à aquisição do imóvel. Já o artigo 1.418 determina que o promitente comprador pode exigir a outorga da escritura definitiva de compra e venda do vendedor, e em caso de recusa, pode requerer a adjudicação do imóvel ao juiz.", "O documento trata das disposições gerais sobre penhor, hipoteca e anticrese. Estabelece que o bem dado em garantia fica sujeito ao cumprimento da obrigação, que apenas quem pode alienar pode empenhar, hipotecar ou dar em anticrese, e que a propriedade superveniente torna eficaz as garantias reais estabelecidas por quem não era dono. Também aborda o direito dos credores hipotecários e pignoratícios de excutir a coisa dada em garantia, o direito do credor anticrético de reter o bem até o pagamento da dívida, e as condições que devem constar nos contratos de penhor, anticrese ou hipoteca. Além disso, menciona as situações em que a dívida considera-se vencida, as regras para casos de perecimento da coisa dada em garantia, e a possibilidade do devedor dar a coisa em pagamento da dívida após o vencimento. Também trata da remição parcial do penhor ou hipoteca pelos sucessores do devedor e da responsabilidade pessoal do devedor pelo restante da dívida após a excussão do penhor ou hipoteca.", "O penhor é constituído pela transferência da posse de uma coisa móvel como garantia de um débito. No penhor rural, industrial, mercantil e de veículos, as coisas empenhadas continuam em posse do devedor. O instrumento do penhor deve ser registrado, sendo o do penhor comum registrado no Cartório de Títulos e Documentos.", "O credor pignoratício tem direito à posse da coisa empenhada, à retenção dela até ser indenizado das despesas justificadas, ao ressarcimento por prejuízos causados por vícios na coisa, à execução judicial ou venda amigável da coisa empenhada, à apropriação dos frutos da coisa, e à venda antecipada com autorização judicial em caso de receio de perda ou deterioração da coisa. O credor não pode ser obrigado a devolver a coisa empenhada antes de ser integralmente pago, mas o juiz pode determinar a venda de parte da coisa empenhada para pagamento do credor.", "O credor pignoratício tem várias obrigações, incluindo a custódia da coisa empenhada, a defesa da posse da mesma, a imputação dos frutos nas despesas e na dívida garantida, a restituição da coisa uma vez paga a dívida e a entrega do valor excedente do preço após o pagamento da dívida.", "O documento trata da extinção do penhor, que ocorre quando a obrigação é extinta, a coisa perece, o credor renuncia, as qualidades de credor e dono se confundem na mesma pessoa, ou quando há adjudicação judicial, remissão ou venda da coisa empenhada. A renúncia do credor é presumida em certas situações, e se houver confusão apenas em parte da dívida, o penhor subsiste quanto ao restante. A extinção do penhor produz efeitos após o cancelamento do registro.", "O penhor rural é constituído por meio de instrumento público ou particular registrado no Cartório de Registro de Imóveis. O devedor pode emitir uma cédula rural pignoratícia se prometer pagar a dívida em dinheiro. O penhor agrícola e pecuário não podem ter prazos superiores aos das obrigações garantidas. A garantia permanece mesmo após o vencimento dos prazos. O credor tem direito de verificar o estado das coisas empenhadas. O penhor agrícola pode recair sobre máquinas, colheitas, frutos, lenha, carvão e animais. O penhor pecuário abrange animais de atividades pastoris, agrícolas ou de lacticínios. O devedor não pode alienar os animais empenhados sem consentimento do credor. Os animais comprados para substituir os mortos ficam sub-rogados no penhor.", "O documento trata do penhor industrial e mercantil, que pode ter como objeto máquinas, aparelhos, materiais, animais, sal, produtos de suinocultura, entre outros. O penhor é constituído por meio de instrumento público ou particular registrado no Cartório de Registro de Imóveis. O devedor não pode alterar as coisas empenhadas sem o consentimento do credor, e o credor tem o direito de verificar o estado das coisas empenhadas.", "O documento trata do penhor de direitos e títulos de crédito, estabelecendo que podem ser objeto de penhor direitos sobre coisas móveis. Para constituir o penhor de direito, é necessário um instrumento público ou particular registrado no Registro de Títulos e Documentos. O titular do direito empenhado deve entregar os documentos comprobatórios desse direito ao credor pignoratício, a menos que tenha interesse legítimo em conservá-los. O penhor de crédito só tem eficácia quando notificado ao devedor. O credor pignoratício deve praticar os atos necessários à conservação do direito empenhado e cobrar os juros e prestações acessórias. O documento também aborda a cobrança do crédito empenhado, a preferência do credor pignoratício em caso de vários penhores, a extinção do penhor com a anuência do credor, e os direitos do credor em penhor de título de crédito. O devedor do título empenhado não pode pagar ao seu credor se receber a intimação do penhor, e o credor pignoratício deve saldar imediatamente a dívida se der quitação ao devedor.", "O documento trata do penhor de veículos, que podem ser objeto de penhor para garantir uma dívida. O penhor é constituído por meio de instrumento registrado no Cartório de Títulos e Documentos do domicílio do devedor. O devedor pode emitir uma cédula de crédito para pagar a dívida garantida. O credor tem o direito de verificar o estado do veículo empenhado e a alienação ou mudança do veículo sem comunicação ao credor resulta no vencimento antecipado da dívida. O penhor de veículos só pode ser convencionado por no máximo dois anos, podendo ser prorrogado por igual período.", "O artigo 1.467 do Capítulo II do Título X do Livro III trata do penhor legal, onde são listados os credores pignoratícios, como os hospedeiros e fornecedores de pousada ou alimento, bem como o dono do prédio rústico ou urbano. O artigo 1.468 estabelece que a conta das dívidas deve ser extraída conforme tabela impressa, sob pena de nulidade do penhor. O artigo 1.469 permite que o credor tome em garantia um ou mais objetos até o valor da dívida. O artigo 1.470 autoriza os credores a fazer efetivo o penhor antes de recorrerem à autoridade judiciária, em caso de perigo na demora. O artigo 1.471 determina que o credor deve requerer a homologação judicial do penhor após tomá-lo. Por fim, o artigo 1.472 permite que o locatário impeça a constituição do penhor mediante caução idônea.", "O documento trata das disposições gerais sobre hipoteca, incluindo os tipos de bens que podem ser objeto de hipoteca, como imóveis, navios, aeronaves, entre outros. Também aborda questões como a possibilidade de constituir uma segunda hipoteca sobre um imóvel, a sub-rogação de direitos do credor hipotecário que efetuar o pagamento das dívidas garantidas, a possibilidade de o adquirente do imóvel hipotecado exonerar-se da hipoteca, a remissão do imóvel pelo adquirente, a prorrogação da hipoteca, a emissão de cédula hipotecária, a extensão da hipoteca para garantir novas obrigações, entre outros aspectos relacionados à hipoteca.", "O documento trata da hipoteca legal, que é conferida pela lei em diversas situações, como para pessoas de direito público interno, filhos em caso de novo casamento dos pais, ofendidos por delitos, co-herdeiros e credores de imóveis arrematados. O credor da hipoteca legal pode exigir reforço da garantia se os imóveis especializados forem insuficientes, e a hipoteca legal pode ser substituída por caução de títulos da dívida pública ou outra garantia a critério do juiz.", "O registro da hipoteca deve ser feito no cartório do lugar do imóvel, ou de cada um deles, se o título se referir a mais de um. Os interessados devem requerer o registro da hipoteca, seguindo a ordem de numeração no protocolo para determinar a prioridade e preferência entre as hipotecas. Caso haja dúvida sobre a legalidade do registro, o oficial fará a prenotação do pedido e aguardará a decisão em até noventa dias. As hipotecas legais devem ser registradas e especializadas, sendo que a especialização deve ser renovada a cada vinte anos. O registro e a especialização das hipotecas legais podem ser feitos pelo responsável pela garantia ou pelos interessados, podendo o Ministério Público ser solicitado para realizar a inscrição.", "O documento trata da extinção da hipoteca, que pode ocorrer pela extinção da obrigação principal, pelo perecimento da coisa, pela resolução da propriedade, pela renúncia do credor, pela remição, pela arrematação ou adjudicação. Além disso, a hipoteca também pode ser extinta com a averbação do cancelamento do registro no Registro de Imóveis. No entanto, a arrematação ou adjudicação não extinguirá a hipoteca sem a notificação judicial dos credores hipotecários que não são partes na execução.", "O capítulo III do Título X do Livro III trata da hipoteca, especificamente da hipoteca de vias férreas. O artigo 1.502 estabelece que as hipotecas sobre estradas de ferro devem ser registradas no município da estação inicial da linha. O artigo 1.503 proíbe os credores hipotecários de interferir na exploração da linha ou nas modificações feitas pela administração. O artigo 1.504 limita a hipoteca à linha especificada na escritura e ao material de exploração, mas permite que os credores se oponham a vendas ou fusões que enfraqueçam a garantia do débito. O artigo 1.505 estabelece que na execução da hipoteca, o representante da União ou do Estado deve ser intimado para remir a estrada de ferro hipotecada.", "O primeiro documento trata da Anticrese, que é a possibilidade do devedor ceder ao credor o direito de perceber os frutos e rendimentos de um imóvel em compensação pela dívida. O credor anticrético pode administrar os bens dados em anticrese, mas deve apresentar balanço anual de sua administração. O documento também aborda a possibilidade de arrendamento dos bens dados em anticrese e a responsabilidade do credor pelas deteriorações do imóvel. Além disso, o adquirente dos bens dados em anticrese pode remi-los antes do vencimento da dívida.\n\nO segundo documento trata da Laje, que é a possibilidade do proprietário de uma construção-base ceder a superfície superior ou inferior de sua construção para que o titular da laje mantenha uma unidade distinta. O direito real de laje contempla o espaço aéreo ou subsolo de terrenos públicos ou privados. O titular da laje responde pelos encargos e tributos de sua unidade e pode usar, gozar e dispor dela. O documento também aborda as despesas necessárias à conservação e fruição das partes que servem a todo o edifício, que devem ser partilhadas entre o proprietário da construção-base e o titular da laje. Além disso, em caso de alienação de unidades sobrepostas, os titulares da construção-base e da laje têm direito de preferência. A ruína da construção-base implica na extinção do direito real de laje, exceto se o direito tiver sido instituído sobre o subsolo ou se a construção-base for reconstruída dentro de cinco anos.", "O Livro IV trata do Direito de Família, com foco no Direito Pessoal. O Título I aborda o tema do Casamento.", "O Livro IV, Título I, Capítulo I do Código Civil trata do Direito de Família, especificamente do Direito Pessoal. O casamento estabelece comunhão plena de vida entre os cônjuges, com base na igualdade de direitos e deveres. A celebração do casamento é civil e gratuita, sendo isenta de selos, emolumentos e custas para pessoas declaradas pobres. É proibido a qualquer pessoa interferir na comunhão de vida estabelecida pela família. O casamento se realiza quando o homem e a mulher manifestam sua vontade perante o juiz. O casamento religioso equipara-se ao civil se atender às exigências da lei e for registrado no registro próprio. O registro do casamento religioso deve ser feito dentro de noventa dias da realização, e caso não seja feito, é necessário uma nova habilitação. O casamento religioso celebrado sem as formalidades exigidas terá efeitos civis se for registrado no registro civil, desde que observado o prazo estabelecido. Será nulo o registro civil do casamento religioso se um dos cônjuges já estiver casado civilmente com outra pessoa.", "O Livro IV trata do Direito de Família, mais especificamente do Direito Pessoal, no qual o Capítulo II aborda a Capacidade para o Casamento. O artigo 1.517 estabelece que homens e mulheres com dezesseis anos podem se casar, desde que tenham autorização de ambos os pais ou representantes legais. Em caso de divergência entre os pais, aplica-se o disposto no artigo 1.631. O artigo 1.518 permite que os pais ou tutores revoguem a autorização para o casamento até a sua celebração. Já o artigo 1.519 prevê que a denegação do consentimento injusta pode ser suprida pelo juiz. Por fim, o artigo 1.520 proíbe o casamento de quem não atingiu a idade núbil, conforme o disposto no artigo 1.517.", "O Livro IV, Título I, Capítulo III do Código Civil trata dos impedimentos para o casamento. O artigo 1.521 lista as pessoas que não podem se casar, incluindo ascendentes com descendentes, afins em linha reta, irmãos, adotante com ex-cônjuge do adotado, entre outros. O artigo 1.522 estabelece que os impedimentos podem ser contestados por qualquer pessoa capaz antes da celebração do casamento, e o juiz ou oficial de registro deve declarar qualquer impedimento que tenha conhecimento.", "O Artigo 1.523 do Livro IV, Título I, Capítulo IV do Direito de Família trata das causas suspensivas para o casamento, que incluem a necessidade de inventário e partilha de bens em caso de viuvez, a espera de dez meses após a viuvez ou dissolução do casamento nulo/anulado, a homologação da partilha de bens em caso de divórcio, e a cessação da tutela ou curatela. O Parágrafo único permite que os nubentes solicitem ao juiz a dispensa das causas suspensivas em casos específicos. O Artigo 1.524 permite que parentes em linha reta de um dos nubentes e colaterais em segundo grau possam arguir as causas suspensivas do casamento.", "O documento trata do processo de habilitação para o casamento, que deve ser feito pessoalmente perante o oficial do Registro Civil, com a audiência do Ministério Público. O requerimento deve ser firmado pelos nubentes e instruído com diversos documentos, como certidão de nascimento, autorização das pessoas sob cuja dependência legal estiverem, declaração de testemunhas, entre outros. Caso haja impugnação, a habilitação será submetida ao juiz. Após a verificação da documentação e inexistência de fato obstativo, o oficial do registro extrairá o certificado de habilitação, que terá validade de noventa dias. O oficial do registro também deve esclarecer os nubentes sobre os fatos que podem ocasionar a invalidade do casamento e os diversos regimes de bens.", "O documento trata da celebração do casamento, estabelecendo as regras e procedimentos a serem seguidos. O casamento deve ser celebrado em local previamente designado, com a presença de pelo menos duas testemunhas. Após a celebração, um registro deve ser feito com informações detalhadas sobre os cônjuges, seus pais, testemunhas, documentos apresentados, entre outros. São estabelecidas também regras para casos de impedimento da autoridade competente para presidir o casamento, como a realização do ato em local alternativo. Além disso, são mencionadas as possibilidades de celebração do casamento em casos de iminente risco de vida de um dos nubentes, com a necessidade de posterior confirmação da validade do casamento. Também é mencionada a possibilidade de celebração do casamento por procuração, com regras específicas para sua validade.", "O casamento no Brasil é comprovado pela certidão de registro civil, mas em caso de falta ou perda do registro, outras formas de prova são admitidas. O casamento de brasileiro celebrado no exterior deve ser registrado em até 180 dias após o retorno ao Brasil. O casamento de pessoas que não podem manifestar vontade ou faleceram não pode ser contestado em prejuízo dos filhos, a menos que haja prova de que uma das partes já era casada. A prova do casamento por meio de processo judicial terá efeitos civis a partir da data do casamento. Em caso de dúvida, o casamento será considerado válido se os cônjuges viverem ou tiverem vivido na posse do estado de casados.", "O documento trata da invalidade do casamento, estabelecendo as condições em que um casamento pode ser considerado nulo ou anulável. São listados os motivos que tornam um casamento nulo, como infringência de impedimento, e os motivos que tornam um casamento anulável, como falta de idade mínima para casar, vício da vontade e incompetência da autoridade celebrante. Também são abordados os prazos para ação de anulação do casamento, as consequências da anulação por culpa de um dos cônjuges e a retroatividade da sentença de nulidade do casamento.", "O artigo 1.565 do Livro IV do Direito de Família trata da eficácia do casamento, onde homem e mulher assumem a condição de consortes, companheiros e responsáveis pelos encargos da família. O planejamento familiar é de livre decisão do casal, com recursos educacionais e financeiros disponibilizados pelo Estado. Os deveres dos cônjuges incluem fidelidade recíproca, vida em comum, mútua assistência, sustento e educação dos filhos, respeito mútuo. A direção da sociedade conjugal é exercida em colaboração, com possibilidade de recurso ao juiz em caso de divergência. Os cônjuges devem contribuir para o sustento da família e educação dos filhos, independentemente do regime patrimonial. O domicílio do casal é escolhido por ambos, mas podem se ausentar por motivos relevantes. Em casos específicos, um dos cônjuges pode exercer exclusivamente a direção da família e administração dos bens.", "O documento trata da dissolução da sociedade conjugal e do vínculo conjugal, destacando que a sociedade conjugal pode terminar pela morte de um dos cônjuges, nulidade ou anulação do casamento, separação judicial ou divórcio. São apresentadas as condições e procedimentos para a separação judicial, incluindo motivos que podem caracterizar a impossibilidade da comunhão de vida, a possibilidade de separação por mútuo consentimento, os efeitos da separação judicial, a possibilidade de reconciliação, a perda do direito de usar o sobrenome do cônjuge culpado na ação de separação judicial, a manutenção dos direitos e deveres dos pais em relação aos filhos após o divórcio, a conversão da separação judicial em divórcio, a competência para requerer o divórcio e a possibilidade de conceder o divórcio sem prévia partilha de bens.", "O documento trata da guarda dos filhos em casos de separação, divórcio ou dissolução de união estável. Define que a guarda pode ser unilateral, atribuída a um dos genitores, ou compartilhada, com responsabilização conjunta dos pais. Também estabelece que, em caso de falta de acordo entre os pais, a guarda compartilhada será aplicada, salvo em casos de risco de violência doméstica. Além disso, o documento aborda a possibilidade de visitas dos pais que não detêm a guarda, bem como a fiscalização da manutenção e educação dos filhos. Também menciona que as disposições sobre guarda e prestação de alimentos se aplicam aos maiores incapazes.", "O documento apresenta as disposições gerais sobre parentesco no Direito de Família. Define parentes em linha reta e colateral, distingue parentesco natural e civil, estabelece como contar os graus de parentesco e menciona o parentesco por afinidade, que se limita aos ascendentes, descendentes e irmãos do cônjuge ou companheiro, não se extinguindo na linha reta com a dissolução do casamento ou união estável.", "O documento trata da filiação no Direito de Família, estabelecendo que os filhos, independentemente de serem concebidos dentro ou fora do casamento, têm os mesmos direitos e qualificações. Também são apresentadas as presunções de filiação, como a concepção durante o casamento e em casos de inseminação artificial homóloga. Além disso, são abordadas questões como impotência do cônjuge, contestação da paternidade, prova da filiação, contestação da maternidade e ação de prova de filiação. O documento destaca que a filiação pode ser comprovada por meio do registro de nascimento ou por outros meios admitidos em lei.", "O reconhecimento dos filhos havidos fora do casamento é irrevogável e pode ser feito pelos pais conjunta ou separadamente, por registro de nascimento, escritura pública, testamento ou manifestação direta perante o juiz. O reconhecimento não pode ser revogado, mesmo em testamento, e o filho reconhecido não pode residir no lar conjugal sem o consentimento do outro cônjuge. O filho reconhecido fica sob a guarda do genitor que o reconheceu, e em caso de desacordo, sob a guarda de quem melhor atender aos interesses do menor. A condição e o termo apostos ao ato de reconhecimento do filho são ineficazes. O filho maior não pode ser reconhecido sem seu consentimento, e o menor pode impugnar o reconhecimento nos quatro anos seguintes à maioridade ou emancipação. Qualquer pessoa com interesse pode contestar a ação de investigação de paternidade ou maternidade. A sentença que julgar procedente a ação de investigação terá os mesmos efeitos do reconhecimento, podendo ordenar que o filho seja criado fora da companhia dos pais. A filiação materna ou paterna pode resultar de casamento declarado nulo.", "O documento trata da adoção de crianças e adolescentes, que deve seguir as regras previstas no Estatuto da Criança e do Adolescente. Também menciona que a adoção de maiores de 18 anos requer a assistência do poder público e uma sentença constitutiva. Além disso, os artigos de 1.620 a 1.629 foram revogados pela Lei nº 12.010 de 2009.", "Os filhos estão sujeitos ao poder familiar enquanto menores, que durante o casamento e a união estável é competência dos pais. Em caso de divergência entre os pais, é possível recorrer ao juiz para solução do desacordo. A separação judicial, o divórcio e a dissolução da união estável não alteram as relações entre pais e filhos, exceto quanto ao direito de terem os filhos em sua companhia. Se um filho não for reconhecido pelo pai, a mãe terá o poder familiar exclusivo, e se ela não puder exercê-lo, será designado um tutor para o menor.", "O artigo 1.634 do Livro IV, Título I, Capítulo V do Código Civil trata do exercício do poder familiar, que é competência de ambos os pais, independentemente da situação conjugal. Esse poder inclui dirigir a criação e educação dos filhos, exercer a guarda unilateral ou compartilhada, conceder ou negar consentimento para casamento, viagens ao exterior e mudança de residência, nomear tutor em caso de falecimento do outro genitor, representar os filhos judicial e extrajudicialmente até os 16 anos, reclamá-los de quem os detenha ilegalmente e exigir obediência, respeito e serviços adequados à idade e condição dos filhos. Essas disposições foram alteradas pela Lei nº 13.058 de 2014.", "O documento trata da suspensão e extinção do poder familiar, destacando que o poder familiar pode ser extinto pela morte dos pais ou do filho, emancipação, maioridade, adoção ou por decisão judicial. Também aborda que o pai ou a mãe que contrai novas núpcias ou estabelece união estável não perde os direitos ao poder familiar em relação aos filhos do relacionamento anterior. Além disso, menciona que o poder familiar pode ser suspenso em casos de abuso de autoridade, faltas aos deveres inerentes ou arruinamento dos bens dos filhos, bem como em casos de condenação por crime. Perderá o poder familiar aquele que praticar atos como castigar imoderadamente o filho, deixar em abandono, praticar atos contrários à moral, entre outros. Também destaca que perderá o poder familiar aquele que praticar crimes como homicídio, estupro, feminicídio, lesão corporal grave, entre outros, contra outrem titular do mesmo poder familiar ou contra filho, filha ou outro descendente.", "O Livro IV trata do Direito de Família, com foco no Direito Patrimonial. O Título II aborda o Regime de Bens entre os Cônjuges.", "O documento trata das disposições gerais sobre o direito patrimonial no casamento. Os nubentes podem estipular o regime de bens antes do casamento, podendo alterá-lo com autorização judicial. Caso não haja convenção, vigorará o regime da comunhão parcial. O regime da separação de bens é obrigatório em certos casos, como quando uma das partes tem mais de 70 anos. Os cônjuges têm liberdade para praticar diversos atos em relação aos bens, como administrar os próprios bens e reivindicar imóveis gravados sem consentimento. Dívidas contraídas para a economia doméstica obrigam ambos os cônjuges solidariamente. Há restrições quanto à alienação de bens imóveis e doações sem autorização do outro cônjuge. A falta de autorização pode tornar anulável o ato praticado, podendo ser pleiteada a anulação até dois anos após o término da sociedade conjugal. A administração dos bens de um cônjuge incapaz cabe ao outro, com autorização judicial para alienação de bens. O cônjuge na posse dos bens do outro é responsável como usufrutuário, procurador ou depositário, dependendo da situação.", "O pacto antenupcial deve ser feito por escritura pública e só é eficaz após o casamento. Se for realizado por menor, precisa da aprovação do representante legal, exceto nos casos de regime obrigatório de separação de bens. Qualquer cláusula que vá contra a lei é nula. No regime de participação final nos aqüestos, é possível dispor livremente dos bens imóveis desde que sejam particulares. As convenções antenupciais só têm efeito perante terceiros após serem registradas no Registro de Imóveis do domicílio dos cônjuges.", "O documento trata do regime de comunhão parcial de bens no Direito de Família, onde os bens adquiridos durante o casamento são considerados comuns, exceto algumas exceções. Os bens particulares de cada cônjuge, assim como as dívidas anteriores ao casamento, são excluídos da comunhão. A administração do patrimônio comum pode ser feita por qualquer um dos cônjuges, mas as dívidas contraídas durante a administração obrigam os bens comuns e particulares do cônjuge responsável. Os bens da comunhão respondem pelas obrigações da família e despesas legais, enquanto a administração dos bens particulares compete ao cônjuge proprietário. As dívidas contraídas na administração dos bens particulares de um cônjuge não obrigam os bens comuns.", "O regime de comunhão universal implica na comunicação de todos os bens presentes e futuros dos cônjuges e suas dívidas passivas, com exceções como bens doados ou herdados com cláusula de incomunicabilidade, bens gravados de fideicomisso, dívidas anteriores ao casamento, doações antenupciais com cláusula de incomunicabilidade, e outros bens específicos. A incomunicabilidade dos bens não se estende aos frutos durante o casamento. O regime também segue as regras de administração dos bens do Capítulo anterior e, uma vez extinta a comunhão, a responsabilidade de cada cônjuge para com os credores do outro cessa.", "O documento trata do regime de participação final nos aqüestos no Direito de Família, onde cada cônjuge possui patrimônio próprio e tem direito à metade dos bens adquiridos pelo casal durante o casamento. São estabelecidas regras para a administração dos bens, exclusividade de cada cônjuge sobre seus próprios bens, exclusões do montante dos aqüestos, responsabilidades por dívidas, entre outros aspectos. Também são abordadas questões como doações feitas sem autorização do outro cônjuge, pagamento de dívidas com bens do patrimônio de um dos cônjuges, propriedade de bens móveis e imóveis, divisão de bens em caso de separação ou divórcio, e meação na dissolução da sociedade conjugal por morte.", "O documento trata do Direito de Família, especificamente do Regime de Separação de Bens, do Usufruto e da Administração dos Bens de Filhos Menores, dos Alimentos e do Bem de Família. Ele estabelece as regras para a separação de bens entre cônjuges, a administração dos bens dos filhos menores, a obrigação de prestar alimentos entre parentes, cônjuges e companheiros, a possibilidade de instituir um bem de família e as regras para sua administração e proteção. Também aborda a extinção do bem de família em diferentes situações, como a dissolução da sociedade conjugal e a morte dos cônjuges e dos filhos.", "O documento trata do reconhecimento da união estável como entidade familiar, estabelecendo os requisitos para sua configuração, como convivência pública, contínua e duradoura com o objetivo de constituir família. Também aborda os deveres dos companheiros, as relações patrimoniais e a possibilidade de conversão da união estável em casamento. Além disso, diferencia a união estável do concubinato, que são as relações não eventuais entre pessoas impedidas de casar.", "O documento trata do Direito de Família, especificamente da Tutela, Curatela e Tomada de Decisão Apoiada. Ele aborda a nomeação de tutores para filhos menores em casos de falecimento dos pais, ausência dos pais ou decaimento do poder familiar. Também menciona a nomeação de tutor pelos pais em conjunto, a preferência de parentes consanguíneos para a tutela em caso de falta de nomeação pelos pais, a nomeação de tutor pelo juiz em casos específicos, a nomeação de curador especial para menores herdeiros, e a nomeação de tutores para crianças e adolescentes cujos pais são desconhecidos, falecidos ou destituídos do poder familiar.", "O documento trata do Direito de Família, especificamente da Tutela, Curatela e Tomada de Decisão Apoiada. O artigo 1.735 lista as condições em que uma pessoa não pode ser tutor de um menor e será exonerada da tutela caso a exerça, como não ter livre administração de seus bens, estar em obrigação com o menor, ter demanda contra o menor, ser inimigo do menor, ter sido condenado por crimes específicos, ter mau procedimento ou ter exercido função pública incompatível com a tutela.", "O documento trata do direito de família, especificamente sobre a tutela, curatela e tomada de decisão apoiada. O capítulo aborda a escusa dos tutores, listando as condições em que eles podem se recusar a assumir a tutela, como mulheres casadas, maiores de sessenta anos, entre outros. Também estabelece que quem não for parente do menor não pode ser obrigado a aceitar a tutela se houver parente idôneo disponível. Além disso, define prazos para apresentação da escusa e as consequências caso ela não seja aceita pelo juiz.", "O documento trata do exercício da tutela, que é a responsabilidade de cuidar da pessoa e dos bens de um menor de idade. O tutor deve dirigir a educação, prestar alimentos, administrar os bens do tutelado com zelo e boa-fé, representar o menor em atos da vida civil, entre outras responsabilidades. O tutor também deve prestar contas de suas ações e é responsável por eventuais prejuízos causados ao tutelado. Há regras específicas sobre a administração dos bens do menor, como a necessidade de autorização judicial para realizar certos atos, como a venda de imóveis.", "O documento trata das regras relacionadas aos bens do tutelado, estabelecendo que os tutores não podem conservar dinheiro dos tutelados, devendo utilizá-lo apenas para despesas ordinárias com sustento, educação e administração de bens. Caso haja necessidade, objetos de valor devem ser avaliados e alienados com autorização judicial. Os valores em estabelecimento bancário oficial só podem ser retirados com autorização do juiz, para as finalidades especificadas no artigo. Os tutores são responsáveis pela demora na aplicação dos valores e devem pagar juros legais.", "O documento trata da prestação de contas dos tutores em relação à administração dos bens dos tutelados. Os tutores são obrigados a prestar contas anualmente, submetendo o balanço ao juiz para aprovação. As contas devem ser prestadas a cada dois anos, quando deixarem a tutela ou sempre que o juiz considerar conveniente. A quitação do menor após o fim da tutela não terá efeito antes da aprovação das contas pelo juiz. Em caso de morte, ausência ou interdição do tutor, as contas serão prestadas por seus herdeiros ou representantes. As despesas justificadas e proveitosas ao menor serão creditadas ao tutor, e as despesas com a prestação de contas serão pagas pelo tutelado. O alcance do tutor e o saldo contra o tutelado são dívidas de valor que vencem juros desde o julgamento definitivo das contas.", "O Livro IV do Direito de Família trata da Tutela, da Curatela e da Tomada de Decisão Apoiada. O Capítulo I aborda a Tutela, especificamente a Cessação da Tutela. A condição de tutelado cessa com a maioridade ou emancipação do menor, ou ao cair o menor sob o poder familiar no caso de reconhecimento ou adoção. As funções do tutor cessam ao expirar o termo em que era obrigado a servir, ao sobrevir escusa legítima ou ao ser removido. O tutor é obrigado a servir por dois anos, podendo continuar além desse prazo se o juiz julgar conveniente ao menor. O tutor será destituído se for negligente, prevaricador ou incapaz.", "O documento trata do Direito de Família, especificamente da Tutela, Curatela e Tomada de Decisão Apoiada. O artigo 1.767 lista quem está sujeito à curatela, incluindo aqueles que não podem expressar sua vontade, ébrios habituais, viciados em tóxicos e pródigos. O artigo 1.774 estabelece que as disposições sobre tutela se aplicam à curatela. O artigo 1.775 determina que o cônjuge ou companheiro não separado judicialmente é o curador do outro, seguido pelos pais, descendentes e, na falta destes, a escolha é feita pelo juiz. O documento também aborda a possibilidade de curatela compartilhada e a importância de preservar o direito à convivência familiar e comunitária das pessoas sob curatela.", "O documento trata do Direito de Família, especificamente da Tutela, Curatela e Tomada de Decisão Apoiada. No caso da Curatela, aborda a curatela do nascituro e do enfermo ou portador de deficiência física. O artigo 1.779 estabelece que será designado um curador para o nascituro caso o pai faleça estando a mulher grávida e não tendo o poder familiar. Já o parágrafo único determina que se a mulher estiver interdita, seu curador será o do nascituro. O artigo 1.780 foi revogado pela Lei nº 13.146 de 2015.", "O documento apresenta as regras referentes à curatela e à tomada de decisão apoiada. Na curatela, o curador priva o pródigo de realizar certos atos sem sua supervisão. No caso de curador ser o cônjuge em regime de comunhão universal de bens, não é obrigado a prestar contas, exceto por determinação judicial. Já a tomada de decisão apoiada é um processo em que a pessoa com deficiência escolhe pelo menos duas pessoas de confiança para ajudá-la na tomada de decisões sobre atos da vida civil. O documento também estabelece os procedimentos para solicitar a tomada de decisão apoiada, as responsabilidades dos apoiadores, as consequências em caso de negligência por parte deles, e a possibilidade de encerrar o acordo a qualquer momento. Além disso, as disposições referentes à prestação de contas na curatela também se aplicam à tomada de decisão apoiada.", "O documento apresenta as disposições gerais sobre a sucessão no Direito das Sucessões. Aborda que a herança é transmitida aos herdeiros legítimos e testamentários, que a sucessão abre-se no último domicílio do falecido, que pode ocorrer por lei ou por disposição de última vontade, e que a lei vigente ao tempo da abertura da sucessão regula a sucessão e a legitimação para suceder. Também menciona que, na ausência de testamento, a herança é transmitida aos herdeiros legítimos, e que havendo herdeiros necessários, o testador só pode dispor da metade da herança. Além disso, destaca as condições em que a companheira ou companheiro participará da sucessão do outro em relação aos bens adquiridos durante a união estável.", "O artigo 1.791 estabelece que a herança é deferida como um todo unitário, mesmo que haja vários herdeiros. O artigo 1.792 determina que o herdeiro não responde por encargos superiores às forças da herança, mas deve provar o excesso. O artigo 1.793 permite a cessão do direito à sucessão aberta por escritura pública. O artigo 1.796 estabelece que o inventário do patrimônio hereditário deve ser instaurado no prazo de trinta dias após a abertura da sucessão. O artigo 1.797 define a ordem de administração da herança até o compromisso do inventariante.", "O documento trata do Direito das Sucessões, especificamente sobre a vocação hereditária. Define quem pode suceder, incluindo pessoas nascidas ou concebidas no momento da abertura da sucessão, filhos ainda não concebidos indicados pelo testador, pessoas jurídicas e fundações determinadas pelo testador. Também aborda a nomeação de curador para herdeiros ainda não concebidos, a nulidade de disposições testamentárias em favor de pessoas não legitimadas a suceder e a possibilidade de deixar bens para filhos de concubinos, desde que também sejam filhos do testador.", "O documento trata do Direito das Sucessões, especificamente sobre a aceitação e renúncia da herança. A aceitação da herança torna definitiva a transmissão ao herdeiro, enquanto a renúncia impede essa transmissão. A aceitação pode ser expressa por declaração escrita ou tácita por atos próprios da qualidade de herdeiro. A renúncia deve constar em instrumento público ou termo judicial. Não é possível aceitar ou renunciar a herança em parte, sob condição ou a termo. Em caso de renúncia, a parte do renunciante acresce aos outros herdeiros da mesma classe. Os atos de aceitação ou renúncia da herança são irrevogáveis. Em caso de renúncia prejudicar os credores, estes podem, com autorização do juiz, aceitar a herança em nome do renunciante.", "O documento trata dos casos em que herdeiros ou legatários podem ser excluídos da sucessão, como por exemplo, se forem autores de homicídio doloso contra a pessoa de cuja sucessão se tratar, se acusarem caluniosamente o autor da herança em juízo, ou se inibirem o autor da herança de dispor livremente de seus bens por meios fraudulentos. A exclusão do herdeiro ou legatário por indignidade deve ser declarada por sentença, e o Ministério Público tem legitimidade para demandar essa exclusão em casos de homicídio doloso. O trânsito em julgado de sentença penal condenatória acarreta a imediata exclusão do herdeiro indigno. Os descendentes do herdeiro excluído sucedem como se ele estivesse morto antes da abertura da sucessão. São válidas as alienações onerosas de bens hereditários a terceiros de boa-fé e os atos de administração praticados pelo herdeiro antes da sentença de exclusão. O excluído da sucessão é obrigado a restituir os frutos e rendimentos dos bens da herança que houver percebido. Aquele que incorreu em atos que determinem a exclusão da herança pode ser admitido a suceder se o ofendido o reabilitar expressamente em testamento ou em outro ato autêntico.", "O documento trata da herança jacente, que ocorre quando alguém falece sem deixar testamento ou herdeiro legítimo conhecido. Nesse caso, os bens da herança ficam sob a guarda de um curador até a entrega ao sucessor habilitado ou declaração de vacância. Após um ano da primeira publicação dos editais sem herdeiro habilitado, a herança é declarada vacante. Os credores têm direito de pedir o pagamento das dívidas reconhecidas. Se nenhum herdeiro se habilitar em cinco anos, os bens passam para o domínio público. Se todos os chamados a suceder renunciarem à herança, ela é declarada vacante imediatamente.", "O capítulo VII do Título I do Livro V trata da petição de herança, onde o herdeiro pode demandar o reconhecimento de seu direito sucessório para obter a restituição da herança contra quem a possua, mesmo sem título. A ação de petição de herança pode abranger todos os bens hereditários, e o possuidor da herança está obrigado à restituição dos bens do acervo. A responsabilidade do possuidor é determinada a partir da citação, seguindo as regras de posse de má-fé e mora. O herdeiro pode demandar os bens da herança mesmo em poder de terceiros, com eficácia das alienações feitas pelo herdeiro aparente a terceiros de boa-fé. O herdeiro aparente que pagou um legado de boa-fé não está obrigado a prestar o equivalente ao verdadeiro sucessor, ressalvando-se o direito deste último de proceder contra quem recebeu o pagamento.", "O documento trata da sucessão legítima, que é a forma de transferência de bens de uma pessoa falecida para seus herdeiros de acordo com a lei. A ordem de vocação hereditária é estabelecida, dando preferência aos descendentes, ascendentes, cônjuge sobrevivente e colaterais, nessa ordem. São estabelecidas regras específicas para cada categoria de herdeiros, como direito real de habitação para o cônjuge, quotas mínimas de herança, exclusão de herdeiros em graus mais remotos, entre outros. Em caso de falta de herdeiros sucessíveis, a herança pode ser devolvida ao Município, Distrito Federal ou União.", "O documento trata do direito das sucessões, especificamente da sucessão legítima e dos herdeiros necessários. Os herdeiros necessários são os descendentes, ascendentes e cônjuge, que têm direito a metade dos bens da herança, chamada de legítima. A legítima é calculada sobre o valor dos bens na abertura da sucessão, descontando dívidas e despesas do funeral, e adicionando o valor dos bens sujeitos a colação. O testador não pode estabelecer cláusulas de inalienabilidade, impenhorabilidade e incomunicabilidade sobre os bens da legítima, exceto se houver justa causa. Também não pode converter os bens da legítima em outros de espécie diversa, a menos que haja autorização judicial e justa causa. O herdeiro necessário que receber parte disponível ou legado do testador não perde o direito à legítima. Para excluir os herdeiros colaterais da sucessão, basta que o testador disponha de seu patrimônio sem contemplá-los.", "O documento trata do Direito das Sucessões, especificamente sobre a Sucessão Legítima e o Direito de Representação. O direito de representação ocorre quando a lei chama certos parentes do falecido para suceder em seus direitos como se estivesse vivo. Esse direito ocorre na linha reta descendente, mas nunca ascendente, e na linha transversal somente em favor dos filhos de irmãos do falecido. Os representantes herdam o que o representado herdaria se estivesse vivo, e o quinhão do representado é dividido igualmente entre os representantes. Além disso, o renunciante à herança de uma pessoa pode representá-la na sucessão de outra. O documento também aborda a Sucessão Testamentária, onde toda pessoa capaz pode dispor de seus bens por testamento, exceto a legítima dos herdeiros necessários. O testamento é ato personalíssimo e pode ser mudado a qualquer tempo, e o direito de impugnar sua validade se extingue em cinco anos a partir do registro.", "O documento trata da capacidade de testar no Direito das Sucessões. Segundo o artigo 1.860, não podem testar os incapazes e aqueles que não tiverem pleno discernimento no momento de fazê-lo. No entanto, o parágrafo único do mesmo artigo estabelece que os maiores de dezesseis anos podem testar. O artigo 1.861 afirma que a incapacidade superveniente do testador não invalida o testamento, e que o testamento de um incapaz se valida com a superveniência da capacidade.", "O documento trata das formas ordinárias do testamento, que são o público, o cerrado e o particular. Também destaca que é proibido o testamento conjuntivo, seja simultâneo, recíproco ou correspectivo.", "O documento trata do Testamento Público, que é uma das formas ordinárias de testamento. Os requisitos essenciais para um testamento público são: ser escrito por um tabelião ou seu substituto legal, ser lido em voz alta pelo tabelião ao testador e duas testemunhas, e ser assinado pelo testador, pelas testemunhas e pelo tabelião. Caso o testador não possa assinar, o tabelião pode assinar em seu lugar, e no caso de indivíduos surdos ou cegos, há regras específicas a serem seguidas.", "O documento descreve as formalidades necessárias para a validade de um testamento cerrado. O testamento deve ser escrito pelo testador ou por outra pessoa a seu pedido, e deve ser entregue ao tabelião na presença de duas testemunhas. O tabelião deve então lavrar um auto de aprovação, que deve ser assinado pelo tabelião, pelas testemunhas e pelo testador. O testamento pode ser escrito mecanicamente, desde que seja numerado e autenticado pelo testador. Após a aprovação, o testamento é entregue ao testador e o tabelião faz um registro do mesmo. Após a morte do testador, o testamento é apresentado ao juiz para ser aberto e registrado, e será cumprido a menos que haja algum vício externo que o torne nulo ou suspeito de falsidade.", "O documento trata das formas ordinárias do testamento, especificamente do testamento particular. O testamento particular pode ser escrito de próprio punho ou por processo mecânico. Se escrito de próprio punho, deve ser lido e assinado pelo testador na presença de pelo menos três testemunhas. Se elaborado por processo mecânico, não pode conter rasuras ou espaços em branco e deve ser assinado pelo testador na presença de pelo menos três testemunhas. Após a morte do testador, o testamento deve ser publicado em juízo com citação dos herdeiros legítimos. Se houver contestação das testemunhas sobre a disposição do testamento, ele poderá ser confirmado se as assinaturas forem reconhecidas. Em circunstâncias excepcionais, um testamento particular de próprio punho e assinado pelo testador, sem testemunhas, poderá ser confirmado a critério do juiz. O testamento particular também pode ser escrito em língua estrangeira, desde que as testemunhas a compreendam.", "O documento trata dos codicilos, que são disposições especiais feitas por uma pessoa capaz de testar, através de um escrito particular datado e assinado. Os codicilos podem incluir instruções sobre o enterro, doações para pessoas específicas ou para os pobres de um determinado lugar, bem como a doação de móveis, roupas ou jóias de pouco valor. Os atos feitos através de codicilos podem nomear ou substituir testamenteiros. Os codicilos podem ser revogados por atos iguais e são considerados revogados se um testamento posterior não os confirmar ou modificar. Se um codicilo estiver fechado, ele deve ser aberto da mesma forma que um testamento cerrado.", "O documento trata do Direito das Sucessões, especificamente sobre os testamentos especiais. São considerados testamentos especiais o marítimo, o aeronáutico e o militar, sendo que não são admitidos outros testamentos especiais além dos mencionados no Código.", "O documento trata dos testamentos especiais, mais especificamente do testamento marítimo e do testamento aeronáutico. O artigo 1.888 estabelece que quem estiver em viagem a bordo de navio nacional pode testar perante o comandante, com a presença de duas testemunhas. O registro do testamento deve ser feito no diário de bordo. O artigo 1.889 trata do testamento aeronáutico, que pode ser feito a bordo de aeronave militar ou comercial, perante pessoa designada pelo comandante. O testamento marítimo ou aeronáutico deve ficar sob a guarda do comandante e ser entregue às autoridades administrativas do primeiro porto ou aeroporto nacional. O documento também estabelece que o testamento marítimo ou aeronáutico caducará se o testador não morrer na viagem ou nos noventa dias seguintes ao desembarque em terra. Além disso, não será válido o testamento marítimo se o navio estiver em porto onde o testador possa desembarcar e testar na forma ordinária.", "O artigo 1.893 do Código Civil trata do Testamento Militar, que pode ser feito por militares em campanha, em praça sitiada ou com comunicações interrompidas, perante duas ou três testemunhas caso não haja tabelião disponível. O artigo 1.894 permite que o testador escreva o testamento de próprio punho, desde que o date e assine por extenso na presença de duas testemunhas. O artigo 1.895 estabelece que o testamento militar caduca se o testador estiver por noventa dias seguidos em um local onde possa fazer um testamento ordinário. O artigo 1.896 permite que pessoas em combate ou feridas testem oralmente, desde que confiem sua última vontade a duas testemunhas, mas o testamento não terá efeito se o testador não morrer na guerra ou se recuperar do ferimento.", "O documento apresenta uma série de artigos relacionados às disposições testamentárias no Direito das Sucessões. São abordados temas como a nomeação de herdeiros e legatários, condições para as disposições, nulidade de certas disposições, designação de tempo para o início ou término do direito do herdeiro, interpretação de cláusulas testamentárias, disposições em favor de pessoas incertas, disposições em favor dos pobres e instituições de caridade, erro na designação de herdeiros, partilha da herança entre herdeiros nomeados individualmente e coletivamente, entre outros. Também são abordadas questões como a anulabilidade de disposições testamentárias por erro, dolo ou coação, prazos para anulação, ineficácia de uma disposição testamentária implicando na ineficácia de outras determinadas pelo testador, cláusulas de inalienabilidade e suas consequências, e a possibilidade de desapropriação ou alienação dos bens clausulados mediante autorização judicial.", "O documento apresenta uma série de disposições relacionadas aos legados em um testamento. Estabelece que um legado de coisa certa que não pertença ao testador no momento da abertura da sucessão é ineficaz. Também aborda a renúncia à herança ou legado caso o herdeiro ou legatário não cumpra a ordem de entregar algo de sua propriedade a outrem. Além disso, define regras para casos em que a coisa legada pertence apenas em parte ao testador, para legados de coisas determinadas pelo gênero, para legados de crédito ou quitação de dívida, entre outros. Também trata de legados de alimentos, usufruto e imóveis, estabelecendo regras específicas para cada situação.", "O artigo 1.923 estabelece que desde a abertura da sucessão, o legatário tem direito à coisa certa existente no acervo, exceto se o legado estiver sob condição suspensiva. O artigo 1.924 determina que o direito de pedir o legado não pode ser exercido enquanto houver litígio sobre a validade do testamento. O artigo 1.925 estabelece que o legado em dinheiro só vence juros a partir do momento em que a pessoa obrigada a prestá-lo entrar em mora. Os artigos subsequentes tratam de questões como legados em renda vitalícia, prestações periódicas, escolha de coisas determinadas pelo gênero, opção em legados alternativos, cumprimento dos legados pelos herdeiros ou legatários, entre outros. Em resumo, os artigos abordam os efeitos do legado e seu pagamento, estabelecendo regras e procedimentos a serem seguidos nesses casos.", "O artigo 1.939 do Livro V, Título II, Capítulo VI, Seção III do Direito das Sucessões trata da caducidade dos legados, estabelecendo que um legado caducará se o testador modificar a coisa legada, alienar total ou parcialmente a coisa, se a coisa perecer ou for evicta sem culpa do herdeiro ou legatário, se o legatário for excluído da sucessão nos termos do artigo 1.815, ou se o legatário falecer antes do testador. O artigo 1.940 estabelece que se o legado for de duas ou mais coisas alternativamente e algumas delas perecerem, o legado subsistirá quanto às restantes, e se parte de uma coisa perecer, o remanescente do legado ainda terá validade.", "O documento trata do direito de acrescer entre herdeiros e legatários em casos específicos, como quando vários herdeiros são chamados à herança em quinhões não determinados e um deles não pode ou não quer aceitá-la, nesse caso sua parte acrescerá aos co-herdeiros. O direito de acrescer também se aplica aos co-legatários em situações específicas. Caso não se efetue o direito de acrescer, a quota vaga do nomeado é transmitida aos herdeiros legítimos. O beneficiário do acréscimo não pode repudiá-lo separadamente da herança ou legado que lhe caiba, exceto se houver encargos especiais impostos pelo testador. Também é mencionado o caso de um usufruto legado conjuntamente a várias pessoas, onde a parte da que faltar acresce aos co-legatários.", "O documento trata das substituições no Direito das Sucessões, onde o testador pode nomear outra pessoa como substituta do herdeiro ou legatário caso estes não queiram ou não possam aceitar a herança ou legado. É permitido substituir muitas pessoas por uma só, ou vice-versa, com reciprocidade ou sem ela. O substituto fica sujeito às mesmas condições ou encargos impostos ao substituído, a menos que a intenção do testador seja diferente. Em caso de substituição recíproca entre co-herdeiros ou legatários de partes desiguais, a proporção dos quinhões será mantida na segunda disposição, e se mais pessoas forem incluídas na substituição, o quinhão vago será dividido igualmente entre os substitutos.", "O documento trata da substituição fideicomissária no Direito das Sucessões, onde o testador pode instituir herdeiros ou legatários, estabelecendo que a herança ou legado se transmita ao fiduciário, resolvendo-se o direito deste em favor de outrem, que se qualifica de fideicomissário. A substituição fideicomissária só é permitida em favor dos não concebidos ao tempo da morte do testador. O fiduciário tem a propriedade da herança ou legado, mas restrita e resolúvel, sendo obrigado a proceder ao inventário dos bens gravados. O fideicomissário pode renunciar à herança ou legado, e se aceitar, terá direito à parte que ao fiduciário acrescer. A nulidade da substituição ilegal não prejudica a instituição, que valerá sem o encargo resolutório.", "O documento trata das regras de deserdação no Direito das Sucessões. Os herdeiros necessários podem ser privados de sua legítima em casos em que podem ser excluídos da sucessão. Além das causas mencionadas, autorizam a deserdação dos descendentes por seus ascendentes ofensa física, injúria grave, relações ilícitas com madrasta ou padrasto, desamparo do ascendente em alienação mental ou grave enfermidade. Já a deserdação dos ascendentes pelos descendentes pode ocorrer por ofensa física, injúria grave, relações ilícitas com a mulher ou companheira do filho ou neto, desamparo do filho ou neto com deficiência mental ou grave enfermidade. A deserdação em testamento só pode ocorrer com expressa declaração de causa, cabendo ao herdeiro instituído provar a veracidade da causa alegada pelo testador. O direito de provar a causa da deserdação extingue-se em quatro anos a partir da abertura do testamento.", "O documento trata da redução das disposições testamentárias que excedem a parte disponível da herança, estabelecendo que o remanescente pertencerá aos herdeiros legítimos. Caso as disposições excedam a parte disponível, estas serão proporcionalmente reduzidas, assim como os legados, se necessário. Também aborda a revogação do testamento, que pode ser total ou parcial, e os efeitos da revogação, mesmo que o testamento revogatório seja anulado por omissão ou infração de formalidades. O documento também menciona que um testamento cerrado que for aberto ou dilacerado será considerado revogado.", "Os artigos 1.973, 1.974 e 1.975 do Livro V, Título II, Capítulo XIII do Direito das Sucessões tratam do rompimento do testamento em diferentes situações. O artigo 1.973 estabelece que o testamento é rompido caso um descendente sucessível do testador, que não era conhecido quando o testamento foi feito, sobreviva ao testador. O artigo 1.974 determina que o testamento é rompido se for feito na ignorância da existência de outros herdeiros necessários. Já o artigo 1.975 estabelece que o testamento não é rompido se o testador dispuser da sua metade, desde que saiba da existência dos herdeiros necessários ou os exclua dessa parte.", "O documento trata das atribuições e responsabilidades do testamenteiro na execução do testamento. O testador pode nomear um ou mais testamenteiros, que devem cumprir as disposições de última vontade, podendo inclusive conceder-lhes a posse e administração da herança. O testamenteiro deve requerer inventário, cumprir o testamento, prestar contas do que recebeu e despendeu, defender a validade do testamento, entre outras atribuições. O prazo para cumprir o testamento e prestar contas é de cento e oitenta dias, podendo ser prorrogado. Na falta de testamenteiro nomeado, a execução compete a um dos cônjuges ou a um herdeiro nomeado pelo juiz. O testamenteiro tem direito a um prêmio, que pode ser preferido à herança ou legado, e que reverte à herança se não cumprir suas obrigações. Em caso de distribuição total da herança em legados, o testamenteiro exerce as funções de inventariante.", "O documento trata do Direito das Sucessões, especificamente do Inventário e da Partilha. O inventariante é responsável pela administração da herança desde a assinatura do compromisso até a homologação da partilha.", "O texto trata sobre os sonegados no inventário e partilha de bens de uma herança. O herdeiro que sonegar bens da herança perderá o direito sobre eles. Além disso, se o sonegador for o próprio inventariante, ele será removido do cargo. A pena de sonegados só pode ser requerida em ação movida pelos herdeiros ou credores da herança, e a sentença obtida nessa ação beneficiará todos os interessados. Se os bens sonegados não forem restituídos, o sonegador terá que pagar a importância dos valores ocultados, mais perdas e danos. A sonegação só pode ser alegada após a descrição dos bens no inventário e a declaração de que não existem outros a inventariar e partir.", "O Artigo 1.997 estabelece que a herança é responsável pelo pagamento das dívidas do falecido, mas após a partilha, os herdeiros são responsáveis proporcionalmente à parte que receberam. O Artigo 1.998 determina que as despesas funerárias saem da herança, enquanto as de sufrágios só são obrigatórias se estiverem previstas em testamento. O Artigo 1.999 trata da divisão da parte do co-herdeiro insolvente entre os demais em caso de ação regressiva. O Artigo 2.000 estabelece que legatários e credores da herança têm preferência no pagamento em relação aos credores do herdeiro. O Artigo 2.001 determina que se o herdeiro for devedor ao espólio, a dívida será dividida entre todos, a menos que a maioria concorde em imputar a dívida apenas ao devedor.", "O documento trata da colação, que é a obrigação dos descendentes que concorrem à sucessão do ascendente comum de conferir o valor das doações recebidas em vida, para igualar as legítimas. São detalhadas as regras para cálculo da colação, dispensa da colação, redução das doações em caso de excesso, obrigações dos netos em relação aos avós, gastos ordinários do ascendente com o descendente, doações remuneratórias de serviços feitos ao ascendente, e a conferência das doações feitas por ambos os cônjuges no inventário de cada um.", "O artigo 2.013 estabelece que o herdeiro pode requerer a partilha mesmo que o testador o proíba, assim como seus cessionários e credores. O artigo 2.014 permite que o testador indique os bens que devem compor os quinhões hereditários, prevalecendo a partilha feita por ele, a menos que o valor dos bens não corresponda às quotas estabelecidas. O artigo 2.015 permite que os herdeiros capazes façam uma partilha amigável por escritura pública, termo nos autos do inventário ou escrito particular homologado pelo juiz. O artigo 2.016 determina que a partilha será sempre judicial se os herdeiros divergirem ou se algum deles for incapaz. O artigo 2.017 estabelece que na partilha dos bens deve-se observar a maior igualdade possível quanto ao valor, natureza e qualidade. O artigo 2.018 valida a partilha feita por ascendente desde que não prejudique a legítima dos herdeiros necessários. O artigo 2.019 determina que os bens insuscetíveis de divisão cômoda serão vendidos judicialmente se não couberem na meação do cônjuge sobrevivente ou no quinhão de um só herdeiro, a menos que haja acordo para serem adjudicados a todos. Os artigos 2.020 e 2.021 tratam das obrigações e procedimentos em relação aos bens da herança, enquanto o artigo 2.022 estabelece que os bens sonegados e outros bens da herança descobertos após a partilha estão sujeitos a uma sobrepartilha."]