["O documento trata das pessoas naturais, abordando a personalidade e capacidade civil. Define que toda pessoa é capaz de direitos e deveres na ordem civil, que a personalidade civil começa do nascimento com vida e que os direitos do nascituro são protegidos desde a concepção. Também estabelece as condições de incapacidade absoluta e relativa, bem como as formas de cessação da menoridade. Além disso, aborda a existência da pessoa natural, a morte presumida, o registro de nascimentos, casamentos e óbitos, entre outros aspectos relacionados às pessoas naturais.", "O documento apresenta os direitos da personalidade das pessoas naturais, destacando que esses direitos são intransmissíveis e irrenunciáveis, não podendo sofrer limitações voluntárias. Também aborda a proteção do corpo, do nome, do pseudônimo e da imagem das pessoas, proibindo o uso não autorizado em publicações, propaganda comercial ou exposições que possam prejudicar a honra ou a reputação. Além disso, destaca a inviolabilidade da vida privada e a possibilidade de requerer medidas para impedir atos contrários a essa norma.", "O documento trata da ausência de uma pessoa do seu domicílio, sem notícias, e da nomeação de um curador para administrar seus bens. O juiz pode declarar a ausência e nomear um curador a pedido de interessados ou do Ministério Público. O cônjuge do ausente, se não estiver separado judicialmente, é o curador legítimo, seguido pelos pais e descendentes. Em falta destes, o juiz escolhe o curador. O curador terá poderes e obrigações fixados pelo juiz, seguindo as regras aplicáveis aos tutores e curadores.", "O documento trata da sucessão provisória em caso de ausência de uma pessoa. Após um ano da arrecadação dos bens do ausente, ou três anos se houver representante ou procurador, os interessados podem requerer a abertura provisória da sucessão. A sentença que determinar a abertura da sucessão provisória só produzirá efeito após 180 dias de sua publicação. Os herdeiros devem dar garantias da restituição dos bens do ausente para se imitirem na posse. Os sucessores provisórios representam ativa e passivamente o ausente e ficam responsáveis pelos frutos e rendimentos dos bens. Se o ausente aparecer, perde sua parte nos frutos e rendimentos. Se a época exata do falecimento do ausente for provada durante a posse provisória, a sucessão é aberta em favor dos herdeiros naquela data. Se o ausente aparecer depois da posse provisória, os sucessores devem tomar medidas assecuratórias até a entrega dos bens.", "O texto trata da sucessão definitiva em casos de ausência de uma pessoa. Após dez anos da abertura da sucessão provisória, os interessados podem requerer a sucessão definitiva e o levantamento das cauções prestadas. Também é possível solicitar a sucessão definitiva se o ausente tiver oitenta anos de idade e não houver notícias dele nos últimos cinco anos. Caso o ausente ou seus descendentes/regressarem nos dez anos seguintes à abertura da sucessão definitiva, terão direito apenas aos bens existentes naquele momento. Se ninguém promover a sucessão definitiva nesse período, os bens arrecadados passarão para o domínio público.", "O documento apresenta as disposições gerais sobre pessoas jurídicas, dividindo-as em pessoas jurídicas de direito público interno, de direito público externo e de direito privado. São listadas as entidades que se enquadram em cada categoria, bem como as responsabilidades civis das pessoas jurídicas de direito público interno. Além disso, são detalhados os requisitos para a criação e funcionamento das pessoas jurídicas de direito privado, incluindo a inscrição no registro, a responsabilidade dos administradores, a possibilidade de realização de assembleias gerais por meio eletrônico e a autonomia patrimonial. Também são abordadas questões como a possibilidade de desconsideração da personalidade jurídica em casos de abuso, a dissolução e liquidação das pessoas jurídicas, e a aplicação da proteção dos direitos da personalidade às pessoas jurídicas.", "O documento trata das associações, que são constituídas pela união de pessoas para fins não econômicos. O estatuto das associações deve conter informações como denominação, fins, sede, requisitos para admissão e exclusão de associados, direitos e deveres dos associados, fontes de recursos, modo de constituição dos órgãos deliberativos, condições para alteração estatutária e dissolução, forma de gestão administrativa, entre outros. Os associados devem ter iguais direitos, mas o estatuto pode instituir categorias com vantagens especiais. A exclusão de associados só é permitida com justa causa e após procedimento que garanta direito de defesa e recurso. A assembléia geral tem competência para destituir administradores e alterar o estatuto, com quorum e critérios estabelecidos no estatuto. A convocação dos órgãos deliberativos deve seguir o estatuto, com direito de 1/5 dos associados de promovê-la. Em caso de dissolução da associação, o remanescente do patrimônio líquido pode ser destinado a entidades de fins não econômicos designadas no estatuto ou por deliberação dos associados. Se não houver entidade indicada, o patrimônio remanescente será devolvido à Fazenda do Estado, Distrito Federal ou União.", "O documento trata das regras para a criação e funcionamento de fundações, estabelecendo que o instituidor deve fazer uma dotação especial de bens livres por escritura pública ou testamento, especificando o fim a que se destina. As fundações só podem ser constituídas para determinados fins, como assistência social, cultura, educação, saúde, entre outros. O Ministério Público é responsável por fiscalizar as fundações, velando por elas e acompanhando eventuais alterações estatutárias. Em caso de extinção da fundação, o patrimônio pode ser incorporado em outra fundação com fins semelhantes.", "O documento trata do domicílio das pessoas naturais e jurídicas, estabelecendo que o domicílio da pessoa natural é o lugar onde ela estabelece residência com ânimo definitivo, podendo ser considerado qualquer lugar onde viva alternadamente. Para as pessoas jurídicas, o domicílio é determinado de acordo com o tipo de entidade. Além disso, são estabelecidos domicílios necessários para certas categorias de pessoas, como incapazes, servidores públicos, militares, marítimos e presos. O documento também aborda a possibilidade de especificar domicílio em contratos escritos e a questão do agente diplomático do Brasil citado no exterior.", "O Livro II do Código Civil trata dos bens, especificamente dos bens imóveis. De acordo com o artigo 79, são considerados bens imóveis o solo e tudo o que se incorporar a ele natural ou artificialmente. O artigo 80 lista os direitos reais sobre imóveis e as ações que os asseguram como bens imóveis para efeitos legais, assim como o direito à sucessão aberta. O artigo 81 estabelece que as edificações separadas do solo, mas mantendo sua unidade, e os materiais temporariamente separados de um prédio e reempregados nele, não perdem o caráter de imóveis.", "O Livro II do Código Civil trata dos bens, especificamente das diferentes classes de bens. No Capítulo I, na Seção II, são abordados os bens móveis. De acordo com o artigo 82, os bens móveis são aqueles que podem se mover por conta própria ou serem removidos por força externa sem alterar sua substância ou destinação econômico-social. O artigo 83 lista o que é considerado móvel para efeitos legais, incluindo energias com valor econômico, direitos reais sobre objetos móveis e direitos pessoais de caráter patrimonial. Já o artigo 84 estabelece que materiais destinados à construção mantêm sua qualidade de móveis até serem utilizados, e materiais provenientes da demolição de um prédio recuperam essa qualidade.", "O Livro II do Código Civil trata dos bens, especificamente das diferentes classes de bens. Na Seção III, que aborda os bens fungíveis e consumíveis, o artigo 85 define os bens fungíveis como móveis que podem ser substituídos por outros da mesma espécie, qualidade e quantidade. Já o artigo 86 define os bens consumíveis como móveis cujo uso resulta na destruição imediata da própria substância, incluindo aqueles destinados à alienação.", "O Livro II do Código Civil trata dos bens, sendo que os bens divisíveis são aqueles que podem ser fracionados sem alteração na sua substância, diminuição considerável de valor, ou prejuízo do uso a que se destinam. Os bens naturalmente divisíveis podem tornar-se indivisíveis por determinação da lei ou por vontade das partes.", "O documento trata das diferentes classes de bens, especificamente dos bens singulares e coletivos. Bens singulares são aqueles que, mesmo reunidos, são considerados independentes dos demais, enquanto a universalidade de fato é a pluralidade de bens singulares pertencentes à mesma pessoa com destinação unitária. Já a universalidade de direito é o conjunto de relações jurídicas de uma pessoa com valor econômico.", "O Livro II trata dos bens, especificamente das diferentes classes de bens. O Capítulo II aborda os bens reciprocamente considerados, definindo o principal como aquele que existe sobre si, abstrata ou concretamente, e o acessório como aquele cuja existência supõe a do principal. São consideradas pertenças os bens destinados, de modo duradouro, ao uso, serviço ou aformoseamento de outro. Os negócios jurídicos relacionados ao bem principal não abrangem as pertenças, a menos que a lei, a manifestação de vontade ou as circunstâncias do caso determinem o contrário. Os frutos e produtos, mesmo não separados do bem principal, podem ser objeto de negócio jurídico. As benfeitorias podem ser voluptuárias, úteis ou necessárias, sendo as primeiras de mero deleite, as segundas que facilitam o uso do bem e as últimas que têm por objetivo conservar o bem. Não são consideradas benfeitorias os melhoramentos ou acréscimos ao bem sem a intervenção do proprietário, possuidor ou detentor.", "O documento trata dos bens públicos, que são aqueles pertencentes às pessoas jurídicas de direito público interno. São classificados em bens de uso comum do povo, de uso especial e dominicais. Os bens de uso comum do povo, como rios, mares, estradas, ruas e praças, são inalienáveis, assim como os de uso especial, destinados a serviços públicos. Já os bens dominicais, que constituem o patrimônio das pessoas jurídicas de direito público, podem ser alienados. Os bens públicos não estão sujeitos a usucapião e o uso comum dos mesmos pode ser gratuito ou retribuído, conforme estabelecido por lei.", "O Livro III trata dos Fatos Jurídicos, com foco no Negócio Jurídico. O Capítulo I aborda as Disposições Gerais, destacando que a validade do negócio jurídico requer agente capaz, objeto lícito, possível, determinado ou determinável, e forma prescrita ou não defesa em lei. Também menciona que a incapacidade relativa de uma das partes não pode ser invocada pela outra em benefício próprio. Além disso, destaca que a manifestação de vontade subsiste mesmo que o autor tenha feito reserva mental, e que o silêncio pode importar anuência em certas circunstâncias. A interpretação do negócio jurídico deve ser feita conforme a boa-fé e os usos do lugar de sua celebração, com regras específicas para interpretação e preenchimento de lacunas. Os negócios jurídicos benéficos e a renúncia devem ser interpretados estritamente.", "O Livro III trata dos Fatos Jurídicos, com o Título I abordando o Negócio Jurídico e o Capítulo II tratando da Representação. Os poderes de representação podem ser conferidos por lei ou pelo interessado, e a manifestação de vontade do representante dentro dos limites de seus poderes produz efeitos em relação ao representado. É anulável o negócio jurídico celebrado pelo representante consigo mesmo, salvo se permitido por lei ou pelo representado. O representante deve provar sua qualidade e a extensão de seus poderes às pessoas com quem trata em nome do representado, sob pena de responder por atos que excedam tais poderes. O negócio concluído em conflito de interesses com o representado é anulável, com prazo de cento e oitenta dias para pleitear a anulação. Os requisitos e efeitos da representação legal seguem as normas respectivas, enquanto os da representação voluntária seguem a Parte Especial do Código.", "O Livro III, Título I, Capítulo III do Código Civil trata da condição, do termo e do encargo nos negócios jurídicos. O artigo 121 define condição como uma cláusula que subordina o efeito do negócio jurídico a um evento futuro e incerto. O artigo 122 estabelece que as condições devem ser lícitas e não contrárias à lei, à ordem pública ou aos bons costumes. O artigo 123 lista as condições que invalidam os negócios jurídicos, como as impossíveis, ilícitas ou incompreensíveis. Os artigos 124 a 137 tratam da aplicação e efeitos das condições, termos e encargos nos negócios jurídicos. Por exemplo, o artigo 131 diz que o termo inicial suspende o exercício, mas não a aquisição do direito, e o artigo 136 estabelece que o encargo não suspende a aquisição do direito, a menos que seja imposto como condição suspensiva.", "O Livro III trata dos Fatos Jurídicos, com destaque para o Título I, que aborda o Negócio Jurídico. No Capítulo IV, são discutidos os Defeitos do Negócio Jurídico, com foco na Seção I, que trata do Erro ou Ignorância. Os artigos 138 a 144 abordam as situações em que os negócios jurídicos podem ser anuláveis devido a erro substancial, falso motivo, transmissão errônea da vontade, erro de indicação da pessoa ou coisa, erro de cálculo, e a possibilidade de retificação da declaração de vontade. O erro não prejudica a validade do negócio jurídico se a pessoa a quem a manifestação de vontade se dirige se oferecer para executá-la conforme a vontade real do manifestante.", "O texto trata dos defeitos do negócio jurídico relacionados ao dolo. O dolo pode levar à anulação do negócio jurídico quando for a sua causa. O dolo acidental obriga apenas à satisfação das perdas e danos. O silêncio intencional de uma das partes em relação a um fato ou qualidade que a outra parte desconhecia pode configurar dolo. O negócio jurídico também pode ser anulado por dolo de terceiro, desde que a parte beneficiada tenha conhecimento ou deveria ter conhecimento. O dolo do representante legal de uma das partes só obriga o representado a responder até o valor do proveito obtido. Se ambas as partes agirem com dolo, nenhuma delas pode alegá-lo para anular o negócio ou exigir indenização.", "O documento trata dos defeitos do negócio jurídico relacionados à coação. Para que a declaração da vontade seja viciada, a coação deve incutir ao paciente um fundado temor de dano iminente e considerável à sua pessoa, família ou bens. O juiz decidirá se houve coação caso a pessoa afetada não pertença à família do paciente. Ao analisar a coação, são levados em conta diversos fatores, como sexo, idade, condição, saúde e temperamento do paciente. Não se considera coação a ameaça do exercício normal de um direito ou o simples temor reverencial. Caso a coação seja exercida por terceiro e a parte beneficiada tenha conhecimento, esta responderá solidariamente por perdas e danos. Se a coação decorrer de terceiro sem conhecimento da parte beneficiada, o negócio jurídico subsistirá, mas o autor da coação será responsável por todas as perdas e danos causados ao coacto.", "O estado de perigo é configurado quando alguém, pressionado pela necessidade de se salvar ou salvar um membro de sua família de um grave dano conhecido pela outra parte, assume uma obrigação excessivamente onerosa. No caso de envolver uma pessoa que não faça parte da família do declarante, o juiz decidirá de acordo com as circunstâncias.", "O artigo 157 do Livro III, Título I, Capítulo IV, Seção V do Código Civil trata da lesão no negócio jurídico, que ocorre quando uma pessoa, por necessidade ou inexperiência, se compromete a uma prestação desproporcional ao valor da prestação recebida. A desproporção é avaliada com base nos valores vigentes no momento da celebração do negócio. A anulação do negócio não será decretada se for oferecido um suplemento suficiente ou se a parte favorecida concordar com a redução do benefício.", "O documento trata dos defeitos do negócio jurídico, especificamente da fraude contra credores. Segundo o artigo 158, os negócios de transmissão gratuita de bens ou remissão de dívida feitos por um devedor insolvente podem ser anulados pelos credores quirografários. O artigo 159 também prevê a anulação de contratos onerosos do devedor insolvente. O artigo 160 estabelece que o adquirente dos bens do devedor insolvente pode se desobrigar depositando o preço em juízo. A ação para anulação dos negócios fraudulentos pode ser intentada contra o devedor insolvente, a pessoa que celebrou a estipulação fraudulenta ou terceiros adquirentes de má-fé. O documento também aborda a obrigação do credor quirografário de repor o pagamento recebido do devedor insolvente e a presunção de fraude nas garantias de dívidas dadas pelo devedor insolvente. No entanto, os negócios ordinários necessários para a manutenção do estabelecimento do devedor ou sua subsistência são considerados válidos. A vantagem resultante da anulação dos negócios fraudulentos reverte para o acervo de credores.", "O Livro III trata dos Fatos Jurídicos, com destaque para o Título I, que aborda o Negócio Jurídico. O Capítulo V trata da Invalidade do Negócio Jurídico, estabelecendo que o negócio jurídico é nulo em diversas situações, como quando celebrado por pessoa absolutamente incapaz, quando for ilícito, impossível ou indeterminável o seu objeto, entre outros casos. Também aborda a simulação nos negócios jurídicos e as possibilidades de anulação, confirmação e prazos para pleitear a anulação. Além disso, destaca a importância de respeitar a intenção das partes e as consequências da invalidade parcial de um negócio jurídico.", "O Livro III trata dos Fatos Jurídicos, mais especificamente no Título II sobre os Atos Jurídicos Lícitos. O artigo 185 estabelece que aos atos jurídicos lícitos que não sejam negócios jurídicos, aplicam-se, no que couber, as disposições do Título anterior.", "O Livro III trata dos Fatos Jurídicos, com o Título III abordando os Atos Ilícitos. O artigo 186 define que comete ato ilícito aquele que, por ação ou omissão voluntária, negligência ou imprudência, violar direito e causar dano a outrem. O artigo 187 estabelece que também comete ato ilícito o titular de um direito que excede manifestamente os limites impostos pelo seu fim econômico ou social, pela boa-fé ou pelos bons costumes ao exercê-lo. O artigo 188 lista as situações que não constituem atos ilícitos, como os praticados em legítima defesa ou no exercício regular de um direito reconhecido, e a deterioração ou destruição da coisa alheia para remover perigo iminente, desde que absolutamente necessário e sem exceder os limites do indispensável para a remoção do perigo.", "O Livro III trata dos Fatos Jurídicos, mais especificamente do Título IV que aborda a Prescrição e a Decadência. No Capítulo I, que trata da Prescrição, na Seção I, são apresentadas as Disposições Gerais. O artigo 189 estabelece que, uma vez violado o direito, nasce para o titular a pretensão, que se extingue pela prescrição nos prazos estabelecidos nos artigos 205 e 206. O artigo 190 determina que a exceção prescreve no mesmo prazo da pretensão. O artigo 191 fala sobre a renúncia da prescrição, que pode ser expressa ou tácita, e só valerá após a consumação da prescrição. O artigo 192 estabelece que os prazos de prescrição não podem ser alterados por acordo das partes. O artigo 193 permite que a prescrição seja alegada em qualquer instância judicial pela parte a quem beneficia. O artigo 195 estabelece que os relativamente incapazes e as pessoas jurídicas têm ação contra seus assistentes ou representantes legais que derem causa à prescrição ou não a alegarem oportunamente. O artigo 196 determina que a prescrição iniciada contra uma pessoa continua a correr contra seu sucessor. O artigo 194 foi revogado pela Lei nº 11.280, de 2006.", "O documento trata das causas que impedem ou suspendem a prescrição, listando diversas situações em que a prescrição não corre, como entre cônjuges, ascendentes e descendentes, tutelados e curatelados, incapazes, ausentes do país em serviço público, servindo nas Forças Armadas em tempo de guerra, pendendo condição suspensiva, não estando vencido o prazo, pendendo ação de evicção e quando a ação se originar de fato que deva ser apurado no juízo criminal. Também menciona que, se a prescrição for suspensa em favor de um dos credores solidários, só aproveitam os outros se a obrigação for indivisível.", "O documento trata da prescrição no direito civil, especificamente das causas que interrompem a prescrição. A interrupção da prescrição pode ocorrer por despacho do juiz, protesto, protesto cambial, apresentação do título de crédito em juízo, ato judicial que constitua em mora o devedor, ou ato inequívoco que importe reconhecimento do direito pelo devedor. A prescrição interrompida recomeça a correr a partir da data do ato que a interrompeu. A prescrição pode ser interrompida por qualquer interessado, mas a interrupção por um credor não beneficia os outros credores. No entanto, a interrupção por um dos credores solidários beneficia os outros, assim como a interrupção contra o devedor solidário envolve os demais coobrigados. A interrupção contra um dos herdeiros do devedor solidário não prejudica os outros herdeiros, a menos que se trate de obrigações e direitos indivisíveis. A interrupção produzida contra o principal devedor prejudica o fiador.", "O Livro III, Título IV, Capítulo I do Código Civil trata da prescrição, estabelecendo que a prescrição ocorre em dez anos quando a lei não fixar prazo menor. O artigo 206 lista os prazos de prescrição para diferentes situações, como um ano para pretensões de hospedeiros, segurados, tabeliães, entre outros. O artigo 206-A trata da prescrição intercorrente, que segue o mesmo prazo da pretensão, com exceções previstas no Código de Processo Civil.", "O Capítulo II do Título IV do Livro III trata da decadência no direito civil. O artigo 207 estabelece que as normas que impedem, suspendem ou interrompem a prescrição não se aplicam à decadência, a menos que haja disposição legal em contrário. O artigo 208 determina que se aplica à decadência o disposto nos artigos 195 e 198, inciso I. O artigo 209 estabelece que é nula a renúncia à decadência fixada em lei. O artigo 210 determina que o juiz deve conhecer da decadência de ofício, quando estabelecida por lei. Por fim, o artigo 211 estabelece que se a decadência for convencional, a parte a quem aproveita pode alegá-la em qualquer grau de jurisdição, mas o juiz não pode suprir a alegação.", "O documento descreve os diferentes meios de prova de fatos jurídicos, como confissão, documento, testemunha, presunção e perícia. Também aborda a eficácia da confissão, os requisitos da escritura pública, a força probante de certidões e traslados, a validade de instrumentos particulares, a autenticidade de telegramas e cópias fotográficas, a tradução de documentos em língua estrangeira, a prova por reproduções mecânicas ou eletrônicas, a prova resultante de livros e fichas empresariais, a admissibilidade da prova testemunhal, e as restrições para testemunhas, incluindo menores de dezesseis anos, partes interessadas no litígio, cônjuges, ascendentes, descendentes e colaterais até o terceiro grau. Também menciona a recusa a exames médicos como forma de suprir a prova pretendida.", "O texto trata das obrigações de dar coisa certa, abordando situações em que a coisa se perde antes da tradição, se deteriora, ou se a obrigação é de restituir a coisa. Define as responsabilidades do devedor e do credor em cada caso, incluindo a possibilidade de resolver a obrigação, exigir o equivalente, aceitar a coisa no estado em que se encontra, entre outras medidas. Também menciona a questão dos frutos percebidos e dos melhoramentos ou acréscimos à coisa.", "O documento trata das obrigações de dar coisa incerta, onde a coisa deve ser indicada pelo menos pelo gênero e quantidade. O devedor tem o direito de escolher a coisa, desde que não seja pior do que a prometida, e não será obrigado a entregar a melhor. Após a escolha, o credor deve ser informado e as regras da seção anterior se aplicam. O devedor não pode alegar perda ou deterioração da coisa antes da escolha, mesmo que por força maior ou caso fortuito.", "O texto trata das obrigações de fazer, onde o devedor que recusar a prestação imposta ou que seja só por ele exequível incorre na obrigação de indenizar perdas e danos. Se a prestação do fato tornar-se impossível sem culpa do devedor, a obrigação se resolve, mas se for por culpa dele, ele responderá por perdas e danos. Se o fato puder ser executado por terceiro, o credor pode mandá-lo executar à custa do devedor, com possibilidade de ressarcimento em caso de urgência.", "Os artigos 250 e 251 do Livro I, Título I, Capítulo III do Direito das Obrigações tratam das obrigações de não fazer. O artigo 250 estabelece que a obrigação de não fazer se extingue caso se torne impossível para o devedor abster-se do ato que se comprometeu a não praticar, sem culpa sua. Já o artigo 251 determina que, caso o devedor pratique o ato ao qual se comprometeu a não fazer, o credor pode exigir que ele desfaça o ato, sob pena de fazê-lo às suas custas e ressarcir os prejuízos causados. Em casos de urgência, o credor pode desfazer ou mandar desfazer o ato, sem autorização judicial, e ainda ter direito ao ressarcimento devido.", "O texto trata das obrigações alternativas, onde o devedor tem o direito de escolher entre duas prestações. Caso uma das prestações não possa ser cumprida, o débito permanece em relação à outra. Se nenhuma das prestações puder ser cumprida por culpa do devedor, ele será obrigado a pagar o valor da última prestação impossibilitada, mais perdas e danos. Se a escolha couber ao credor e uma das prestações se tornar impossível por culpa do devedor, o credor poderá exigir a prestação subsistente ou o valor da outra, com perdas e danos. Se todas as prestações se tornarem impossíveis sem culpa do devedor, a obrigação será extinta.", "O texto trata das obrigações divisíveis e indivisíveis. Uma obrigação é divisível quando a prestação pode ser dividida entre os devedores ou credores, enquanto uma obrigação é indivisível quando a prestação não pode ser dividida. Se a prestação não for divisível e houver mais de um devedor, cada um será responsável pela dívida toda. Se um dos credores receber a prestação por inteiro, os outros credores têm o direito de exigir dele a parte que lhes cabe. A obrigação indivisível pode perder essa característica se for resolvida em perdas e danos, e a responsabilidade por essas perdas e danos pode ser dividida entre os devedores, dependendo da culpa de cada um.", "O documento trata das obrigações solidárias, onde mais de um credor ou devedor concorre na mesma obrigação, cada um com direito ou obrigação à dívida toda. A solidariedade não é presumida e pode resultar da lei ou da vontade das partes. A obrigação solidária pode ser pura e simples para um dos co-credores ou co-devedores, e condicional, a prazo, ou pagável em lugar diferente para o outro.", "O texto trata das obrigações solidárias, onde cada credor solidário tem direito a exigir do devedor o cumprimento da prestação por inteiro. Enquanto alguns credores não demandarem o devedor, este pode pagar a qualquer um deles. O pagamento feito a um dos credores extingue a dívida até o montante pago. Em caso de falecimento de um dos credores, seus herdeiros só podem exigir a quota correspondente ao seu quinhão hereditário, salvo se a obrigação for indivisível. A solidariedade subsiste em caso de conversão da prestação em perdas e danos. O credor que remitir a dívida ou receber o pagamento responderá aos outros pela parte que lhes cabe. O devedor não pode opor exceções pessoais a um dos credores solidários. O julgamento contrário a um credor não afeta os demais, mas o favorável beneficia a todos, sem prejuízo de exceções pessoais que o devedor possa invocar.", "O documento trata das obrigações solidárias, onde o credor tem o direito de exigir o pagamento parcial ou total da dívida comum de um ou alguns dos devedores, mantendo os demais obrigados solidariamente pelo restante. Caso um dos devedores solidários faleça deixando herdeiros, estes só serão obrigados a pagar a quota correspondente ao seu quinhão hereditário, a menos que a obrigação seja indivisível. Pagamentos parciais feitos por um devedor e remissões obtidas por ele não beneficiam os outros devedores, exceto até o valor pago ou relevado. Cláusulas adicionais entre um devedor e o credor não podem prejudicar os outros devedores sem o consentimento destes. Todos os devedores respondem pelos juros da mora, mesmo que a ação seja proposta apenas contra um deles. O devedor que paga a dívida por inteiro tem o direito de exigir a quota de cada co-devedor, dividindo igualmente a parte do insolvente, se houver. Em caso de rateio entre os co-devedores, os exonerados da solidariedade também contribuirão pela parte que cabia ao insolvente. Se a dívida solidária interessar exclusivamente a um dos devedores, este responderá por toda ela para quem pagar.", "O documento trata da cessão de crédito, onde o credor pode transferir seu crédito para outra pessoa, desde que não haja proibição na natureza da obrigação, na lei ou na convenção com o devedor. A cessão deve ser feita por instrumento público ou particular com as devidas formalidades. O cessionário tem direito de fazer averbar a cessão no registro do imóvel em caso de crédito hipotecário. O devedor deve ser notificado da cessão para que tenha eficácia, mas mesmo sem notificação, o cessionário pode exercer atos conservatórios do direito cedido. O cedente pode ser responsabilizado pela existência do crédito ao tempo da cessão, e em caso de cessão onerosa, pode ser responsável pela solvência do devedor. O cedente não responde pela solvência do devedor, a menos que haja estipulação em contrário. O crédito penhorado não pode mais ser transferido pelo credor que teve conhecimento da penhora.", "O Capítulo II do Título II do Livro I trata da Assunção de Dívida, onde é permitido a um terceiro assumir a obrigação do devedor com o consentimento expresso do credor, exonerando o devedor primitivo, exceto se este era insolvente e o credor não sabia. Caso o devedor primitivo não consinta, as garantias especiais por ele dadas ao credor são extintas. Se a substituição do devedor for anulada, o débito é restaurado, exceto as garantias prestadas por terceiros que não conheciam o vício. O novo devedor não pode opor exceções pessoais ao credor e o adquirente de imóvel hipotecado pode assumir o pagamento do crédito garantido, desde que o credor não se oponha em trinta dias.", "O texto trata do pagamento das obrigações, destacando que qualquer interessado na extinção da dívida pode pagá-la, desde que utilize meios que levem à exoneração do devedor. O terceiro não interessado que paga a dívida em seu próprio nome tem direito a reembolso, mas não se sub-roga nos direitos do credor. Se o pagamento for feito antes do vencimento, o terceiro só terá direito ao reembolso no vencimento. O pagamento feito por terceiro, com desconhecimento ou oposição do devedor, não obriga a reembolsar aquele que pagou, se o devedor poderia ter evitado a ação. Além disso, o pagamento só terá eficácia se houver transmissão da propriedade, e se for feito por alguém que possa alienar o objeto do pagamento. Se o pagamento for feito com uma coisa fungível e o credor a consumir de boa-fé, mesmo que o solvente não tivesse o direito de aliená-la, não poderá mais ser reclamada.", "O texto apresenta os artigos 308 a 312 do Livro I, que trata do Direito das Obrigações, especificamente do Pagamento. O artigo 308 estabelece que o pagamento deve ser feito ao credor ou a quem o represente, sob pena de só valer depois de ratificado pelo credor. O artigo 309 afirma que o pagamento feito de boa-fé ao credor putativo é válido, mesmo que depois se prove que não era credor. O artigo 310 determina que o pagamento feito a um credor incapaz de quitar não vale, a menos que o devedor prove que reverteu em benefício do credor. O artigo 311 estabelece que o portador da quitação está autorizado a receber o pagamento, a menos que as circunstâncias contrariem essa presunção. Por fim, o artigo 312 diz que se o devedor pagar ao credor apesar de uma penhora ou impugnação, o pagamento não valerá contra terceiros, que poderão exigir o pagamento novamente do devedor.", "O documento trata do pagamento das obrigações, estabelecendo que o credor não é obrigado a receber prestação diversa da que lhe é devida, nem a receber por partes se não houver acordo. Também aborda a forma de pagamento das dívidas em dinheiro, a possibilidade de aumento progressivo de prestações sucessivas, a correção de desproporção entre o valor da prestação devida e o momento da execução, a nulidade de convenções de pagamento em ouro ou moeda estrangeira, o direito do devedor a quitação regular, a presunção de pagamento dos juros se a quitação do capital for sem reserva, entre outros pontos relacionados ao objeto do pagamento e sua prova.", "O documento trata do pagamento das obrigações, especificando que o pagamento deve ser feito no domicílio do devedor, a menos que as partes tenham acordado de outra forma ou que a lei, a natureza da obrigação ou as circunstâncias determinem o contrário. Se houver mais de um local designado para o pagamento, cabe ao credor escolher entre eles. Se o pagamento envolver a transferência de um imóvel, este deve ser feito no local onde o bem está situado. Em casos excepcionais, o devedor pode efetuar o pagamento em outro local, desde que haja um motivo grave para isso, sem prejudicar o credor. Além disso, se o pagamento for feito repetidamente em outro local, presume-se que o credor renunciou ao local previsto no contrato.", "O texto trata do pagamento das obrigações, estabelecendo que, salvo disposição em contrário, o credor pode exigir o pagamento imediatamente caso não tenha sido ajustada uma data específica. Também aborda o cumprimento das obrigações condicionais na data do implemento da condição, com a responsabilidade do credor de provar que o devedor tinha conhecimento. Além disso, o credor tem o direito de cobrar a dívida antes do prazo estipulado em casos como falência do devedor, penhora dos bens em execução por outro credor ou insuficiência das garantias do débito. Em casos de solidariedade passiva, o débito não será considerado vencido para os outros devedores solventes.", "O documento trata do pagamento em consignação, que consiste no depósito judicial ou em estabelecimento bancário da coisa devida nos casos e forma legais. A consignação tem lugar em diversas situações, como quando o credor não pode ou recusa receber o pagamento, quando há dúvida sobre quem deve receber o pagamento, ou quando há litígio sobre o objeto do pagamento. Para que a consignação tenha força de pagamento, é necessário que todos os requisitos em relação às pessoas, ao objeto, modo e tempo sejam cumpridos. O depósito deve ser requerido no lugar do pagamento, e enquanto o credor não aceitar ou impugnar o depósito, o devedor pode requerer o levantamento. Se o depósito for julgado procedente, o devedor não poderá levantá-lo sem o consentimento dos outros devedores e fiadores. As despesas com o depósito correm à conta do credor se for julgado procedente, e à conta do devedor se for julgado improcedente. O devedor de obrigação litigiosa pode se exonerar mediante consignação, mas assume o risco do pagamento se pagar a qualquer dos pretendidos credores tendo conhecimento do litígio. Em caso de litígio entre credores que se pretendem mutuamente excluir, qualquer um deles pode requerer a consignação.", "O documento trata da sub-rogação no pagamento de dívidas, onde o credor que paga a dívida do devedor comum, o adquirente do imóvel hipotecado que paga o credor hipotecário e o terceiro interessado que paga a dívida pela qual era ou podia ser obrigado, têm direito à sub-rogação. A sub-rogação pode ser convencional, quando o credor transfere seus direitos a terceiro que efetuou o pagamento, ou quando terceira pessoa empresta ao devedor a quantia para pagar a dívida sob a condição de ficar sub-rogado nos direitos do credor. A sub-rogação transfere ao novo credor todos os direitos, ações, privilégios e garantias do primitivo em relação à dívida. Na sub-rogação legal, o sub-rogado só pode exercer os direitos do credor até o valor que desembolsou para desobrigar o devedor. O credor originário terá preferência na cobrança da dívida restante se os bens do devedor não forem suficientes para saldar a dívida.", "O texto trata da imputação do pagamento em caso de múltiplas dívidas da mesma natureza para um único credor. O devedor tem o direito de indicar a qual dívida quer realizar o pagamento, desde que todas sejam líquidas e vencidas. Caso não indique, o pagamento será imputado primeiro nos juros vencidos e depois no capital, a menos que haja estipulação em contrário. Se a quitação for omissa quanto à imputação, esta será feita nas dívidas líquidas e vencidas em primeiro lugar, ou na mais onerosa se todas forem líquidas e vencidas ao mesmo tempo.", "O documento trata do direito das obrigações, especificamente do adimplemento e extinção das obrigações através da dação em pagamento. O credor pode concordar em receber uma prestação diferente daquela devida, e se a coisa dada em pagamento tiver um preço determinado, as relações entre as partes serão regidas pelas normas do contrato de compra e venda. Se a coisa dada em pagamento for um título de crédito, a transferência implicará em cessão. Caso o credor seja desapossado da coisa recebida em pagamento, a obrigação original será restabelecida, anulando a quitação dada, exceto pelos direitos de terceiros.", "O texto trata da novação, que é a substituição de uma obrigação por outra, extinguindo a primeira. Isso pode ocorrer de três formas: quando o devedor contrai uma nova dívida com o credor para substituir a anterior, quando um novo devedor sucede ao antigo ou quando um novo credor substitui o antigo. A novação pode ser feita sem o consentimento do devedor e, se o novo devedor for insolvente, o credor não pode acionar o antigo devedor, a menos que este tenha agido de má-fé. A novação extingue os acessórios e garantias da dívida, exceto se houver estipulação em contrário. Além disso, a novação exonera os fiadores e não pode ser feita em obrigações nulas ou extintas.", "O capítulo VII do Livro I do Direito das Obrigações trata da compensação, que ocorre quando duas pessoas são credoras e devedoras uma da outra, extinguindo-se as obrigações até onde se compensarem. A compensação efetua-se entre dívidas líquidas, vencidas e de coisas fungíveis, desde que sejam do mesmo gênero e não diferem na qualidade especificada no contrato. Existem exceções para a compensação, como em casos de esbulho, furto, roubo, comodato, depósito, alimentos ou quando uma dívida é de coisa não suscetível de penhora. Não haverá compensação se as partes a excluírem por mútuo acordo ou renúncia prévia de uma delas. Também são abordadas questões relacionadas à cessão de crédito e à imputação do pagamento. A compensação não é admitida em prejuízo de direito de terceiro, e o devedor não pode opor ao exequente a compensação se tornar credor do seu credor depois de penhorado o crédito deste.", "O documento trata da confusão, que é a extinção da obrigação quando as qualidades de credor e devedor se confundem na mesma pessoa. A confusão pode ocorrer em relação a toda a dívida ou apenas parte dela. Quando a confusão ocorre em um credor ou devedor solidário, a obrigação é extinta apenas até a concorrência da respectiva parte no crédito ou na dívida, mantendo-se a solidariedade para o restante. Após o fim da confusão, a obrigação anterior é restabelecida com todos os seus acessórios.", "O Título III do Livro I trata do Adimplemento e Extinção das Obrigações, e o Capítulo IX aborda a Remissão das Dívidas. O artigo 385 estabelece que a remissão da dívida, aceita pelo devedor, extingue a obrigação, sem prejuízo de terceiros. O artigo 386 diz que a devolução voluntária do título da obrigação, por escrito particular, desonera o devedor e seus co-obrigados. Já o artigo 387 afirma que a restituição voluntária do objeto empenhado prova a renúncia do credor à garantia real. Por fim, o artigo 388 estabelece que a remissão concedida a um dos co-devedores extingue a dívida na parte correspondente a ele.", "O Livro I trata do Direito das Obrigações, com o Título IV abordando o Inadimplemento das Obrigações. O Capítulo I traz as Disposições Gerais, onde o devedor que não cumpre a obrigação deve arcar com perdas e danos, juros, atualização monetária e honorários de advogado. Nas obrigações negativas, o devedor é considerado inadimplente desde o momento em que realiza o ato que deveria evitar. Pelo inadimplemento, todos os bens do devedor respondem. Em contratos benéficos, o contratante que se beneficia responde por simples culpa, enquanto no oneroso, ambas as partes respondem por culpa, exceto em casos previstos em lei. O devedor não é responsável por prejuízos causados por caso fortuito ou força maior, a menos que tenha se responsabilizado expressamente. O caso fortuito ou de força maior é um fato necessário cujos efeitos não poderiam ser evitados.", "O documento trata do inadimplemento das obrigações, especificamente da mora. Define-se a mora como a falta de pagamento por parte do devedor ou a recusa do credor em receber o pagamento no tempo, lugar e forma estabelecidos. O devedor em mora é responsável pelos prejuízos causados, juros, atualização monetária e honorários advocatícios. Se a prestação se tornar inútil ao credor devido à mora, ele pode rejeitá-la e exigir perdas e danos. A mora pode ser purgada pelo devedor oferecendo a prestação mais os prejuízos, ou pelo credor aceitando o pagamento até uma determinada data.", "O texto trata das perdas e danos decorrentes do inadimplemento das obrigações. O artigo 402 estabelece que, salvo exceções previstas em lei, as perdas e danos devidas ao credor incluem não apenas o que ele efetivamente perdeu, mas também o que razoavelmente deixou de lucrar. O artigo 403 determina que, mesmo em caso de dolo do devedor, as perdas e danos se limitam aos prejuízos efetivos e lucros cessantes diretos e imediatos. O artigo 404 estabelece que, nas obrigações de pagamento em dinheiro, as perdas e danos devem ser pagas com atualização monetária, incluindo juros, custas e honorários de advogado. O parágrafo único desse artigo permite ao juiz conceder indenização suplementar ao credor se os juros da mora não cobrirem o prejuízo e não houver pena convencional. O artigo 405 determina que os juros de mora devem ser contados a partir da citação inicial.", "O artigo 406 estabelece que, quando os juros moratórios não forem convencionados, serão fixados de acordo com a taxa em vigor para a mora do pagamento de impostos à Fazenda Nacional. Já o artigo 407 determina que o devedor é obrigado a pagar juros de mora, mesmo que não haja alegação de prejuízo, desde que o valor da dívida seja fixado por sentença judicial, arbitramento ou acordo entre as partes.", "O texto trata da cláusula penal, que é uma penalidade estipulada no contrato para o caso de inadimplemento da obrigação. O devedor incorre na cláusula penal se deixar de cumprir a obrigação culposamente ou se constituir em mora. A cláusula penal pode referir-se à inexecução completa da obrigação, a alguma cláusula especial ou simplesmente à mora. O valor da penalidade não pode exceder o da obrigação principal e deve ser reduzido pelo juiz se for manifestamente excessivo. Se a obrigação for indivisível, todos os devedores incorrerão na pena, mas apenas o culpado poderá ser demandado integralmente. Se a obrigação for divisível, apenas o devedor que a infringir incorrerá na pena. O credor não precisa alegar prejuízo para exigir a pena convencional, mas se o prejuízo exceder o previsto, o credor só poderá exigir indenização suplementar se isso tiver sido convencionado.", "O texto trata das arras ou sinal em contratos, onde uma parte dá dinheiro ou outro bem móvel à outra parte como garantia. Se a parte que deu as arras não cumprir o contrato, a outra parte pode considerá-lo desfeito e reter as arras. Se a inexecução for de quem recebeu as arras, a parte que deu as arras pode considerar o contrato desfeito e exigir sua devolução mais o equivalente. A parte inocente pode pedir indenização suplementar se provar maior prejuízo, sendo as arras consideradas como taxa mínima. Se houver direito de arrependimento no contrato, as arras terão função indenizatória e quem as deu as perderá em benefício da outra parte, sem direito a indenização suplementar.", "O documento apresenta disposições gerais sobre contratos, destacando a importância da função social do contrato, da liberdade contratual nos limites da função social, da intervenção mínima e excepcionalidade da revisão contratual. Também aborda a presunção de paridade e simetria nos contratos civis e empresariais, a necessidade de boa-fé e probidade dos contratantes, a interpretação favorável ao aderente em cláusulas ambíguas ou contraditórias, a nulidade de cláusulas que estipulem renúncia antecipada de direitos, a possibilidade de estipular contratos atípicos e a proibição de contrato sobre a herança de pessoa viva.", "O documento apresenta as disposições gerais sobre a formação dos contratos, destacando que a proposta de contrato obriga o proponente, a menos que haja indicação contrária nos termos da proposta, na natureza do negócio ou nas circunstâncias do caso. Deixa de ser obrigatória a proposta se não for imediatamente aceita por uma pessoa presente, se não for respondida dentro do prazo dado a uma pessoa ausente, ou se houver retratação do proponente antes da aceitação. A oferta ao público equivale a proposta, salvo indicação contrária, e pode ser revogada da mesma forma que foi divulgada. A aceitação tardia deve ser comunicada imediatamente ao proponente, sob pena de perdas e danos. A aceitação com adições, restrições ou modificações implica em nova proposta. Contratos entre ausentes tornam-se válidos quando a aceitação é enviada, exceto em casos específicos. O contrato é considerado celebrado no local onde foi proposto.", "O texto trata da estipulação em favor de terceiro nos contratos, onde uma pessoa pode estipular uma obrigação em favor de outra. O terceiro beneficiado pode exigir o cumprimento da obrigação, desde que aceite as condições do contrato. O estipulante pode reservar o direito de substituir o terceiro designado no contrato, sem a necessidade de consentimento do terceiro ou do outro contratante.", "O artigo 439 estabelece que aquele que prometer o fato de um terceiro será responsável por perdas e danos caso o terceiro não cumpra o prometido. O parágrafo único ressalta que essa responsabilidade não existe se o terceiro for o cônjuge do promitente e este concordar com o ato, desde que a indenização recaia sobre os bens do cônjuge. Já o artigo 440 determina que não haverá obrigação para quem se comprometer por outra pessoa se esta não cumprir a prestação após se comprometer.", "O texto trata dos vícios redibitórios em contratos de compra e venda, onde o adquirente pode rejeitar a coisa ou pedir abatimento no preço caso haja defeitos ocultos que a tornem imprópria para o uso ou diminuam seu valor. O alienante é responsável pelos vícios conhecidos por ele, devendo restituir o valor recebido com perdas e danos. O prazo para reclamar a redibição ou abatimento é de trinta dias para bens móveis e um ano para imóveis, contados a partir da entrega efetiva. Em casos de vícios que só podem ser conhecidos posteriormente, o prazo é de até cento e oitenta dias para bens móveis e um ano para imóveis. Em vendas de animais, os prazos de garantia por vícios ocultos são estabelecidos por lei especial ou usos locais. Não correm os prazos de garantia na presença de cláusula de garantia, mas o adquirente deve denunciar o defeito ao alienante dentro de trinta dias após descobri-lo.", "O documento trata da evicção nos contratos onerosos, onde o alienante é responsável por garantir a posse tranquila da coisa vendida. As partes podem reforçar, diminuir ou excluir essa responsabilidade por meio de cláusula expressa. Caso ocorra a evicção, o evicto tem direito a receber o preço pago pela coisa, indenização pelos frutos, despesas, prejuízos, custas judiciais e honorários advocatícios. O valor a ser restituído será proporcional ao desfalque sofrido. O alienante também é responsável pelas benfeitorias necessárias ou úteis não abonadas ao evicto. Em caso de evicção parcial considerável, o evicto pode optar pela rescisão do contrato ou restituição da parte do preço correspondente ao desfalque. O adquirente não pode demandar pela evicção se sabia que a coisa era alheia ou litigiosa.", "Os artigos 458, 459, 460 e 461 do Livro I, Título V, Capítulo I, Seção VII do Código Civil tratam dos contratos aleatórios. Eles estabelecem que, em contratos aleatórios, nos quais o risco de não existência de coisas ou fatos futuros é assumido por uma das partes, o contratante que assumiu o risco tem direito a receber integralmente o que lhe foi prometido, desde que não tenha agido com dolo ou culpa. Além disso, o alienante tem direito a todo o preço acordado, mesmo que a coisa exista em quantidade inferior à esperada. No entanto, se a coisa não existir, o contrato pode ser anulado por dolo.", "O contrato preliminar deve conter todos os requisitos essenciais ao contrato definitivo e pode ser exigida a celebração do contrato definitivo caso não haja cláusula de arrependimento. O contrato preliminar deve ser levado ao registro competente e, caso a parte inadimplente não cumpra o contrato preliminar, a outra parte pode considerá-lo desfeito e pedir perdas e danos. Se a promessa de contrato for unilateral, o credor deve manifestar-se dentro do prazo estipulado ou razoavelmente assinado pelo devedor, caso contrário a promessa fica sem efeito.", "O texto trata do contrato com pessoa a declarar, onde uma das partes reserva-se o direito de indicar a pessoa que deve adquirir os direitos e assumir as obrigações decorrentes do contrato. A indicação deve ser comunicada à outra parte em até cinco dias da conclusão do contrato e a aceitação da pessoa nomeada deve seguir a mesma forma utilizada para o contrato. A pessoa nomeada adquire os direitos e assume as obrigações a partir do momento da celebração do contrato. O contrato será eficaz apenas entre os contratantes originais se não houver indicação de pessoa, se a pessoa nomeada se recusar a aceitar, se era insolvente e a outra parte desconhecia esse fato, ou se a pessoa nomeada era incapaz ou insolvente no momento da nomeação.", "O documento trata do direito das obrigações, especificamente dos contratos em geral. Na seção sobre a extinção do contrato, destaca-se o distrato, que deve ser feito da mesma forma que o contrato original. Além disso, a resilição unilateral, nos casos permitidos pela lei, ocorre por meio de denúncia notificada à outra parte. No entanto, se uma das partes fez investimentos consideráveis para a execução do contrato, a denúncia unilateral só terá efeito após um prazo compatível com tais investimentos.", "O Artigo 474 trata da cláusula resolutiva expressa, que opera de pleno direito, enquanto a tácita depende de interpelação judicial. Já o Artigo 475 estabelece que a parte lesada pelo inadimplemento pode pedir a resolução do contrato ou exigir o cumprimento, cabendo indenização por perdas e danos em ambos os casos.", "O Artigo 476 estabelece que em contratos bilaterais, nenhum dos contratantes pode exigir o cumprimento da obrigação do outro antes de cumprir a sua própria obrigação. Já o Artigo 477 prevê que se uma das partes sofrer uma diminuição em seu patrimônio que comprometa a prestação acordada, a outra parte pode recusar-se a cumprir sua obrigação até que a primeira parte satisfaça a sua obrigação ou forneça garantias suficientes.", "O texto trata da resolução por onerosidade excessiva em contratos de execução continuada ou diferida. O devedor pode pedir a resolução do contrato se a prestação se tornar excessivamente onerosa devido a acontecimentos extraordinários e imprevisíveis. A resolução pode ser evitada se o réu se oferecer a modificar equitativamente as condições do contrato. Se as obrigações couberem apenas a uma das partes, ela pode pleitear a redução da prestação ou a alteração do modo de executá-la para evitar a onerosidade excessiva.", "O contrato de compra e venda é definido como a obrigação de transferir a propriedade de uma coisa em troca de um preço em dinheiro. O contrato é considerado válido quando as partes concordam sobre o objeto e o preço. A compra e venda pode ter como objeto uma coisa atual ou futura, e o contrato pode ser anulado se a coisa futura não vier a existir, a menos que seja um contrato aleatório. O preço pode ser fixado por terceiros, pela taxa de mercado ou por índices objetivamente determináveis. As despesas de escritura e registro são geralmente de responsabilidade do comprador, enquanto as despesas de tradição são do vendedor. Os riscos da coisa correm por conta do vendedor até a tradição, e os riscos do preço por conta do comprador. A tradição da coisa vendida ocorre no local onde ela estava no momento da venda, e se a área de um imóvel vendido não corresponder às dimensões dadas, o comprador tem direito a complemento da área ou a resolução do contrato. O vendedor responde por débitos que gravem a coisa até a tradição, e um condômino em coisa indivisível não pode vender sua parte a estranhos se outro consorte quiser comprar.", "O documento trata das cláusulas especiais à compra e venda, abordando a retrovenda, a venda a contento, a venda sujeita a prova, a preempção ou preferência, a venda com reserva de domínio e a venda sobre documentos. São apresentadas as condições e procedimentos para cada uma dessas situações, incluindo prazos, direitos e obrigações tanto do vendedor quanto do comprador. Também são mencionadas as consequências em caso de descumprimento das cláusulas estabelecidas.", "O artigo 533 do Livro I do Direito das Obrigações trata da troca ou permuta, aplicando as disposições referentes à compra e venda com algumas modificações. Entre elas, está a divisão das despesas do instrumento da troca por metade entre os contratantes, a anulabilidade da troca de valores desiguais entre ascendentes e descendentes sem o consentimento dos outros descendentes e do cônjuge do alienante.", "O contrato estimatório é aquele em que o consignante entrega bens móveis ao consignatário, que pode vendê-los ou restituí-los dentro do prazo estabelecido. O consignatário deve pagar o preço acordado, mesmo que a restituição da coisa se torne impossível. A coisa consignada não pode ser penhorada pelos credores do consignatário até que o preço seja integralmente pago. O consignante não pode dispor da coisa antes de ser restituída ou comunicada a restituição.", "O documento trata das disposições gerais sobre doações, definindo o que é uma doação, as formas de aceitação, os tipos de doações (pura, remuneratória, gravada), as formalidades necessárias para sua validade, as condições especiais para doações a nascituros, incapazes e em contemplação de casamento, as possibilidades de anulação de doações, as obrigações do doador e do donatário, e as consequências em caso de descumprimento dos encargos da doação. Também aborda a nulidade de doações em certas situações específicas, como a doação de todos os bens sem reserva de parte suficiente para a subsistência do doador.", "O documento trata da revogação da doação por ingratidão do donatário ou por inexecução do encargo. São listados os motivos que podem levar à revogação, como atentado contra a vida do doador, ofensa física, injúria grave, entre outros. Também são mencionadas as condições para pleitear a revogação, como prazo de um ano a partir do conhecimento do fato que a autoriza. Além disso, são abordadas questões como a transmissão do direito de revogar, a revogação da doação onerosa por inexecução do encargo, e as situações em que a revogação por ingratidão não se aplica.", "O documento trata da locação de coisas, onde uma das partes se compromete a ceder o uso de uma coisa não fungível à outra parte mediante uma retribuição. O locador deve entregar a coisa em bom estado e garantir o uso pacífico, resguardando o locatário de embaraços de terceiros. O locatário deve usar a coisa conforme acordado, pagar o aluguel pontualmente e restituí-la no mesmo estado. O contrato pode ser rescindido se a coisa for utilizada de forma inadequada ou danificada. O prazo da locação determinada termina automaticamente, mas se o locatário permanecer na posse da coisa, presume-se a prorrogação do contrato. Em caso de alienação da coisa, o adquirente não é obrigado a respeitar o contrato, a menos que haja cláusula específica. Em caso de morte do locador ou locatário, a locação por tempo determinado é transferida para os herdeiros. O locatário tem direito de retenção em caso de benfeitorias necessárias ou úteis feitas com consentimento do locador.", "O comodato é o empréstimo gratuito de coisas não fungíveis, que se concretiza com a entrega do objeto. Os tutores, curadores e administradores de bens alheios não podem emprestar bens sem autorização. Se não houver prazo estabelecido, presume-se o prazo necessário para o uso concedido. O comodatário deve cuidar da coisa emprestada como se fosse sua, só podendo usá-la de acordo com o contrato. Se houver risco para a coisa emprestada, o comodatário deve priorizar sua salvação, caso contrário será responsável pelo dano. O comodatário não pode pedir reembolso das despesas feitas com a coisa emprestada. Se várias pessoas forem comodatárias ao mesmo tempo, serão solidariamente responsáveis perante o comodante.", "O mútuo é um tipo de empréstimo de coisas fungíveis, onde o mutuário deve restituir ao mutuante a mesma coisa recebida. O empréstimo transfere o domínio da coisa emprestada ao mutuário, que assume todos os riscos a partir da entrega. Em casos de empréstimo feito a pessoa menor sem autorização, o mutuário não pode ser cobrado, a menos que haja ratificação posterior, necessidade para alimentos habituais, bens ganhos com trabalho, benefício do menor ou obtenção maliciosa do empréstimo. O mutuante pode exigir garantia de restituição se houver mudança na situação econômica do mutuário. Em empréstimos destinados a fins econômicos, são presumidos juros limitados pela taxa do artigo 406, com capitalização anual permitida. O prazo do mútuo pode variar de acordo com o tipo de coisa emprestada.", "O Capítulo VII do Livro I trata da prestação de serviço, que pode ser contratada mediante retribuição, com regras específicas para fixação da remuneração, prazo do contrato, rescisão, entre outros. O contrato de prestação de serviço pode ser rescindido por diversas causas, como conclusão da obra, morte de uma das partes, inadimplemento, entre outros. A alienação do prédio onde o serviço é prestado não rescinde o contrato, cabendo ao prestador a opção de continuar com o novo proprietário ou com o contratante original. Também é prevista uma penalidade para quem aliciar pessoas obrigadas em contrato a prestar serviço a outra pessoa.", "O documento trata do contrato de empreitada, onde o empreiteiro pode contribuir com seu trabalho ou com materiais, sendo que a obrigação de fornecer os materiais não se presume. O empreiteiro é responsável pelos riscos dos materiais até a entrega da obra, a menos que o dono esteja em mora. Se a obra for apenas de mão-de-obra, os riscos correm por conta do dono. O empreiteiro perde a retribuição se a obra perecer sem culpa sua. O dono deve receber a obra de acordo com o ajuste, podendo rejeitá-la se o empreiteiro não seguir as instruções. O empreiteiro é responsável pela solidez da obra por cinco anos. O dono não pode introduzir modificações no projeto sem autorização do empreiteiro, a menos que seja por motivos técnicos. O contrato não se extingue pela morte de uma das partes, a menos que tenha sido ajustado considerando as qualidades pessoais do empreiteiro.", "O contrato de depósito é regulado pelos artigos 627 a 646 do Livro I, Título VI, Capítulo IX do Código Civil. O depósito pode ser voluntário ou oneroso, e o depositário deve cuidar da coisa depositada com diligência, devendo restituí-la quando solicitado pelo depositante. O depositário não pode se recusar a devolver a coisa, exceto em casos específicos, e deve pagar despesas feitas com a coisa e prejuízos decorrentes do depósito. O depósito de coisas fungíveis segue as regras do mútuo, e o depósito voluntário deve ser comprovado por escrito.", "O texto trata do depósito necessário, que é aquele feito em cumprimento de uma obrigação legal ou em situações de calamidade. O depósito necessário pode ser equiparado ao das bagagens de viajantes em hospedarias, sendo os hospedeiros responsáveis por eventuais furtos ou roubos. A remuneração pelo depósito está incluída no preço da hospedagem. O depositário que não restituir o depósito quando exigido pode ser compelido a fazê-lo mediante prisão e ressarcir os prejuízos.", "O mandato é um contrato em que alguém recebe poderes para agir em nome de outra pessoa. Pode ser dado por instrumento particular, que deve conter informações específicas, ou por instrumento público. O mandato pode ser expresso ou tácito, verbal ou escrito. A aceitação do mandato pode ser tácita e resulta do início da execução. O mandato pode ser especial para negócios específicos ou geral para todos os negócios do mandante. Os atos praticados sem mandato válido são ineficazes, a menos que sejam ratificados pelo mandante. O mandatário tem o direito de reter parte do objeto da operação para pagamento do que lhe é devido. Se o mandatário exceder os poderes do mandato, será considerado mero gestor de negócios até que o mandante ratifique os atos. Menores de dezesseis a dezoito anos não emancipados podem ser mandatários, mas o mandante só pode agir contra eles de acordo com as regras gerais aplicáveis às obrigações contraídas por menores.", "O documento trata das obrigações do mandatário em relação ao mandante. O mandatário deve aplicar toda sua diligência na execução do mandato e indenizar qualquer prejuízo causado por culpa sua ou do substituto, caso haja. Deve prestar contas de sua gerência ao mandante e transferir-lhe as vantagens do mandato. Não pode compensar prejuízos com proveitos e deve pagar juros se empregar fundos do mandante em proveito próprio. O mandatário não pode comprar algo em nome próprio que deveria comprar para o mandante, a menos que tenha sido expressamente designado no mandato. Também são abordadas questões como a atuação conjunta de mandatários e a responsabilidade do terceiro que celebra negócio jurídico exorbitante do mandato.", "O documento trata das obrigações do mandante em um contrato de mandato. O mandante é responsável por satisfazer as obrigações contraídas pelo mandatário, adiantar as despesas necessárias, pagar a remuneração e as despesas da execução do mandato, ressarcir as perdas do mandatário, mesmo que o negócio não tenha o efeito esperado, pagar juros sobre as somas adiantadas, e responder pelas consequências caso o mandatário contrarie suas instruções, desde que não exceda os limites do mandato. Em caso de mandato outorgado por mais de uma pessoa, cada uma é solidariamente responsável pelos compromissos do mandato, com direito regressivo contra os outros mandantes. O mandatário também tem direito de retenção sobre a coisa da qual tem posse em virtude do mandato até se reembolsar das despesas.", "O documento trata do tema do mandato, especificamente da sua extinção. O mandato pode ser encerrado por revogação ou renúncia, pela morte ou interdição de uma das partes, pela mudança de estado que inabilite o mandante ou o mandatário, pelo término do prazo ou pela conclusão do negócio. Existem cláusulas específicas que podem tornar a revogação do mandato ineficaz, como a irrevogabilidade. A revogação do mandato deve ser comunicada ao mandatário e pode não ser oponível a terceiros de boa-fé. Em caso de falecimento do mandatário, os herdeiros devem comunicar o mandante e tomar as medidas necessárias para a continuidade dos negócios pendentes.", "O artigo 692 do Livro I, Título VI, Capítulo X, Seção V do Código Civil trata do mandato judicial, que está sujeito às normas da legislação processual e, de forma suplementar, às normas estabelecidas no próprio Código Civil.", "O contrato de comissão tem por objeto a compra ou venda de bens ou a realização de mútuo ou outro negócio jurídico de crédito pelo comissário, em seu próprio nome, à conta do comitente. O comissário fica diretamente obrigado para com as pessoas com quem contratar, agindo de acordo com as ordens e instruções do comitente. Ele deve agir com cuidado e diligência, respondendo por qualquer prejuízo causado ao comitente, exceto em caso de força maior. Se houver a cláusula del credere, o comissário responde solidariamente com as pessoas com quem tratou em nome do comitente. O comissário tem direito a remuneração e pode conceder dilação do prazo para pagamento conforme os usos locais. Em caso de morte do comissário ou impossibilidade de concluir o negócio, o comitente deve pagar uma remuneração proporcional. O comitente pode alterar as instruções dadas ao comissário a qualquer momento. Em caso de dispensa sem justa causa, o comissário tem direito a remuneração e ressarcimento por perdas e danos. O comissário e o comitente são obrigados a pagar juros um ao outro. O crédito do comissário goza de privilégio geral em caso de falência ou insolvência do comitente. O comissário tem direito de retenção sobre os bens e valores em seu poder em virtude da comissão e as regras sobre mandato são aplicáveis à comissão, no que couber.", "O contrato de agência é aquele em que uma pessoa se compromete a promover negócios em nome de outra, em uma zona determinada, recebendo uma remuneração por isso. O agente deve agir com diligência e seguir as instruções do proponente. As despesas da agência são de responsabilidade do agente, que tem direito a remuneração pelos negócios concluídos dentro de sua zona, mesmo sem sua interferência. O agente também tem direito a indenização se o proponente cessar o atendimento das propostas sem justa causa. Em caso de dispensa, o agente tem direito a remuneração pelos serviços prestados e indenizações previstas em lei. O contrato pode ser resolvido por qualquer das partes com aviso prévio de noventa dias, e em caso de divergência, o juiz decide sobre o prazo e valor devido. As regras do contrato de agência são aplicáveis ao mandato e à comissão, e também às leis especiais.", "O contrato de corretagem é aquele em que uma pessoa se compromete a obter negócios para outra, sem relação de dependência. O corretor deve agir com diligência e prudência, fornecendo informações ao cliente sobre o andamento do negócio. A remuneração do corretor deve ser arbitrada de acordo com a natureza do negócio e os usos locais. O corretor tem direito à remuneração uma vez que tenha conseguido o resultado previsto no contrato, mesmo que o negócio não se concretize devido ao arrependimento das partes. Se o negócio for concluído diretamente entre as partes, sem a mediação do corretor, ele não terá direito à remuneração, a menos que tenha exclusividade por escrito. Se o negócio for realizado posteriormente devido aos trabalhos do corretor, a remuneração ainda será devida. Se mais de um corretor intermediar o negócio, a remuneração será dividida igualmente entre eles, a menos que haja acordo em contrário. Os preceitos sobre corretagem no Código Civil não excluem a aplicação de outras normas da legislação especial.", "O contrato de transporte é aquele em que alguém se obriga a transportar pessoas ou coisas de um lugar para outro mediante retribuição. O transporte realizado com autorização, permissão ou concessão segue as normas regulamentares e o que for estabelecido nesses atos. Nos contratos de transporte cumulativo, cada transportador é responsável pelos danos causados durante o percurso, sendo a responsabilidade solidária em caso de substituição de transportadores.", "O documento trata do transporte de pessoas, estabelecendo a responsabilidade do transportador pelos danos causados aos passageiros e suas bagagens, salvo em caso de força maior. Também aborda questões como a rescisão do contrato de transporte antes e durante a viagem, a obrigação do transportador de concluir o transporte em caso de interrupção por motivos alheios à sua vontade, e o direito de retenção sobre a bagagem do passageiro em caso de não pagamento da passagem.", "O documento trata das regras e responsabilidades relacionadas ao transporte de coisas. Ele aborda a caracterização da coisa a ser transportada, a emissão de conhecimento com os dados necessários para identificação, a recusa de coisas inadequadas, a responsabilidade do transportador, a entrega da mercadoria ao destinatário, a possibilidade de desistência do transporte pelo remetente, a responsabilidade em caso de perda ou avaria, entre outros aspectos. Também menciona a possibilidade de depósito da mercadoria em juízo em caso de impedimento no transporte, a responsabilidade solidária dos transportadores em caso de transporte cumulativo, e a necessidade de conferência e reclamação por parte do destinatário.", "O contrato de seguro é regido pelo segurador, que se compromete a garantir o interesse legítimo do segurado mediante o pagamento do prêmio. A apólice ou bilhete de seguro deve conter informações essenciais, como os riscos assumidos, o início e fim da validade, o limite da garantia e o prêmio devido. Ambas as partes devem agir com boa-fé e veracidade, e o segurado deve comunicar qualquer incidente que possa agravar o risco. A mora do segurador em pagar o sinistro implica em atualização monetária da indenização devida. O segurador que emite a apólice mesmo sabendo que o risco já passou deve pagar o dobro do prêmio. A recondução tácita do contrato só pode ocorrer uma vez, e os agentes autorizados do segurador são considerados seus representantes. O segurador deve pagar em dinheiro o prejuízo resultante do risco assumido, a menos que seja acordada a reposição da coisa.", "O documento trata do seguro de dano, estabelecendo que a garantia prometida não pode ultrapassar o valor do interesse segurado no momento da conclusão do contrato. Também aborda questões como o risco do seguro, a vigência da garantia, a transferência do contrato a terceiros, a sub-rogação do segurador nos direitos do segurado, o seguro de responsabilidade civil e os seguros legalmente obrigatórios. O documento estabelece regras e procedimentos a serem seguidos pelos segurados e seguradores em caso de sinistro.", "O documento trata das regras e disposições relacionadas ao seguro de pessoa. O proponente pode estipular livremente o capital segurado e contratar mais de um seguro sobre o mesmo interesse. É obrigatório declarar interesse na preservação da vida do segurado em seguros sobre a vida de outros. Há regras sobre a substituição do beneficiário, pagamento do capital segurado na falta de indicação, validade da instituição do companheiro como beneficiário, entre outras disposições. Também são abordados temas como prêmio, carência, exclusão de pagamento por suicídio, causas que não eximem o segurador do pagamento, entre outros. Além disso, são estabelecidas regras para o seguro de pessoas estipulado por pessoa natural ou jurídica em benefício de um grupo vinculado a ela. No entanto, não estão incluídas garantias de reembolso de despesas hospitalares, tratamento médico, despesas de luto e funeral do segurado.", "O contrato de constituição de renda permite que uma pessoa se obrigue a realizar uma prestação periódica, seja de forma gratuita ou onerosa. No caso de ser oneroso, o credor pode exigir garantias. O contrato deve ser feito por escritura pública e pode ser a prazo certo ou por vida. Se o rendeiro não cumprir a obrigação, o credor pode acioná-lo e, em caso de renda em benefício de várias pessoas, os direitos são iguais. A renda pode ser isenta de execuções por ato do instituidor, prevalecendo em favor de montepios e pensões alimentícias.", "O texto trata das dívidas de jogo ou aposta, estabelecendo que não obrigam ao pagamento, exceto se houver dolo, se o perdente for menor ou interdito, ou se o contrato envolver reconhecimento, novação ou fiança de dívida de jogo. Também menciona que a regra se aplica mesmo a jogos não proibidos, exceto os legalmente permitidos, e que prêmios em competições esportivas, intelectuais ou artísticas estão fora dessa proibição. Além disso, não se pode exigir reembolso de empréstimos feitos para jogos ou apostas no momento da aposta. Por fim, os contratos sobre títulos de bolsa, mercadorias ou valores que estipulem liquidação pela diferença entre o preço ajustado e a cotação no vencimento não se enquadram nessas regras, assim como o sorteio para resolver questões ou dividir bens comuns é considerado um sistema de partilha ou transação.", "O contrato de fiança é uma garantia em que uma pessoa se compromete a cumprir uma obrigação assumida pelo devedor caso este não a cumpra. A fiança deve ser feita por escrito e não admite interpretação extensiva. Pode ser estipulada mesmo sem consentimento do devedor. As dívidas futuras podem ser objeto de fiança, mas o fiador só pode ser demandado depois que a obrigação do devedor principal estiver certa e líquida. A fiança pode ser de valor inferior ao da obrigação principal, mas não pode exceder esse valor. As obrigações nulas não podem ser objeto de fiança, exceto se a nulidade for apenas por incapacidade pessoal do devedor. O credor não é obrigado a aceitar um fiador que não seja idôneo, domiciliado no mesmo município e sem bens suficientes. Se o fiador se tornar insolvente ou incapaz, o credor pode exigir sua substituição.", "O documento trata dos efeitos da fiança, destacando que o fiador tem o direito de exigir que os bens do devedor sejam executados primeiro, até a contestação da lide. Também aborda a solidariedade entre fiadores, a possibilidade de fixar a parte da dívida pela qual cada fiador é responsável, a sub-rogação nos direitos do credor, a responsabilidade do devedor perante o fiador por perdas e danos, entre outros aspectos. Além disso, menciona a possibilidade de o fiador se exonerar da fiança após notificar o credor, e que a obrigação do fiador passa aos herdeiros, mas com limitações.", "O texto trata da extinção da fiança, destacando que o fiador pode opor ao credor exceções pessoais e extintivas da obrigação do devedor principal, exceto em casos de incapacidade pessoal. O fiador pode ficar desobrigado se o credor conceder moratória ao devedor sem seu consentimento, se for impossível a sub-rogação nos direitos do credor, ou se o credor aceitar objeto diverso em pagamento da dívida. Além disso, se for invocado o benefício da excussão e o devedor cair em insolvência, o fiador será exonerado se provar que os bens indicados por ele eram suficientes para quitar a dívida.", "O texto trata da transação como forma de prevenir ou encerrar litígios por meio de concessões mútuas entre as partes. A transação só é permitida em relação a direitos patrimoniais de caráter privado e deve ser feita por escritura pública ou instrumento particular, dependendo da obrigação. Ela interpreta-se restritivamente e não transmite direitos, apenas declara ou reconhece. A transação não beneficia nem prejudica terceiros que não participaram dela. Em casos específicos, a transação pode desobrigar fiadores, extinguir obrigações entre credores solidários e devedores, ou extinguir dívidas entre devedores solidários e credores. A transação não extingue a ação penal pública em casos de obrigações resultantes de delito. Pode haver pena convencional na transação e ela só é anulada por dolo, coação ou erro essencial. A transação é nula se versar sobre litígio decidido por sentença passada em julgado sem ciência das partes ou se descobrir que nenhum dos transatores tinha direito sobre o objeto da transação.", "O primeiro documento trata do compromisso como forma de resolver litígios entre pessoas que podem contratar, sendo vedado para questões de estado, direito pessoal de família e outras não patrimoniais. Também menciona a cláusula compromissória nos contratos para resolver divergências por juízo arbitral. Já o segundo documento fala sobre o contrato de administração fiduciária de garantias, onde um agente de garantia pode ser designado pelos credores para gerir e executar garantias, com dever fiduciário em relação aos credores e possibilidade de substituição por decisão dos credores. Além disso, o agente de garantia pode manter contratos com o devedor para auxiliar em procedimentos relacionados a operações de crédito e garantias reais, devendo agir com estrita boa-fé perante o devedor.", "O Título VII do Livro I trata dos Atos Unilaterais, especificamente do Capítulo I que aborda a Promessa de Recompensa. O artigo 854 estabelece que quem se comprometer publicamente a recompensar alguém que cumpra uma condição ou serviço, assume a obrigação de cumprir o prometido. O artigo 855 determina que aquele que realizar o serviço ou cumprir a condição, mesmo que não seja pelo interesse da promessa, tem direito a exigir a recompensa. O artigo 856 permite que o promitente revogue a promessa antes do serviço ser prestado, desde que faça isso publicamente, e o parágrafo único garante o reembolso das despesas ao candidato de boa-fé. Os artigos 857 e 858 estabelecem regras para casos em que mais de uma pessoa realiza o ato contemplado na promessa. O artigo 859 define condições essenciais para concursos com promessa de recompensa, como a fixação de prazo e a decisão do juiz nomeado nos anúncios. O artigo 860 determina que as obras premiadas em concursos pertencem ao promitente apenas se isso for estipulado na publicação da promessa.", "O texto trata da gestão de negócios, um ato unilateral em que alguém intervém na administração de um negócio alheio sem autorização. O gestor deve agir de acordo com o interesse presumível do dono do negócio e é responsável por eventuais prejuízos causados. O gestor deve comunicar ao dono do negócio a gestão assumida e aguardar sua resposta, tomando as medidas necessárias para administrar o negócio de forma diligente. O dono do negócio deve reembolsar o gestor pelas despesas necessárias e úteis feitas durante a gestão, além de indenizá-lo por eventuais prejuízos. A ratificação do dono retroage ao início da gestão e produz os efeitos do mandato. Se a gestão for desaprovada pelo dono, aplicam-se as disposições sobre prejuízos e restituição. Em casos de negócios conexos, o gestor é considerado sócio daquele em benefício do qual agiu, sendo responsável na medida das vantagens obtidas.", "O Título VII do Livro I trata dos Atos Unilaterais, com destaque para o Pagamento Indevido. O artigo 876 estabelece que quem recebeu o que não era devido deve restituir, mesmo em caso de dívida condicional. O artigo 877 determina que quem pagou indevidamente deve provar o erro. O artigo 878 trata dos frutos, acessões, benfeitorias e deteriorações de uma coisa dada indevidamente, aplicando as regras de posse de boa-fé ou má-fé. O artigo 879 estabelece a responsabilidade de quem alienou um imóvel recebido indevidamente, diferenciando a ação de boa-fé da ação de má-fé. O artigo 880 isenta de restituição quem recebeu um pagamento indevido como parte de uma dívida verdadeira e tomou medidas para inutilizar o título ou abrir mão das garantias. O artigo 881 estabelece a obrigação de indenizar quem cumpriu uma obrigação indevida para se eximir de outra. O artigo 882 proíbe a repetição de pagamento de dívida prescrita ou obrigação judicialmente inexigível. O artigo 883 impede a repetição de pagamento feito para obter um fim ilícito, imoral ou proibido por lei, determinando que o valor doado seja revertido para uma instituição de beneficência.", "O texto trata do enriquecimento sem causa, estabelecendo que aquele que se enriquecer à custa de outrem sem justa causa deve restituir o valor indevidamente auferido, com atualização monetária. Se o enriquecimento tiver por objeto uma coisa específica, esta deve ser restituída ou seu valor na época da exigência. A restituição é devida mesmo que a causa do enriquecimento deixe de existir, exceto se a lei oferecer outros meios de ressarcimento ao lesado.", "O Livro I, Título VIII do Código Civil trata dos Títulos de Crédito. O artigo 887 estabelece que o título de crédito só produz efeito se preencher os requisitos legais. O artigo 888 diz que a omissão de requisitos não invalida o negócio jurídico. O artigo 889 determina que o título deve conter data de emissão, direitos conferidos e assinatura do emitente. O artigo 890 considera cláusulas como juros e endosso como não escritas. O artigo 891 diz que um título incompleto deve ser preenchido de acordo com ajustes realizados. O artigo 892 estabelece que quem assina um título sem poderes fica obrigado a ele. O artigo 893 diz que a transferência do título implica a transferência de todos os direitos. O artigo 894 trata da transferência de títulos representativos de mercadorias. O artigo 895 estabelece que o título em circulação só pode ser dado em garantia. O artigo 896 diz que um título adquirido de boa-fé não pode ser reivindicado. O artigo 897 permite o aval como garantia de pagamento. O artigo 898 estabelece regras para o aval. O artigo 899 equipara o avalista ao emitente ou devedor final. O artigo 900 diz que o aval posterior ao vencimento tem os mesmos efeitos do anterior. O artigo 901 desonera o devedor que paga o título no vencimento. O artigo 902 estabelece regras para o pagamento antes do vencimento. O artigo 903 determina que os títulos de crédito são regidos pelo Código Civil, salvo disposição em lei especial.", "O texto trata dos títulos de crédito ao portador, estabelecendo que a transferência desses títulos é feita por simples tradição e que o possuidor tem direito à prestação indicada no título mediante sua apresentação ao devedor. O devedor só pode se opor ao portador com exceções fundamentadas em direito pessoal ou nulidade da obrigação. Títulos ao portador emitidos sem autorização de lei especial são nulos. O possuidor de título dilacerado tem direito a obter um novo título do emitente. O proprietário que perder o título pode obter um novo em juízo e impedir que terceiros recebam pagamentos relacionados ao título. O pagamento feito antes do conhecimento da ação mencionada no artigo exonera o devedor, a menos que seja provado que ele tinha conhecimento do fato.", "O documento trata dos títulos de crédito, especificamente do endosso, que é a transferência do título para outra pessoa. O endosso deve ser feito no verso ou anverso do próprio título e pode ser em branco. O portador legítimo do título é aquele com uma série regular de endossos. O endossante não responde pelo cumprimento do título, a menos que assuma responsabilidade pelo pagamento. O devedor só pode opor exceções ao portador relacionadas à forma do título, conteúdo literal, falsidade de assinatura, capacidade ou representação no momento da subscrição, e falta de requisitos para a ação. O endosso pode conter cláusulas de mandato ou penhor, conferindo ao endossatário os direitos inerentes ao título. A aquisição do título de outra forma que não seja o endosso é considerada uma cessão civil. O endosso posterior ao vencimento tem os mesmos efeitos do anterior.", "O Título VIII do Livro I trata dos Títulos de Crédito, especificamente do Título Nominativo. Um título nominativo é emitido em favor de uma pessoa cujo nome conste no registro do emitente. A transferência desse título pode ser feita mediante termo em registro do emitente, assinado pelo proprietário e pelo adquirente, ou por endosso que contenha o nome do endossatário. A transferência por endosso só tem eficácia perante o emitente após a competente averbação em seu registro. O endossatário legitimado por série regular de endossos tem direito de obter a averbação no registro do emitente. O título nominativo pode ser transformado em à ordem ou ao portador, a pedido do proprietário e à sua custa. O emitente fica desonerado de responsabilidade ao transferir o título de boa-fé pelos modos indicados. Qualquer negócio ou medida judicial relacionada ao título só produz efeito após a competente averbação no registro do emitente.", "O documento trata da responsabilidade civil por danos causados a terceiros por ato ilícito, estabelecendo que aquele que causar dano a outrem deve repará-lo. Também aborda a responsabilidade de incapazes, empresários, pais, tutores, empregadores, donos de estabelecimentos, entre outros, pelos danos causados por terceiros sob sua responsabilidade. Além disso, menciona a responsabilidade por danos causados por animais, edifícios, construções e objetos lançados de lugares indevidos. O documento também trata de questões relacionadas a demandas por dívidas, prescrição, desistência de ação, solidariedade na reparação de danos e transmissão do direito de exigir reparação com a herança.", "O documento trata da responsabilidade civil e da indenização em casos de danos causados a terceiros. Define que a indenização deve ser proporcional à extensão do dano, podendo ser reduzida se houver desproporção entre a culpa e o dano. Também estabelece critérios para indenização em casos de homicídio, lesão à saúde, incapacidade de trabalho, entre outros. Além disso, aborda a indenização por injúria, difamação, calúnia e ofensa à liberdade pessoal.", "O documento trata das preferências e privilégios creditórios em caso de insolvência do devedor. São listados os diferentes tipos de privilégios, como o privilégio especial e o privilégio geral, e a ordem de preferência dos créditos sobre os bens do devedor. Também são mencionados os casos em que os credores hipotecários ou privilegiados podem conservar seus direitos, bem como as situações em que o devedor pode se exonerar pagando sem oposição dos credores. Além disso, são detalhados os diferentes tipos de créditos que gozam de privilégio especial e geral, como despesas de funeral, custas judiciais, despesas com luto, impostos, salários de empregados domésticos, entre outros.", "O documento trata do Direito de Empresa, especificamente do Empresário. Define empresário como aquele que exerce profissionalmente atividade econômica organizada para a produção ou circulação de bens ou serviços. Estabelece a obrigatoriedade da inscrição do empresário no Registro Público de Empresas Mercantis antes do início de sua atividade, com requisitos específicos para o requerimento de inscrição. Também aborda a possibilidade de transformação do registro de empresário individual para registro de sociedade empresária, tratamento favorecido ao empresário rural e pequeno empresário, e equiparação do empresário rural ao empresário sujeito a registro.", "O documento trata do Direito de Empresa, especificamente do Empresário. Ele aborda a capacidade necessária para exercer a atividade de empresário, incluindo a responsabilidade das obrigações contraídas por pessoas legalmente impedidas. Também menciona a possibilidade de incapazes continuarem a empresa por meio de representantes ou assistentes, com autorização judicial. Além disso, fala sobre a contratação de sociedade entre cônjuges, alienação de imóveis pelo empresário casado e a necessidade de registro de diversos documentos no Registro Público de Empresas Mercantis. O documento também menciona a Empresa Individual de Responsabilidade Limitada, que foi revogada pela Lei nº 14.382 de 2022.", "O Livro II, Título II, Capítulo Único do Direito de Empresa trata das disposições gerais sobre sociedade. O artigo 981 define que a sociedade é formada por pessoas que se comprometem a contribuir com bens ou serviços para uma atividade econômica e compartilhar os resultados. O artigo 982 diferencia sociedades empresárias, que exercem atividades sujeitas a registro, de sociedades simples. O artigo 983 estabelece que as sociedades empresárias devem se constituir de acordo com os tipos regulados pela lei, enquanto as sociedades simples podem seguir esses tipos ou se submeter a normas próprias. O artigo 984 trata da equiparação de sociedades empresárias que tenham como objeto atividades rurais. Por fim, o artigo 985 estabelece que a sociedade adquire personalidade jurídica com a inscrição de seus atos constitutivos no registro próprio.", "O Livro II trata do Direito de Empresa, com o Título II abordando a Sociedade. O Capítulo I fala sobre a Sociedade em Comum, onde os atos constitutivos devem ser inscritos para reger a sociedade, exceto por ações em organização. Os sócios devem provar a existência da sociedade por escrito, mas terceiros podem prová-la de qualquer modo. Os bens e dívidas sociais constituem um patrimônio especial, do qual os sócios são titulares em comum. Os bens sociais respondem pelos atos de gestão praticados por qualquer sócio, exceto se houver um pacto expresso limitativo de poderes. Todos os sócios respondem solidária e ilimitadamente pelas obrigações sociais, com exceção daquele que contratou pela sociedade.", "O documento trata da sociedade em conta de participação, onde a atividade é exercida apenas pelo sócio ostensivo, que responde perante terceiros, enquanto os demais sócios participam dos resultados. A constituição da sociedade não requer formalidades específicas e o contrato social só produz efeitos entre os sócios. A contribuição dos sócios constitui um patrimônio especial, com efeitos apenas entre os sócios. Em caso de falência de um dos sócios, a sociedade é dissolvida e a conta é liquidada. O sócio ostensivo não pode admitir novos sócios sem o consentimento dos demais. As normas da sociedade simples são aplicáveis subsidiariamente à sociedade em conta de participação.", "O contrato social de uma sociedade simples deve ser escrito e mencionar informações como nome, nacionalidade, residência dos sócios, denominação, objeto, sede e prazo da sociedade, capital social, quota de cada sócio, prestações dos sócios, administração da sociedade, participação nos lucros e perdas, e responsabilidade dos sócios pelas obrigações sociais. Após a constituição da sociedade, o contrato social deve ser registrado no Registro Civil das Pessoas Jurídicas do local de sua sede. Modificações no contrato social devem ser aprovadas por todos os sócios ou por maioria absoluta de votos, dependendo do objeto da modificação. A sociedade simples também deve registrar sucursais, filiais ou agências em outros locais, com a devida averbação no Registro Civil da sede.", "O documento apresenta os direitos e obrigações dos sócios de uma sociedade simples. Os sócios têm obrigações desde a assinatura do contrato até a liquidação da sociedade. Não podem ser substituídos sem o consentimento dos demais sócios. A cessão de quota sem modificação do contrato social não é eficaz sem o consentimento dos demais sócios. Os sócios devem contribuir conforme estabelecido no contrato, e quem não o fizer responderá por danos emergentes da mora. A distribuição de lucros ilícitos ou fictícios acarreta responsabilidade solidária dos administradores e dos sócios que os receberem.", "O documento trata das regras relacionadas à administração de uma sociedade simples, onde as deliberações são tomadas por maioria de votos dos sócios, com regras específicas para formação da maioria absoluta e resolução de empates. Os administradores devem agir com cuidado e diligência, não podendo ser pessoas impedidas por lei especial. Eles respondem pessoal e solidariamente por seus atos, devendo prestar contas aos sócios regularmente. Além disso, são estabelecidas regras para a realização de operações e a gestão da sociedade, com sanções para administradores que agirem em interesse próprio ou contrário ao da sociedade.", "O documento trata das relações da sociedade simples com terceiros, estabelecendo que a sociedade adquire direitos, assume obrigações e procede judicialmente por meio de administradores com poderes especiais. Os sócios respondem pelas dívidas da sociedade na proporção em que participem das perdas sociais, salvo cláusula de responsabilidade solidária. Os bens particulares dos sócios não podem ser executados por dívidas da sociedade antes dos bens sociais. O sócio admitido em sociedade já constituída não se exime das dívidas sociais anteriores à admissão. O credor particular de sócio pode fazer recair a execução sobre a parte que lhe couber nos lucros da sociedade. Os herdeiros do cônjuge de sócio não podem exigir imediatamente a parte que lhes couber na quota social, devendo aguardar a liquidação da sociedade.", "O documento trata da resolução da sociedade em relação a um sócio, abordando os casos de morte, retirada e exclusão de sócios. No caso de morte de um sócio, sua quota será liquidada, a menos que o contrato estabeleça algo diferente, os sócios remanescentes optem pela dissolução da sociedade ou haja acordo com os herdeiros para substituir o sócio falecido. Qualquer sócio pode se retirar da sociedade, desde que siga as regras estabelecidas, e os demais sócios podem optar pela dissolução da sociedade nos trinta dias seguintes à notificação de retirada. Um sócio pode ser excluído judicialmente por falta grave no cumprimento de suas obrigações ou por incapacidade superveniente. A quota do sócio resolvido será liquidada com base na situação patrimonial da sociedade à data da resolução, e o capital social sofrerá redução, a menos que os demais sócios supram o valor da quota. A quota liquidada será paga em dinheiro no prazo de noventa dias, a menos que haja acordo em contrário. A retirada, exclusão ou morte do sócio não o exime, ou a seus herdeiros, da responsabilidade pelas obrigações sociais anteriores até dois anos após a resolução da sociedade.", "O documento trata da dissolução da sociedade simples, indicando as diversas formas pelas quais a sociedade pode ser dissolvida, como o vencimento do prazo de duração, o consenso unânime dos sócios, a deliberação dos sócios por maioria absoluta, entre outros. Também aborda a possibilidade de dissolução judicial da sociedade, a investidura do liquidante após a dissolução, a liquidação judicial da sociedade em caso de extinção da autorização para funcionar, a destituição do liquidante e o processo de liquidação da sociedade.", "O documento trata das regras e normas referentes à sociedade em nome coletivo. A responsabilidade dos sócios é solidária e ilimitada pelas obrigações sociais, mas pode ser limitada por convenção entre eles. O contrato deve mencionar a firma social e a administração da sociedade é exclusiva dos sócios. O credor particular de sócio não pode exigir a liquidação da quota do devedor antes da dissolução da sociedade, exceto em casos específicos. A sociedade pode se dissolver por diversas causas, incluindo a declaração de falência se for empresária.", "O documento trata da sociedade em comandita simples, onde existem dois tipos de sócios: os comanditados, responsáveis ilimitadamente pelas obrigações sociais, e os comanditários, responsáveis apenas pelo valor de sua quota. O contrato deve discriminar os comanditados e os comanditários, e aplicam-se a essa sociedade as normas da sociedade em nome coletivo, quando compatíveis. O comanditário não pode praticar atos de gestão nem ter seu nome na firma social, mas pode ser constituído procurador da sociedade para negócios específicos. A diminuição da quota do comanditário só produz efeito após a modificação do contrato ser averbada. O comanditário não é obrigado a repor lucros recebidos de boa-fé, mas não pode receber lucros se o capital social foi reduzido por perdas. Em caso de morte de um sócio comanditário, a sociedade continua com seus sucessores, que designarão um representante. A sociedade se dissolve por diversas causas, incluindo a falta de uma das categorias de sócio por mais de cento e oitenta dias. Na falta de sócio comanditado, os comanditários podem nomear um administrador provisório para praticar atos de administração.", "O artigo 1.052 estabelece que na sociedade limitada, a responsabilidade de cada sócio é restrita ao valor de suas quotas, mas todos respondem solidariamente pela integralização do capital social. A sociedade limitada pode ser constituída por uma ou mais pessoas, e se for unipessoal, as disposições sobre o contrato social se aplicam ao documento de constituição do sócio único. O artigo 1.053 determina que a sociedade limitada é regida, nas omissões do Capítulo IV, pelas normas da sociedade simples, e o contrato social pode prever a regência supletiva da sociedade limitada pelas normas da sociedade anônima. O artigo 1.054 estabelece que o contrato social deve mencionar, quando aplicável, as indicações do artigo 997 e a firma social.", "O documento trata das regras relacionadas às quotas em uma sociedade limitada. O capital social é dividido em quotas, que podem ser iguais ou desiguais, e cada sócio pode ter uma ou várias quotas. Os sócios respondem solidariamente pela exata estimação dos bens conferidos ao capital social por até cinco anos após o registro da sociedade. É vedada a contribuição em forma de prestação de serviços. As quotas são indivisíveis em relação à sociedade, exceto para efeito de transferência. No caso de condomínio de quota, os direitos só podem ser exercidos pelo condômino representante. Na omissão do contrato, o sócio pode ceder sua quota a outro sócio ou a estranho, desde que não haja oposição de titulares de mais de um quarto do capital social. A cessão da quota só tem eficácia após a averbação do respectivo instrumento. Em caso de não integralização da quota por um sócio remisso, os outros sócios podem tomar a quota para si ou transferi-la a terceiros, excluindo o primitivo titular. Os sócios são obrigados a repor os lucros e quantias retiradas, mesmo que autorizadas pelo contrato, se isso for feito com prejuízo do capital.", "O documento trata da administração da sociedade limitada, onde é mencionado que a sociedade pode ser administrada por uma ou mais pessoas designadas no contrato social ou em ato separado. A designação de administradores não sócios depende da aprovação de no mínimo 2/3 dos sócios. O administrador investe-se no cargo mediante termo de posse no livro de atas da administração, e sua destituição pode ocorrer a qualquer momento. A renúncia do administrador torna-se eficaz após a comunicação escrita e averbação. O uso da firma ou denominação social é privativo dos administradores com os necessários poderes, e ao término de cada exercício social é necessário elaborar o inventário, balanço patrimonial e balanço de resultado econômico.", "O artigo 1.066 do Livro II, Título II, Capítulo IV, Seção IV do Direito de Empresa trata do Conselho Fiscal em uma Sociedade Limitada. O contrato pode instituir um conselho fiscal composto por três ou mais membros, eleitos na assembleia anual. O artigo 1.067 estabelece que os membros eleitos ficam investidos em suas funções até a próxima assembleia anual, e o não cumprimento do termo de posse torna a eleição sem efeito. A remuneração dos membros do conselho fiscal é fixada anualmente pela assembleia dos sócios. As atribuições dos membros incluem examinar os livros e papéis da sociedade, apresentar pareceres sobre os negócios da empresa, denunciar erros, fraudes ou crimes, convocar assembleias e praticar atos durante a liquidação da sociedade. O conselho fiscal não pode transferir suas atribuições a outro órgão da sociedade, e a responsabilidade de seus membros segue as mesmas regras dos administradores. O conselho fiscal pode escolher um contabilista para auxiliá-los, com remuneração aprovada pela assembleia dos sócios.", "O documento trata das deliberações dos sócios em uma sociedade limitada, indicando as matérias que dependem da deliberação dos sócios, como aprovação das contas da administração, destituição dos administradores, modificação do contrato social, entre outros. Também aborda a convocação de reuniões ou assembleias, a instalação da assembleia, a presidência e secretaria da mesma, a forma de votação, o direito de retirada do sócio em caso de modificação do contrato, fusão ou incorporação, a realização anual da assembleia para tomar contas dos administradores, designar novos administradores e tratar de outros assuntos, e a responsabilidade dos sócios em caso de deliberações infringentes do contrato ou da lei. Além disso, o documento inclui a possibilidade de participação e voto a distância em reuniões ou assembleias, de acordo com regulamentação do órgão competente do Poder Executivo federal.", "O documento trata do aumento e da redução do capital de uma sociedade limitada. O artigo 1.081 estabelece que, respeitando o que está previsto em lei especial, o capital pode ser aumentado após a integralização das quotas, com a correspondente modificação do contrato. O artigo também prevê que os sócios têm preferência para participar do aumento até trinta dias após a deliberação. Já o artigo 1.082 permite a redução do capital, seja por perdas irreparáveis ou por ser excessivo em relação ao objeto da sociedade. A redução do capital deve ser aprovada em assembleia e registrada no Registro Público de Empresas Mercantis. O documento também estabelece prazos e condições para a efetivação da redução do capital.", "O artigo 1.085 trata da possibilidade de exclusão de sócios minoritários de uma sociedade limitada, desde que a maioria dos sócios, representativa de mais da metade do capital social, entenda que estão colocando em risco a continuidade da empresa. Já o parágrafo único estabelece que a exclusão de um sócio só pode ser determinada em reunião ou assembleia especialmente convocada para esse fim, garantindo o direito de defesa do acusado. Por fim, o artigo 1.086 determina que, após o registro da alteração contratual, serão aplicados os dispositivos dos artigos 1.031 e 1.032.", "O artigo 1.087 do Livro II, Título II, Capítulo IV, Seção VIII do Direito de Empresa trata da dissolução da sociedade limitada, que ocorre de pleno direito por qualquer das causas previstas no artigo 1.044.", "O documento trata da sociedade anônima, onde o capital é dividido em ações e cada sócio ou acionista é responsável apenas pelo preço de emissão das ações que subscrever ou adquirir. A sociedade anônima é regida por uma lei especial, sendo aplicadas as disposições do Código Civil nos casos omissos.", "O documento trata da sociedade em comandita por ações, que tem seu capital dividido em ações e se rege pelas normas da sociedade anônima. Apenas acionistas podem administrar a sociedade e são responsáveis subsidiária e ilimitadamente pelas obrigações. Os diretores são nomeados no ato constitutivo da sociedade e só podem ser destituídos por deliberação de acionistas que representem no mínimo dois terços do capital social. A assembléia geral não pode realizar certas mudanças sem o consentimento dos diretores, como mudar o objeto essencial da sociedade ou aumentar o capital social.", "O Capítulo VII do Livro II do Direito de Empresa trata da Sociedade Cooperativa. As características da sociedade cooperativa incluem a variabilidade do capital social, o concurso de sócios na administração, a limitação do valor das quotas de cada sócio, a intransferibilidade das quotas a terceiros, o quorum baseado no número de sócios presentes, o direito de cada sócio a um voto, a distribuição dos resultados proporcionalmente às operações realizadas, e a indivisibilidade do fundo de reserva. A responsabilidade dos sócios pode ser limitada ou ilimitada, sendo limitada na cooperativa em que o sócio responde apenas pelo valor de suas quotas e prejuízos proporcionais, e ilimitada na cooperativa em que o sócio responde solidária e ilimitadamente. Em caso de omissão da lei, aplicam-se as disposições referentes à sociedade simples, respeitando as características estabelecidas.", "O Capítulo VIII do Livro II do Direito de Empresa trata das Sociedades Coligadas, definindo como coligadas as sociedades que possuem relações de capital de controle, filiação ou simples participação. O artigo 1.098 define o que é considerado uma sociedade controlada, enquanto o artigo 1.099 e 1.100 tratam das sociedades coligadas ou filiadas e de simples participação, respectivamente. O artigo 1.101 estabelece limites para a participação de uma sociedade em outra, proibindo que ultrapasse o montante das próprias reservas, com a obrigação de alienar as ações ou quotas em excesso dentro de cento e oitenta dias.", "O documento trata da liquidação da sociedade após sua dissolução, descrevendo os deveres do liquidante, como arrecadar os bens da sociedade, elaborar o inventário e balanço, realizar os negócios da sociedade, convocar assembleias, confessar falência se necessário, apresentar relatórios e contas finais, entre outros. O liquidante deve representar a sociedade e praticar os atos necessários à liquidação, respeitando os direitos dos credores preferenciais. Após o pagamento do passivo e partilha do remanescente, a sociedade se extingue. Em caso de liquidação judicial, serão observadas as leis processuais. O credor insatisfeito pode exigir dos sócios o pagamento do crédito recebido na partilha e propor ação de perdas e danos contra o liquidante.", "O documento trata das regras e procedimentos relacionados à transformação, incorporação, fusão e cisão de sociedades. A transformação não requer dissolução da sociedade e deve respeitar os preceitos do novo tipo societário. A incorporação envolve a absorção de uma ou mais sociedades por outra, que assume todos os direitos e obrigações. A fusão resulta na extinção das sociedades originais para formar uma nova sociedade. Os credores devem ser protegidos em todas essas operações e têm direito a contestar a operação no prazo de noventa dias.", "O Capítulo XI do Livro II do Direito de Empresa trata da Sociedade Dependente de Autorização. Neste capítulo, é estabelecido que a sociedade que dependa de autorização do Poder Executivo para funcionar será regida por este título, com a competência para a autorização sendo sempre do Poder Executivo federal. Além disso, caso não haja um prazo estipulado em lei ou ato do poder público, a autorização será considerada caduca se a sociedade não entrar em funcionamento nos doze meses seguintes à publicação. O Poder Executivo também tem a faculdade de cassar a autorização concedida a sociedade nacional ou estrangeira que infringir disposições de ordem pública ou praticar atos contrários aos fins declarados em seu estatuto.", "O documento trata das regras e procedimentos para a constituição de uma sociedade nacional no Brasil. Para que uma sociedade seja considerada nacional, é necessário que seja organizada de acordo com a lei brasileira e tenha sua sede de administração no país. Além disso, é necessário o consentimento unânime dos sócios ou acionistas para mudança de nacionalidade da sociedade. O requerimento de autorização para constituição de uma sociedade nacional deve ser acompanhado do contrato assinado por todos os sócios, ou dos documentos exigidos pela lei especial no caso de sociedade anônima. O Poder Executivo pode exigir alterações no contrato ou estatuto da sociedade, e recusar a autorização se a sociedade não atender às condições especificadas em lei. Após a expedição do decreto de autorização, a sociedade deve publicar os atos constitutivos em trinta dias no órgão oficial da União. As sociedades anônimas nacionais que dependem de autorização do Poder Executivo para funcionar não podem se constituir sem obtê-la, e devem juntar ao requerimento cópias do projeto do estatuto e do prospecto. Modificações no contrato ou estatuto da sociedade sujeita a autorização do Poder Executivo dependem de aprovação, exceto em casos de aumento do capital social.", "O documento trata das regras e procedimentos para uma sociedade estrangeira funcionar no Brasil, destacando a necessidade de autorização do Poder Executivo, a documentação necessária para solicitar essa autorização, as condições estabelecidas para a defesa dos interesses nacionais, a obrigação de ter um representante no Brasil, a necessidade de aprovação do Poder Executivo para qualquer modificação no contrato ou estatuto, a obrigatoriedade de publicações oficiais, a possibilidade de nacionalização da sociedade estrangeira e as condições para isso.", "O documento trata das disposições gerais relacionadas ao estabelecimento empresarial. Define o estabelecimento como um complexo de bens organizado para o exercício da empresa, podendo ser físico ou virtual. Discute a alienação, usufruto ou arrendamento do estabelecimento, exigindo a averbação e publicação para produzir efeitos perante terceiros. Estabelece a responsabilidade do adquirente pelos débitos anteriores à transferência e proíbe o alienante de concorrer com o adquirente por cinco anos. Aborda a sub-rogação nos contratos de exploração do estabelecimento e a cessão dos créditos relacionados ao estabelecimento transferido.", "O registro de empresas mercantis e sociedades simples é obrigatório e deve ser feito nas Juntas Comerciais ou no Registro Civil das Pessoas Jurídicas, conforme o caso. O registro deve ser solicitado pela pessoa responsável dentro do prazo estabelecido, e a falta de registro dentro do prazo pode acarretar em perdas e danos. O órgão responsável pelo registro deve verificar a regularidade das publicações exigidas por lei, e qualquer irregularidade deve ser notificada ao requerente para correção. Até que o registro seja efetivado, o ato não pode ser oposto a terceiros, a menos que estes tenham conhecimento do mesmo.", "O documento trata do nome empresarial, que pode ser uma firma ou denominação adotada para o exercício de uma empresa. Ele estabelece regras para a formação do nome empresarial, como a inclusão da palavra \"limitada\" para sociedades limitadas, a palavra \"cooperativa\" para sociedades cooperativas, entre outras. Também aborda a proteção do nome empresarial, a exclusividade do uso do nome no registro próprio e a possibilidade de cancelamento da inscrição do nome empresarial em caso de cessação da atividade ou liquidação da sociedade.", "Os artigos 1.169, 1.170 e 1.171 do Capítulo III do Título IV do Livro II do Direito de Empresa tratam das responsabilidades e limitações dos prepostos. O preposto não pode se fazer substituir sem autorização escrita, não pode negociar por conta própria ou de terceiros sem autorização expressa e é considerada perfeita a entrega de papéis, bens ou valores ao preposto se ele os recebeu sem protesto, salvo nos casos em que haja prazo para reclamação. Em caso de descumprimento dessas regras, o preposto pode responder pessoalmente pelos atos do substituto, por perdas e danos e ter os lucros da operação retidos pelo preponente.", "O artigo 1.172 define o gerente como um preposto permanente que exerce suas funções na sede da empresa ou em suas filiais. O artigo 1.173 estabelece que, na ausência de exigência de poderes especiais pela lei, o gerente tem autorização para realizar todos os atos necessários para o exercício de seus poderes. O artigo 1.174 determina que as limitações dos poderes do gerente devem ser registradas no Registro Público de Empresas Mercantis para serem válidas perante terceiros. O artigo 1.175 estabelece que o preponente é responsável pelos atos do gerente realizados em seu nome. O artigo 1.176 permite que o gerente represente o preponente em questões legais relacionadas às obrigações decorrentes de suas funções.", "O Artigo 1.177 estabelece que os assentos feitos nos livros ou fichas do preponente por prepostos responsáveis pela escrituração produzem os mesmos efeitos como se fossem feitos pelo próprio preponente, exceto em casos de má-fé. O parágrafo único determina que os prepostos são pessoalmente responsáveis por atos culposos perante o preponente e solidariamente responsáveis por atos dolosos perante terceiros. Já o Artigo 1.178 estabelece que os preponentes são responsáveis pelos atos dos prepostos praticados nos estabelecimentos da empresa, mesmo que não autorizados por escrito. No entanto, se os atos forem praticados fora do estabelecimento, só obrigam o preponente nos limites dos poderes conferidos por escrito.", "O artigo 1.179 do Livro II, Título IV, Capítulo IV do Direito de Empresa estabelece que o empresário e a sociedade empresária devem seguir um sistema de contabilidade, levantar anualmente o balanço patrimonial e o de resultado econômico, e autenticar os livros no Registro Público de Empresas Mercantis. Além disso, o artigo 1.180 determina a necessidade do Diário, que pode ser substituído por fichas, e o artigo 1.182 estabelece que a escrituração deve ser feita por um contabilista legalmente habilitado. O documento também aborda a forma de escrituração, a coleta de elementos para o inventário, a elaboração do balanço patrimonial e do de resultado econômico, e a conservação dos documentos relacionados à atividade empresarial.", "O Livro III trata do Direito das Coisas, com foco no Título I que aborda a posse. O Capítulo I discute a Posse e sua Classificação, definindo o possuidor como aquele que exerce os poderes inerentes à propriedade. São abordados também os conceitos de posse direta e indireta, detentor, posse indivisa, posse justa e posse de boa-fé. A posse de boa-fé pode ser perdida se o possuidor passar a ter conhecimento de que está possuindo indevidamente. A manutenção da posse mantém o mesmo caráter com o qual foi adquirida, a menos que haja prova em contrário.", "O documento trata da aquisição da posse, que ocorre no momento em que se torna possível exercer os poderes inerentes à propriedade em nome próprio. A posse pode ser adquirida pela própria pessoa interessada, por seu representante ou por terceiros sem mandato, dependendo de ratificação. A posse é transmitida aos herdeiros ou legatários do possuidor, e o sucessor universal continua com o direito à posse do antecessor. Não são considerados atos de posse a mera permissão ou tolerância, nem atos violentos ou clandestinos, a menos que a violência ou clandestinidade cessem. A posse de um imóvel presume a posse das coisas móveis nele presentes, até prova em contrário.", "O documento trata dos efeitos da posse, estabelecendo que o possuidor tem direito a ser mantido na posse em caso de turbação, restituído em caso de esbulho e protegido de violência iminente. Também aborda a possibilidade do possuidor se manter ou restituir por sua própria força, desde que seja feito logo e de forma proporcional. Além disso, discute a questão dos frutos, responsabilidades do possuidor de boa-fé e de má-fé, indenização das benfeitorias, entre outros aspectos relacionados à posse.", "Os artigos 1.223 e 1.224 do Livro III, Título I, Capítulo IV do Código Civil tratam da perda da posse. O primeiro artigo estabelece que a posse é perdida quando cessa o poder sobre o bem, mesmo que contra a vontade do possuidor. Já o segundo artigo determina que a posse só é considerada perdida para quem não presenciou o esbulho (ato de tirar a posse de alguém), quando, tendo notícia dele, se abstém de retornar a coisa, ou, tentando recuperá-la, é violentamente repelido.", "O documento apresenta os direitos reais sobre propriedades, incluindo propriedade, superfície, servidões, usufruto, uso, habitação, direito do promitente comprador do imóvel, penhor, hipoteca, anticrese, concessão de uso especial para fins de moradia, concessão de direito real de uso, laje e direitos oriundos da imissão provisória na posse. Também destaca que os direitos reais sobre coisas móveis são adquiridos com a tradição, enquanto os direitos reais sobre imóveis são adquiridos com o registro no Cartório de Registro de Imóveis, exceto em casos expressos no Código.", "O Artigo 1.228 do Livro III do Direito das Coisas trata da propriedade em geral, destacando que o proprietário tem o direito de usar, gozar e dispor da coisa, além do direito de reavê-la de quem a possua injustamente. O texto também ressalta que o direito de propriedade deve ser exercido de forma a preservar o meio ambiente e o patrimônio histórico e artístico, proibindo atos que não tragam benefícios ao proprietário ou que tenham a intenção de prejudicar terceiros. Além disso, aborda a possibilidade de desapropriação em casos de necessidade pública, interesse social ou perigo iminente, bem como a possibilidade de privação da propriedade em casos específicos. Já os artigos 1.229, 1.230, 1.231 e 1.232 tratam da extensão da propriedade do solo, abrangendo o espaço aéreo e subsolo correspondentes, as restrições em relação a recursos minerais e outros bens, a presunção de propriedade plena e exclusiva, e a titularidade dos frutos e produtos da coisa.", "O documento trata da descoberta de coisas perdidas, estabelecendo que quem encontrar algo perdido deve restituí-lo ao dono ou legítimo possuidor. Caso não conheça o dono, o descobridor deve tentar encontrá-lo e, se não conseguir, entregar a coisa à autoridade competente. O descobridor tem direito a uma recompensa não inferior a cinco por cento do valor da coisa e indenização pelas despesas feitas com sua conservação e transporte, a menos que o dono prefira abandoná-la. O descobridor responde por prejuízos causados ao proprietário se agir com dolo. Após sessenta dias sem que o dono se apresente, a coisa pode ser vendida em hasta pública, sendo o remanescente do valor pertencente ao Município onde a coisa foi encontrada. Em casos de valor diminuto, o Município pode abandonar a coisa em favor do descobridor.", "Os artigos apresentados tratam da usucapião, que é a forma de aquisição da propriedade de um imóvel por meio da posse prolongada e ininterrupta. O prazo para adquirir a propriedade varia de acordo com o tipo de imóvel e as condições estabelecidas em cada artigo. Além disso, são apresentadas as condições necessárias para que a usucapião seja reconhecida, como a posse contínua, pacífica, com justo título e de boa-fé. Também é mencionado que a declaração obtida por meio da usucapião serve como título para o registro no Cartório de Registro de Imóveis.", "O registro do título translativo no Registro de Imóveis é essencial para a transferência da propriedade imóvel entre vivos. Enquanto o título não for registrado, o alienante continua sendo considerado o dono do imóvel. O registro é eficaz a partir do momento em que o título é apresentado ao oficial do registro e prenotado no protocolo. Caso o registro não reflita a verdade, o interessado pode solicitar a retificação ou anulação. Após o cancelamento do registro, o proprietário original pode reivindicar o imóvel, independentemente da boa-fé ou do título do terceiro adquirente.", "O documento trata da aquisição da propriedade imóvel por acessão, que pode ocorrer por formação de ilhas, aluvião, avulsão, abandono de álveo, plantações ou construções. As regras para cada tipo de acessão são detalhadas, como a divisão de ilhas entre proprietários ribeirinhos, a propriedade de acréscimos formados por aluvião, a aquisição de terras destacadas por avulsão, a propriedade do álveo abandonado e as regras para construções e plantações em terrenos próprios ou alheios. São estabelecidas regras para casos de boa-fé e má-fé dos envolvidos, bem como as consequências e indenizações aplicáveis em cada situação.", "O Livro III, Título III, Capítulo III trata da aquisição da propriedade móvel, especificamente da usucapião. De acordo com o artigo 1.260, aquele que possuir uma coisa móvel como sua de forma contínua e incontestada por três anos, com justo título e boa-fé, adquirirá a propriedade. Já o artigo 1.261 estabelece que se a posse da coisa móvel se prolongar por cinco anos, ocorrerá a usucapião, independentemente de título ou boa-fé. O artigo 1.262 determina que as regras dos artigos 1.243 e 1.244 também se aplicam à usucapião de coisas móveis.", "O artigo 1.263 do Livro III, Título III, Capítulo III, Seção II do Código Civil estabelece que aquele que se apossar de uma coisa sem dono adquire a propriedade dela imediatamente, desde que essa ocupação não seja proibida por lei.", "O documento trata da aquisição da propriedade móvel através do achado do tesouro. Segundo o artigo 1.264, se o tesouro for antigo, oculto e sem memória do dono, será dividido igualmente entre o proprietário do prédio e quem o encontrou. Já o artigo 1.265 estabelece que o tesouro pertencerá inteiramente ao proprietário do prédio se for encontrado por ele ou por terceiro não autorizado. Por fim, o artigo 1.266 determina que se o tesouro for encontrado em terreno aforado, será dividido igualmente entre o descobridor e o enfiteuta, ou pertencerá inteiramente ao enfiteuta se ele mesmo for o descobridor.", "O texto trata da aquisição da propriedade móvel por meio da tradição, que é a entrega da coisa ao adquirente. A propriedade não se transfere antes da tradição, exceto em casos específicos como quando o transmitente continua a possuir a coisa pelo constituto possessório. Se a tradição for feita por alguém que não é proprietário, a propriedade não é transferida, a menos que o adquirente de boa-fé acredite que o alienante é o dono da coisa. A transferência da propriedade é considerada realizada se o adquirente estiver de boa-fé e o alienante adquirir a propriedade posteriormente. A tradição também não transfere a propriedade se tiver por título um negócio jurídico nulo.", "Os artigos 1.269 a 1.271 do Livro III, Título III, Capítulo III, Seção V do Direito das Coisas tratam da especificação, que é quando alguém trabalha em matéria-prima alheia e obtém uma espécie nova. O artigo 1.269 estabelece que o trabalhador será proprietário da nova espécie se não for possível retornar à forma anterior. O artigo 1.270 determina que se toda a matéria for alheia e não for possível retornar à forma anterior, a espécie nova pertencerá ao especificador de boa-fé. Por outro lado, se a espécie nova for obtida de má-fé, pertencerá ao dono da matéria-prima. O artigo 1.271 prevê que os prejudicados serão ressarcidos pelo dano sofrido, exceto no caso do especificador de má-fé quando a especificação for irredutível.", "O documento trata da aquisição da propriedade móvel por meio da confusão, comissão e adjunção de coisas pertencentes a diversos donos. Caso as coisas possam ser separadas sem deterioração, continuam a pertencer aos respectivos donos. Se não for possível separá-las ou se houver dispêndio excessivo, o todo permanece indiviso, cabendo a cada dono uma parte proporcional ao valor da coisa que contribuiu. Se uma das coisas pode ser considerada principal, o dono dela será considerado dono do todo, indenizando os outros. Em caso de má-fé na confusão, a outra parte pode escolher adquirir a propriedade do todo pagando o que não é seu, ou renunciar ao que lhe pertence e ser indenizada. Se a união de matérias de natureza diversa formar uma espécie nova, aplicam-se as mesmas normas.", "O documento trata da perda da propriedade, listando as causas pelas quais isso pode ocorrer, como alienação, renúncia, abandono, perecimento da coisa e desapropriação. No caso de imóveis urbanos abandonados pelo proprietário, se não estiverem na posse de outra pessoa, podem ser arrecadados como bens vagos e passar à propriedade do Município ou do Distrito Federal após três anos. Para imóveis rurais abandonados, a propriedade pode passar à União após o mesmo período. A intenção de abandonar o imóvel será presumida quando o proprietário deixar de pagar os impostos.", "O documento trata dos direitos de vizinhança relacionados ao uso anormal da propriedade. O proprietário ou possuidor de um prédio tem o direito de fazer cessar interferências prejudiciais à segurança, sossego e saúde dos que o habitam causadas pela propriedade vizinha. Proíbem-se as interferências levando em consideração a natureza da utilização, localização do prédio e limites de tolerância dos moradores da vizinhança. O direito não prevalece se as interferências forem justificadas por interesse público, devendo o causador pagar indenização ao vizinho. Mesmo que devam ser toleradas por decisão judicial, o vizinho pode exigir a redução ou eliminação das interferências. O proprietário ou possuidor pode exigir a demolição ou reparação do prédio vizinho em caso de ameaça de ruína, assim como garantias contra prejuízos em caso de obras realizadas por terceiros.", "O documento trata dos direitos de vizinhança relacionados às árvores limítrofes. O artigo 1.282 estabelece que a árvore cujo tronco está na linha divisória pertence em comum aos donos dos prédios confinantes. O artigo 1.283 permite que o proprietário do terreno invadido corte as raízes e os ramos que ultrapassarem a estrema do prédio. Já o artigo 1.284 determina que os frutos caídos de árvore do terreno vizinho pertencem ao dono do solo onde caíram, se este for de propriedade particular.", "O artigo 1.285 do Livro III, Título III, Capítulo V, Seção III do Código Civil trata da passagem forçada, que permite ao dono de um prédio sem acesso a via pública, nascente ou porto, constranger o vizinho a lhe dar passagem mediante pagamento de indenização. O rumo da passagem será judicialmente fixado, se necessário. O constrangimento recairá sobre o vizinho cujo imóvel mais natural e facilmente se prestar à passagem. Em caso de alienação parcial do prédio, o proprietário da parte que perdeu o acesso deve tolerar a passagem. Mesmo que existisse uma passagem antes da alienação, o proprietário do imóvel vizinho não pode ser constrangido a dar outra passagem.", "O Artigo 1.286 estabelece que o proprietário é obrigado a permitir a passagem de cabos, tubulações e condutos subterrâneos de utilidade pública em seu imóvel, desde que receba uma indenização que compense a desvalorização da área remanescente. O Parágrafo único permite que o proprietário prejudicado exija que a instalação seja feita de forma menos prejudicial ao seu imóvel e que, posteriormente, seja removida para outro local às suas custas. Já o Artigo 1.287 prevê que, caso as instalações representem um risco grave, o proprietário do imóvel afetado pode exigir a realização de obras de segurança.", "O documento trata dos direitos de vizinhança relacionados às águas, estabelecendo regras para o fluxo natural das águas entre propriedades superiores e inferiores, bem como para o desvio de águas artificiais. Também aborda a construção de barragens, açudes e aquedutos, estabelecendo regras para indenização de danos causados a propriedades vizinhas. Além disso, prevê a possibilidade de construção de canais através de propriedades alheias, desde que haja indenização aos proprietários prejudicados. O documento também estabelece regras para a construção e uso de aquedutos, bem como para o uso de águas supérfluas.", "O proprietário tem o direito de cercar, murar, valar ou tapar seu prédio, urbano ou rural, e pode obrigar o confinante a demarcar os limites entre os dois prédios, dividindo as despesas proporcionalmente. Os intervalos, muros, cercas e tapumes divisórios são presumidos pertencer a ambos os proprietários, que devem contribuir igualmente para sua construção e manutenção. As sebes vivas, árvores ou plantas que servem como marco divisório só podem ser removidas com acordo mútuo. A construção de tapumes especiais para impedir a passagem de animais pode ser exigida do responsável, sem a obrigação do proprietário contribuir para as despesas. Em caso de limites confusos, eles serão determinados com base na posse justa, e se não for possível a divisão conveniente, o terreno contestado será dividido igualmente ou adjudicado a um dos prédios com indenização ao outro.", "O documento trata dos direitos de vizinhança relacionados ao direito de construir. O proprietário pode construir em seu terreno, desde que respeite os direitos dos vizinhos e os regulamentos administrativos. São estabelecidas regras sobre o despejo de águas, abertura de janelas, terraços e varandas próximos ao terreno vizinho, além de limitações para construções em zonas rurais e urbanas. Também são abordados temas como a construção de paredes divisórias, obras que possam prejudicar a água do poço ou nascente do vizinho, e a responsabilidade por danos causados durante obras. O documento também estabelece que o vizinho pode entrar no imóvel do outro para realizar reparos ou buscar objetos, desde que haja aviso prévio. Em caso de dano, o prejudicado tem direito a ressarcimento.", "O documento trata do condomínio geral, especificamente do condomínio voluntário. Ele estabelece os direitos e deveres dos condôminos, como o direito de usar a coisa comum conforme sua destinação, contribuir para as despesas de conservação, e a obrigação de responder pelos frutos que percebeu da coisa e pelo dano que causou. Também aborda a possibilidade de renúncia à parte ideal, a divisão da coisa comum, a administração do condomínio e a forma de tomar decisões por maioria. Além disso, trata da divisão do condomínio, incluindo a possibilidade de venda da coisa indivisível e a preferência na venda entre condôminos e estranhos.", "O condomínio por meação de paredes, cercas, muros e valas é regulado pelos artigos 1.327 a 1.330 do Código Civil. O proprietário que tem direito a estremar um imóvel com essas estruturas também tem direito a adquirir meação na parede, muro, valado ou cerca do vizinho, pagando metade do valor da obra e do terreno ocupado por ela. Se os proprietários não concordarem com o preço da obra, peritos podem ser contratados para arbitrar o valor. Enquanto o valor da meação não for pago ou depositado, nenhum dos proprietários pode fazer uso da estrutura divisória.", "O documento trata das disposições gerais sobre condomínio edilício, onde partes de edificações podem ser propriedade exclusiva ou comum dos condôminos. As partes suscetíveis de utilização independente são de propriedade exclusiva, enquanto o solo, estrutura do prédio, entre outros, são de uso comum. O condomínio edilício é instituído por ato registrado no Cartório de Registro de Imóveis, com discriminação das unidades, fração ideal e destinação. A convenção do condomínio deve ser subscrita por dois terços dos condôminos e registrada para ser oponível a terceiros. São estabelecidos direitos e deveres dos condôminos, como contribuir para as despesas, não realizar obras que comprometam a segurança, entre outros. Também são abordadas questões como multas por descumprimento de deveres, realização de obras no condomínio, seguro da edificação e responsabilidade por débitos do antigo proprietário.", "O documento trata das regras e responsabilidades relacionadas à administração do condomínio edilício. O síndico é escolhido pela assembleia dos condôminos e tem diversas atribuições, como convocar reuniões, representar o condomínio, elaborar orçamentos, cobrar contribuições, entre outras. A destituição do síndico pode ocorrer em casos de irregularidades. As assembleias devem ser convocadas anualmente para aprovar orçamentos, contribuições, prestar contas e eleger substitutos. Alterações na convenção do condomínio exigem aprovação de dois terços dos condôminos. As deliberações em assembleias são tomadas por maioria de votos dos presentes, com votos proporcionais às frações ideais de cada condômino. Também é mencionada a possibilidade de realização de assembleias de forma eletrônica, desde que não seja vedada na convenção e sejam preservados os direitos dos condôminos. Assembleias extraordinárias podem ser convocadas pelo síndico ou por um quarto dos condôminos, e pode haver um conselho fiscal para dar parecer sobre as contas do síndico.", "O documento trata sobre a multipropriedade em condomínios edilícios, estabelecendo direitos e obrigações dos multiproprietários, regras para administração da multipropriedade, transferência da multipropriedade, entre outros aspectos. Também aborda a possibilidade de instituição da multipropriedade em condomínios edilícios, com a necessidade de previsão no instrumento de instituição ou deliberação da maioria absoluta dos condôminos. Além disso, são estabelecidas regras específicas para a administração da multipropriedade, incluindo a figura do administrador profissional e a possibilidade de adjudicação ao condomínio edilício em caso de inadimplemento.", "O Artigo 1.359 estabelece que, quando a propriedade é resolvida por condição ou termo, os direitos reais concedidos também são resolvidos e o proprietário pode reivindicar a coisa de quem a possua. Já o Artigo 1.360 determina que, se a propriedade for resolvida por outra causa, o possuidor anterior à resolução será considerado proprietário, cabendo à pessoa em cujo benefício ocorreu a resolução ação para reaver a coisa ou seu valor.", "O Capítulo IX do Título III do Livro III trata da propriedade fiduciária, que é a transferência de propriedade resolúvel de uma coisa móvel infungível do devedor para o credor como garantia. O contrato que serve de título para a propriedade fiduciária deve conter informações como o total da dívida, prazo de pagamento, taxa de juros e descrição da coisa transferida. O devedor pode usar a coisa até o vencimento da dívida, mas se não pagar, o credor pode vender a coisa para terceiros e aplicar o valor no pagamento da dívida. A propriedade fiduciária não se equipara à propriedade plena. O terceiro que pagar a dívida se sub-roga no crédito e na propriedade fiduciária. Existem outras espécies de propriedade fiduciária que se submetem a legislação especial. O Capítulo X trata do fundo de investimento, que é uma comunhão de recursos destinada à aplicação em ativos financeiros, bens e direitos. O regulamento do fundo pode estabelecer limitações de responsabilidade para investidores e prestadores de serviços, bem como classes de cotas com direitos distintos. Os fundos de investimento respondem diretamente por suas obrigações legais e contratuais, e os prestadores de serviço respondem por prejuízos causados com dolo ou má-fé. Em caso de insolvência, aplicam-se as regras previstas no Código Civil. Fundos de investimento específicos devem seguir as disposições do Capítulo.", "O Livro III, Título IV do Código Civil trata do Direito das Coisas, especificamente da Superfície. O proprietário pode conceder a outrem o direito de construir ou plantar em seu terreno por tempo determinado, mediante escritura pública registrada no Cartório de Registro de Imóveis. O direito de superfície pode ser gratuito ou oneroso, e o superficiário é responsável pelos encargos e tributos do imóvel. O direito de superfície pode ser transferido a terceiros e, em caso de alienação do imóvel, o superficiário ou proprietário têm direito de preferência. A concessão pode ser resolvida se o superficiário der destinação diversa ao terreno, e extinta a concessão, o proprietário passa a ter a propriedade plena. Em caso de desapropriação, a indenização cabe ao proprietário e ao superficiário. O direito de superfície de pessoa jurídica de direito público interno segue as regras do Código Civil, salvo disposição em lei especial.", "O Livro III trata do Direito das Coisas, especificamente das Servidões. O Capítulo I aborda a Constituição das Servidões, onde se destaca que a servidão proporciona utilidade para o prédio dominante e grava o prédio serviente, pertencente a outro dono. A servidão pode ser constituída mediante declaração expressa dos proprietários ou por testamento, e deve ser registrada no Cartório de Registro de Imóveis. Além disso, o exercício incontestado e contínuo de uma servidão aparente por dez anos autoriza o interessado a registrá-la em seu nome, valendo como título a sentença que julgar consumada a usucapião. Se o possuidor não tiver título, o prazo da usucapião será de vinte anos.", "O documento trata do exercício das servidões, onde o dono de uma servidão pode realizar obras necessárias à sua conservação e uso, sendo as despesas rateadas entre os donos dos prédios envolvidos. As obras devem ser feitas pelo dono do prédio dominante, a menos que o título disponha o contrário. O dono do prédio serviente não pode impedir o exercício legítimo da servidão. A servidão pode ser removida de um local para outro, desde que não prejudique as vantagens do prédio dominante. O exercício da servidão deve se restringir às necessidades do prédio dominante, sem ampliação para outros fins. As servidões prediais são indivisíveis e continuam a gravar cada parte dos prédios envolvidos, a menos que se apliquem apenas a uma parte específica.", "O documento trata da extinção das servidões, estabelecendo que uma vez registrada, a servidão só se extingue com o cancelamento. O dono do prédio serviente tem direito ao cancelamento do registro, mesmo que o dono do prédio dominante se oponha, em casos como renúncia do titular, cessação da utilidade para o prédio dominante ou resgate da servidão. A servidão também pode ser extinta pela reunião dos dois prédios sob o mesmo dono, pela supressão das obras ou pelo não uso por dez anos.", "O usufruto pode recair em um ou mais bens, móveis ou imóveis, em um patrimônio inteiro ou parte deste, abrangendo os frutos e utilidades. O usufruto de imóveis deve ser registrado no Cartório de Registro de Imóveis, exceto quando resultar de usucapião. O usufruto se estende aos acessórios da coisa e seus acrescidos, com regras específicas para coisas consumíveis, florestas e recursos minerais. O usufrutuário tem direito a parte do tesouro achado por outrem e ao preço pago pelo vizinho do prédio usufruído para obter meação em estruturas. O usufruto não pode ser transferido por alienação, mas seu exercício pode ser cedido por título gratuito ou oneroso.", "O documento trata dos direitos do usufrutuário em relação ao usufruto, incluindo o direito à posse, uso, administração e percepção dos frutos, bem como o direito de perceber os frutos de títulos de crédito e cobrar as respectivas dívidas. Também aborda a questão dos frutos naturais e das crias dos animais, que pertencem ao usufrutuário, e dos frutos civis, que pertencem ao proprietário. Além disso, destaca que o usufrutuário pode usufruir do prédio em pessoa ou mediante arrendamento, mas não pode mudar sua destinação econômica sem autorização do proprietário.", "O documento trata dos deveres do usufrutuário em relação à conservação dos bens recebidos em usufruto. O usufrutuário deve inventariar os bens antes de assumir o usufruto, dar caução se exigido pelo dono, arcar com despesas ordinárias de conservação, pagar prestações e tributos, entre outros deveres. O documento também aborda questões como reparações, seguros, reconstrução de edifícios e desapropriação. Em caso de descumprimento dos deveres, o usufrutuário pode perder o direito de administrar o usufruto.", "O usufruto pode ser extinto de várias formas, como pela renúncia ou morte do usufrutuário, pelo termo de sua duração, pela extinção da pessoa jurídica em favor de quem foi constituído, pela cessação do motivo de sua origem, pela destruição da coisa, pela consolidação, pela culpa do usufrutuário, pelo não uso ou fruição da coisa, entre outras. Quando o usufruto é constituído em favor de duas ou mais pessoas, a parte de cada uma que falecer será extinta, a menos que haja uma estipulação expressa indicando que o quinhão desses couber ao sobrevivente.", "O Livro III, Título VII trata do Direito das Coisas, especificamente do uso. O artigo 1.412 estabelece que o usuário pode usar a coisa e colher seus frutos conforme suas necessidades e as de sua família. As necessidades pessoais do usuário são avaliadas de acordo com sua condição social e local de residência, e as necessidades da família incluem as do cônjuge, filhos solteiros e pessoas do serviço doméstico. O artigo 1.413 determina que as disposições relativas ao usufruto são aplicáveis ao uso, desde que não sejam contrárias à sua natureza.", "O Livro III trata do Direito das Coisas, e o Título VIII aborda o tema da Habitação. O artigo 1.414 estabelece que o titular do direito de habitar gratuitamente uma casa alheia não pode alugá-la ou emprestá-la, apenas ocupá-la com sua família. Já o artigo 1.415 determina que, se o direito de habitação for conferido a mais de uma pessoa, quem habitar a casa sozinho não precisa pagar aluguel aos outros titulares, mas não pode impedi-los de exercer o direito de habitá-la. Por fim, o artigo 1.416 estabelece que as disposições relativas ao usufruto são aplicáveis à habitação, desde que não sejam contrárias à sua natureza.", "O documento trata do direito do promitente comprador em uma promessa de compra e venda de imóvel. O promitente comprador adquire direito real à aquisição do imóvel mediante a promessa de compra e venda registrada no Cartório de Registro de Imóveis. Ele pode exigir a outorga da escritura definitiva de compra e venda do vendedor ou terceiros, e em caso de recusa, pode requerer ao juiz a adjudicação do imóvel.", "O documento trata das disposições gerais sobre penhor, hipoteca e anticrese. Estabelece que o bem dado em garantia fica sujeito ao cumprimento da obrigação, que apenas quem pode alienar pode empenhar, hipotecar ou dar em anticrese, e que a propriedade superveniente torna eficaz as garantias reais. Também aborda a possibilidade de excussão da coisa dada em garantia pelo credor hipotecário ou pignoratício, o direito do credor anticrético de reter o bem até o pagamento da dívida, e as condições que devem constar nos contratos de penhor, anticrese ou hipoteca. Além disso, menciona as situações em que a dívida considera-se vencida, as regras para casos de perecimento da coisa dada em garantia, a impossibilidade de remir parcialmente o penhor ou a hipoteca pelos sucessores do devedor, e a responsabilidade pessoal do devedor pelo restante da dívida caso o produto da excussão não seja suficiente.", "O penhor é constituído pela transferência da posse de uma coisa móvel em garantia de um débito. No penhor rural, industrial, mercantil e de veículos, as coisas empenhadas continuam em posse do devedor. O instrumento do penhor deve ser registrado, sendo o do penhor comum registrado no Cartório de Títulos e Documentos.", "O credor pignoratício tem direito à posse da coisa empenhada, à retenção dela até ser indenizado das despesas justificadas, ao ressarcimento de prejuízos por vícios na coisa, à execução judicial ou venda amigável, à apropriação dos frutos da coisa, à venda antecipada com autorização judicial em caso de perda ou deterioração da coisa, e não pode ser obrigado a devolver a coisa empenhada antes de ser integralmente pago, podendo o juiz determinar a venda de parte da coisa para pagamento do credor.", "O credor pignoratício tem várias obrigações, incluindo a custódia da coisa empenhada, a defesa da posse da mesma, a imputação dos frutos nas despesas e na dívida garantida, a restituição da coisa uma vez paga a dívida e a entrega do que sobeje do preço após o pagamento da dívida.", "O documento trata da extinção do penhor, que ocorre quando a obrigação é extinta, a coisa perece, o credor renuncia, as qualidades de credor e dono se confundem na mesma pessoa, ou quando há adjudicação judicial, remissão ou venda da coisa empenhada. A renúncia do credor é presumida em certas situações, e se houver confusão apenas em parte da dívida, o penhor subsiste quanto ao restante. A extinção do penhor produz efeitos após o cancelamento do registro.", "O penhor rural é constituído por meio de instrumento público ou particular registrado no Cartório de Registro de Imóveis. O devedor pode emitir uma cédula rural pignoratícia se prometer pagar a dívida em dinheiro. O penhor agrícola e pecuário não podem ter prazos superiores aos das obrigações garantidas. A garantia permanece mesmo após o vencimento dos prazos. O credor tem direito de verificar o estado das coisas empenhadas. O penhor agrícola pode recair sobre máquinas, colheitas, frutos, lenha, carvão e animais. O penhor pecuário abrange animais de atividades pastoris, agrícolas ou de lacticínios. O devedor não pode alienar os animais empenhados sem consentimento do credor. Os animais comprados para substituir os mortos ficam sub-rogados no penhor.", "O documento trata do penhor industrial e mercantil, que pode ser realizado em máquinas, aparelhos, materiais, animais e outros bens utilizados na indústria. O penhor deve ser formalizado por meio de instrumento público ou particular registrado no Cartório de Registro de Imóveis. O devedor não pode alterar as coisas empenhadas sem o consentimento do credor, e o credor tem o direito de verificar o estado dos bens empenhados. Em caso de alienação das coisas empenhadas, o devedor deve repor outros bens da mesma natureza.", "O documento trata do penhor de direitos e títulos de crédito, estabelecendo que podem ser objeto de penhor direitos sobre coisas móveis. Para constituir o penhor de direito é necessário um instrumento público ou particular registrado no Registro de Títulos e Documentos. O credor pignoratício deve praticar os atos necessários à conservação do direito empenhado e cobrar os juros e prestações acessórias. O titular do crédito empenhado só pode receber o pagamento com a anuência do credor pignoratício. O documento também aborda a questão do penhor de título de crédito, estabelecendo os direitos e responsabilidades do credor nesse caso.", "O documento trata do penhor de veículos, que podem ser objeto de penhor para garantir dívidas. O penhor é constituído por meio de instrumento registrado no Cartório de Títulos e Documentos do domicílio do devedor. O devedor pode emitir uma cédula de crédito para garantir o pagamento da dívida. O credor tem o direito de verificar o estado do veículo empenhado e a alienação ou mudança do veículo sem comunicação ao credor resulta no vencimento antecipado da dívida. O penhor de veículos só pode ser convencionado por no máximo dois anos, podendo ser prorrogado por igual período.", "O artigo 1.467 do Capítulo II do Título X do Livro III do Direito das Coisas trata do penhor legal, onde são listados os credores pignoratícios, como hospedeiros e fornecedores de pousada ou alimento, bem como o dono do prédio rústico ou urbano. O artigo 1.468 estabelece que a conta das dívidas deve ser extraída conforme tabela de preços prévia e ostensivamente exposta, sob pena de nulidade do penhor. O artigo 1.469 permite que o credor tome em garantia um ou mais objetos até o valor da dívida. O artigo 1.470 autoriza os credores a fazer efetivo o penhor antes de recorrerem à autoridade judiciária, em caso de perigo na demora. O artigo 1.471 determina que o credor deve requerer a homologação judicial do penhor após tomá-lo. Já o artigo 1.472 permite que o locatário impeça a constituição do penhor mediante caução idônea.", "O documento apresenta as disposições gerais sobre hipoteca, incluindo os tipos de bens que podem ser objeto de hipoteca, como imóveis, domínio direto, domínio útil, estradas de ferro, recursos naturais, navios, aeronaves, direito de uso especial para fins de moradia, direito real de uso, propriedade superficiária, entre outros. Também aborda questões como a extensão da hipoteca para garantir novas obrigações, a possibilidade de desmembramento do ônus em caso de loteamento ou condomínio edilício, e a remissão do imóvel hipotecado pelo adquirente. Além disso, são apresentadas regras sobre a execução da hipoteca, a sub-rogação de direitos do credor hipotecário, a nulidade de cláusulas que proíbem a alienação do imóvel hipotecado, entre outros aspectos relacionados ao tema.", "O artigo 1.489 do Capítulo III do Título X do Livro III trata da hipoteca legal, conferindo hipoteca a pessoas de direito público interno, filhos em caso de novo casamento dos pais, ao ofendido ou seus herdeiros em caso de delito, ao co-herdeiro para garantia do seu quinhão na partilha, e ao credor sobre imóvel arrematado. Já o artigo 1.490 permite ao credor da hipoteca legal exigir reforço com outros imóveis em caso de insuficiência, e o artigo 1.491 prevê a possibilidade de substituição da hipoteca legal por caução de títulos da dívida pública ou outra garantia a critério do juiz, a pedido do devedor.", "O registro da hipoteca deve ser feito no cartório do lugar do imóvel, ou de cada um deles, se o título se referir a mais de um. Os interessados devem requerer o registro da hipoteca, seguindo a ordem de numeração no protocolo para determinar a prioridade e preferência entre as hipotecas. Caso haja dúvida sobre a legalidade do registro, o oficial fará a prenotação do pedido e aguardará a decisão em até noventa dias. As hipotecas legais devem ser registradas e especializadas, sendo responsabilidade de quem está obrigado a prestar a garantia, com possibilidade de os interessados promoverem a inscrição ou solicitar ao Ministério Público. O registro da hipoteca vale enquanto a obrigação perdurar, mas a especialização deve ser renovada após vinte anos.", "O documento trata da extinção da hipoteca, que pode ocorrer pela extinção da obrigação principal, pelo perecimento da coisa, pela resolução da propriedade, pela renúncia do credor, pela remição, pela arrematação ou adjudicação. Além disso, a hipoteca também pode ser extinta com a averbação do cancelamento do registro no Registro de Imóveis. No entanto, a arrematação ou adjudicação não extinguirá a hipoteca sem a notificação judicial dos credores hipotecários que não são partes na execução.", "O documento trata das regras relacionadas à hipoteca de vias férreas. As hipotecas sobre estradas de ferro devem ser registradas no município da estação inicial da linha. Os credores hipotecários não podem impedir a exploração da linha ou as modificações feitas pela administração. A hipoteca é limitada à linha especificada na escritura e ao material de exploração, mas os credores podem se opor a vendas ou fusões que enfraqueçam a garantia do débito. Na execução da hipoteca, o representante da União ou do Estado deve ser intimado para a possibilidade de remir a estrada de ferro hipotecada.", "O primeiro documento trata da Anticrese, que é a possibilidade do devedor ceder ao credor o direito de perceber os frutos e rendimentos de um imóvel em compensação pela dívida. O credor anticrético pode administrar os bens dados em anticrese, mas deve apresentar balanço anual de sua administração. O documento também aborda a possibilidade de o devedor impugnar o balanço e requerer a transformação em arrendamento. Além disso, o credor anticrético responde por deteriorações no imóvel por sua culpa e pelos frutos que deixar de perceber por negligência. O documento também menciona a possibilidade de o adquirente dos bens dados em anticrese remi-los antes do vencimento da dívida.\n\nO segundo documento trata do direito real de laje, que permite ao proprietário de uma construção-base ceder a superfície superior ou inferior de sua construção para que o titular da laje mantenha uma unidade distinta. O titular do direito real de laje responde pelos encargos e tributos de sua unidade e pode usar, gozar e dispor dela. O documento também aborda a partilha de despesas entre o proprietário da construção-base e o titular da laje, bem como o direito de preferência dos titulares da construção-base e da laje em caso de alienação de unidades sobrepostas. Além disso, a ruína da construção-base implica na extinção do direito real de laje, exceto se o direito tiver sido instituído sobre o subsolo ou se a construção-base for reconstruída dentro de cinco anos.", "O Livro IV trata do Direito de Família, com foco no Direito Pessoal. O Título I aborda o tema do Casamento.", "O Livro IV trata do Direito de Família, com foco no Direito Pessoal. O casamento estabelece comunhão plena de vida, com igualdade de direitos e deveres dos cônjuges. A celebração do casamento é civil e gratuita, sendo isenta de selos, emolumentos e custas para pessoas declaradas pobres. É proibido a qualquer pessoa interferir na comunhão de vida estabelecida pela família. O casamento se realiza quando o homem e a mulher manifestam sua vontade perante o juiz. O casamento religioso equipara-se ao civil se atender às exigências da lei e for registrado, produzindo efeitos a partir da data da celebração. O registro do casamento religioso deve ser feito dentro de noventa dias da realização, seguindo os mesmos requisitos do casamento civil. O casamento religioso celebrado sem as formalidades exigidas terá efeitos civis se for registrado no registro civil, observando o prazo estabelecido. Será nulo o registro civil do casamento religioso se um dos cônjuges já estiver casado civilmente com outra pessoa.", "O Livro IV, Título I, Capítulo II do Direito de Família trata da capacidade para o casamento. De acordo com o artigo 1.517, homens e mulheres com dezesseis anos podem se casar, desde que tenham autorização de ambos os pais ou representantes legais. Em caso de divergência entre os pais, aplica-se o disposto no artigo 1.631. O artigo 1.518 permite que os pais ou tutores revoguem a autorização até a celebração do casamento. Já o artigo 1.519 prevê que a denegação do consentimento injusta pode ser suprida pelo juiz. Por fim, o artigo 1.520 estabelece que não será permitido o casamento de quem não atingiu a idade núbil, conforme o disposto no artigo 1.517.", "O Livro IV, Título I, Capítulo III do Direito de Família trata dos impedimentos para o casamento. O artigo 1.521 lista as pessoas que não podem se casar, incluindo ascendentes com descendentes, afins em linha reta, irmãos, pessoas casadas, entre outros. O artigo 1.522 estabelece que os impedimentos podem ser contestados por qualquer pessoa capaz antes da celebração do casamento, e que o juiz ou oficial de registro deve declarar qualquer impedimento que tenha conhecimento.", "O Artigo 1.523 do Livro IV, Título I, Capítulo IV do Direito de Família trata das causas suspensivas para o casamento, que incluem a necessidade de inventário e partilha de bens do cônjuge falecido, um período de espera após viuvez ou dissolução do casamento, homologação da partilha de bens em caso de divórcio, e a proibição de casamento entre tutor/curador e seus descendentes/ascendentes/irmãos/cunhados/sobrinhos com a pessoa tutelada/curatelada. O parágrafo único permite que os nubentes solicitem ao juiz a dispensa das causas suspensivas em casos específicos. O Artigo 1.524 permite que parentes em linha reta de um dos nubentes e colaterais em segundo grau possam arguir as causas suspensivas.", "O processo de habilitação para o casamento requer que os nubentes apresentem diversos documentos, como certidão de nascimento, autorização por escrito de pessoas sob sua dependência legal, declaração de testemunhas, entre outros. A habilitação é feita pessoalmente perante o oficial do Registro Civil, com a audiência do Ministério Público, podendo ser submetida ao juiz em caso de impugnação. Após a documentação estar em ordem, é extraído um edital que deve ser afixado e publicado. O oficial do registro deve esclarecer os nubentes sobre os fatos que podem invalidar o casamento e os regimes de bens. Impedimentos e causas suspensivas devem ser opostos em declaração escrita, podendo os nubentes requerer prazo para fazer prova contrária. Após cumpridas as formalidades e verificada a inexistência de fato obstativo, o oficial extrairá o certificado de habilitação, que terá validade de noventa dias.", "O documento trata da celebração do casamento, estabelecendo as regras e procedimentos a serem seguidos. O casamento deve ser realizado em local previamente designado, com a presença de pelo menos duas testemunhas. Após a solenidade, um registro do casamento deve ser feito, contendo informações sobre os cônjuges, seus pais, as testemunhas, entre outros detalhes. O documento também aborda situações específicas, como a celebração do casamento em caso de moléstia grave de um dos nubentes, e a possibilidade de celebrar o casamento por procuração. Além disso, são estabelecidas as formalidades a serem seguidas em caso de casamento em iminente risco de vida de um dos contraentes.", "O casamento celebrado no Brasil é comprovado pela certidão do registro civil, mas em caso de falta ou perda do registro, outras formas de prova são admitidas. O casamento de brasileiro celebrado no exterior deve ser registrado em até 180 dias após o retorno ao Brasil. O casamento de pessoas que não podem manifestar vontade ou faleceram não pode ser contestado em prejuízo dos filhos, a menos que haja prova de que uma das partes já era casada. A prova da celebração do casamento por meio de processo judicial resulta no registro da sentença no livro do Registro Civil, produzindo todos os efeitos civis desde a data do casamento. Em caso de dúvida entre as provas a favor e contra o casamento, a decisão será a favor do casamento se os cônjuges viverem ou tiverem vivido na posse do estado de casados.", "O documento trata da invalidade do casamento, estabelecendo as condições em que um casamento pode ser considerado nulo ou anulável. São listados os motivos pelos quais um casamento pode ser anulado, como idade mínima não atingida, consentimento viciado, incompetência da autoridade celebrante, entre outros. Também são detalhados os prazos para ação de anulação do casamento, bem como as consequências da anulação, como a retroatividade da sentença e as obrigações do cônjuge culpado. O documento também aborda a possibilidade de separação de corpos antes da ação de nulidade do casamento.", "O documento apresenta os deveres e direitos dos cônjuges no casamento, incluindo a fidelidade recíproca, vida em comum, assistência mútua, sustento e educação dos filhos, respeito mútuo, entre outros. Também destaca a liberdade de escolha do planejamento familiar, a colaboração na direção da sociedade conjugal, a obrigação de contribuir para o sustento da família e a possibilidade de escolha do domicílio do casal. Em casos específicos, como ausência prolongada de um dos cônjuges, o outro assume a direção da família e a administração dos bens.", "O documento trata da dissolução da sociedade conjugal e do vínculo conjugal, destacando que a sociedade conjugal pode terminar pela morte de um dos cônjuges, nulidade ou anulação do casamento, separação judicial ou divórcio. São apresentadas as condições e motivos para a separação judicial, bem como a possibilidade de reconciliação a qualquer momento. O divórcio não modifica os direitos e deveres dos pais em relação aos filhos, e pode ser concedido sem prévia partilha de bens. O pedido de divórcio compete apenas aos cônjuges, podendo ser feito por um representante legal em caso de incapacidade.", "O documento trata da guarda dos filhos em casos de separação, divórcio ou dissolução de união estável. A guarda pode ser unilateral, atribuída a um dos genitores, ou compartilhada, com responsabilização conjunta dos pais. O tempo de convívio deve ser dividido de forma equilibrada. Em casos de falta de acordo entre os pais, a guarda compartilhada será aplicada, exceto em casos de risco de violência doméstica. O juiz pode estabelecer as atribuições dos pais e os períodos de convivência com base em orientação técnica. O descumprimento da guarda pode implicar na redução de prerrogativas. Em casos de invalidade do casamento, a situação dos filhos será regulada de acordo com as disposições legais. Os pais têm direito de visitar e fiscalizar a manutenção e educação dos filhos, e esse direito pode se estender aos avós. As disposições relativas à guarda e prestação de alimentos se aplicam também aos maiores incapazes.", "O documento apresenta as disposições gerais sobre o parentesco no Direito de Família. Define parentes em linha reta e colateral, distingue parentesco natural e civil, estabelece como contar os graus de parentesco e menciona o parentesco por afinidade, que se limita aos ascendentes, descendentes e irmãos do cônjuge ou companheiro, não se extinguindo na linha reta com a dissolução do casamento ou união estável.", "O documento trata do direito de filiação, estabelecendo que os filhos, independentemente de serem concebidos dentro ou fora do casamento, têm os mesmos direitos e qualificações. Também são apresentadas as presunções de filiação, como a concepção durante o casamento e em casos de inseminação artificial. Além disso, são abordadas questões como impotência do cônjuge, contestação da paternidade, prova de filiação e ação de prova de filiação. O documento ressalta que a filiação pode ser comprovada por meio da certidão de nascimento registrada no Registro Civil, e em casos de falta ou defeito do registro, por outros meios admitidos em direito. A ação de prova de filiação pode ser iniciada pelo filho e, em caso de sua morte, pelos herdeiros.", "O reconhecimento dos filhos havidos fora do casamento é irrevogável e pode ser feito pelos pais conjunta ou separadamente. O reconhecimento pode ser feito no registro de nascimento, por escritura pública, por testamento ou por manifestação direta perante o juiz. O reconhecimento não pode ser revogado, nem mesmo em testamento. O filho reconhecido fica sob a guarda do genitor que o reconheceu, e em caso de desacordo, sob a guarda de quem melhor atender aos interesses do menor. O filho maior não pode ser reconhecido sem seu consentimento, e o menor pode impugnar o reconhecimento nos quatro anos seguintes à maioridade ou emancipação. Qualquer pessoa com interesse pode contestar a ação de investigação de paternidade ou maternidade. A sentença que julgar procedente a ação de investigação terá os mesmos efeitos do reconhecimento, podendo ordenar que o filho seja criado fora da companhia dos pais. A filiação materna ou paterna pode resultar de casamento declarado nulo.", "O documento trata da adoção de crianças e adolescentes, que deve seguir as regras previstas no Estatuto da Criança e do Adolescente. Também menciona que a adoção de maiores de 18 anos requer a assistência do poder público e uma sentença constitutiva. Além disso, os artigos de 1.620 a 1.629 foram revogados pela Lei nº 12.010 de 2009.", "O poder familiar é atribuído aos pais durante o casamento e a união estável, sendo exercido exclusivamente por um deles na falta ou impedimento do outro. Em caso de divergência, os pais podem recorrer ao juiz para solucionar o desacordo. A separação judicial, o divórcio e a dissolução da união estável não alteram as relações entre pais e filhos, exceto no que diz respeito ao direito de terem os filhos em sua companhia. Se um filho não for reconhecido pelo pai, a mãe terá o poder familiar exclusivo sobre ele, e se a mãe não puder exercê-lo, será designado um tutor para o menor.", "O artigo 1.634 do Livro IV, Título I, Capítulo V, Seção II do Código Civil trata do exercício do poder familiar, que é competência de ambos os pais, independentemente da situação conjugal. Esse poder inclui dirigir a criação e educação dos filhos, exercer a guarda unilateral ou compartilhada, conceder ou negar consentimento para casamento, viagens ao exterior e mudança de residência, nomear tutor em caso de falecimento do outro genitor, representar os filhos judicial e extrajudicialmente até os 16 anos, reclamá-los de quem os detenha ilegalmente e exigir obediência, respeito e serviços apropriados à idade e condição dos filhos. Essas disposições foram alteradas pela Lei nº 13.058 de 2014.", "O documento trata da suspensão e extinção do poder familiar, destacando que o poder familiar pode ser extinto pela morte dos pais ou do filho, emancipação, maioridade, adoção ou decisão judicial. Também aborda que o pai ou a mãe que contrai novas núpcias ou estabelece união estável não perde os direitos ao poder familiar em relação aos filhos do relacionamento anterior. Além disso, menciona que o poder familiar pode ser suspenso em casos de abuso de autoridade, faltas aos deveres inerentes ou crimes cometidos pelos pais. Por fim, destaca que o poder familiar pode ser perdido por ato judicial em casos de castigo imoderado, abandono, atos contrários à moral, entre outros, incluindo crimes graves como homicídio, estupro e violência doméstica.", "O Livro IV trata do Direito de Família, mais especificamente do Direito Patrimonial, com foco no Regime de Bens entre os cônjuges.", "O documento trata das disposições gerais sobre o direito patrimonial no casamento. Os nubentes podem estipular o regime de bens antes do casamento, podendo alterá-lo com autorização judicial. Caso não haja convenção, vigorará o regime da comunhão parcial. O regime da separação de bens é obrigatório em certos casos, como quando uma das partes tem mais de 70 anos. Os cônjuges têm liberdade para praticar atos de disposição e administração de seus bens, podendo comprar coisas necessárias à economia doméstica e contrair dívidas que obrigam ambos. Há restrições quanto à alienação de bens imóveis e doações sem autorização do outro cônjuge. A falta de autorização torna anulável o ato praticado, podendo ser pleiteada a anulação até dois anos após o término da sociedade conjugal. Em casos de incapacidade de um dos cônjuges, o outro pode gerir os bens comuns e do consorte, alienar bens móveis comuns e imóveis com autorização judicial. O cônjuge na posse dos bens particulares do outro é responsável como usufrutuário, procurador ou depositário.", "O pacto antenupcial deve ser feito por escritura pública e só é eficaz após o casamento. Se for realizado por menor, precisa da aprovação do representante legal, exceto nos casos de regime obrigatório de separação de bens. Qualquer cláusula que vá contra a lei é nula. No regime de participação final nos aqüestos, é possível dispor livremente dos bens imóveis desde que sejam particulares. As convenções antenupciais só têm efeito perante terceiros após serem registradas no Registro de Imóveis do domicílio dos cônjuges.", "O documento apresenta as regras do regime de comunhão parcial de bens no Direito de Família. Nele, são estabelecidos quais bens são comunicáveis e quais são excluídos da comunhão, bem como as regras de administração e responsabilidade pelas dívidas. São destacados os casos em que os bens adquiridos na constância do casamento entram na comunhão, bem como os casos em que são considerados incomunicáveis. Além disso, são estabelecidas as responsabilidades de cada cônjuge em relação à administração e disposição dos bens particulares e comuns.", "O regime de comunhão universal implica na comunicação de todos os bens presentes e futuros dos cônjuges, assim como suas dívidas passivas, com algumas exceções, como bens doados ou herdados com cláusula de incomunicabilidade, bens gravados de fideicomisso, dívidas anteriores ao casamento, doações antenupciais com cláusula de incomunicabilidade, e outros bens especificados. A incomunicabilidade dos bens não se estende aos frutos durante o casamento. O regime também segue as regras de administração dos bens do Capítulo anterior e, uma vez extinta a comunhão, a responsabilidade de cada cônjuge para com os credores do outro cessa.", "O documento trata do regime de participação final nos aqüestos no Direito de Família, onde cada cônjuge possui patrimônio próprio e tem direito à metade dos bens adquiridos pelo casal durante o casamento. São estabelecidas regras para a administração dos bens, exclusão de determinados bens do montante dos aqüestos, responsabilidade por dívidas, divisão dos bens em caso de separação ou divórcio, entre outras disposições. O documento também aborda a meação na dissolução da sociedade conjugal por morte e a não obrigatoriedade do cônjuge ou seus herdeiros em relação às dívidas do outro cônjuge.", "O documento trata do Direito de Família, especificamente do Regime de Separação de Bens, do Usufruto e da Administração dos Bens de Filhos Menores, dos Alimentos e do Bem de Família. Ele estabelece as regras para a separação de bens, a administração dos bens dos filhos menores, a obrigação de prestar alimentos entre parentes, cônjuges e companheiros, a instituição do bem de família e suas regras de proteção. Também aborda a administração e extinção do bem de família em diferentes situações, como a dissolução da sociedade conjugal e a morte dos cônjuges.", "O Livro IV do Direito de Família trata da união estável, reconhecendo-a como entidade familiar entre homem e mulher, configurada pela convivência pública, contínua e duradoura com o objetivo de constituir família. Impedimentos e causas suspensivas não impedem a caracterização da união estável. Os companheiros devem obedecer aos deveres de lealdade, respeito, assistência, guarda, sustento e educação dos filhos. No que couber, aplica-se o regime da comunhão parcial de bens. A união estável pode ser convertida em casamento mediante pedido ao juiz e assento no Registro Civil. Relações não eventuais entre pessoas impedidas de casar configuram concubinato.", "O documento trata do Direito de Família, especificamente da Tutela, Curatela e Tomada de Decisão Apoiada. Ele aborda a nomeação de tutores para filhos menores em casos de falecimento dos pais, ausência dos pais ou decaimento do poder familiar. Também menciona a nomeação de tutor pelos pais em conjunto, a preferência de parentes consanguíneos para tutela em caso de falta de nomeação pelos pais, a nomeação de tutor pelo juiz em casos específicos, a nomeação de curador especial para crianças e adolescentes cujos pais são desconhecidos, falecidos ou destituídos do poder familiar, e a inclusão em programa de colocação familiar.", "O documento trata do Direito de Família, especificamente da Tutela, Curatela e Tomada de Decisão Apoiada. No caso da Tutela, são listadas as condições em que uma pessoa não pode ser tutora, como não ter livre administração de seus bens, estar em obrigação com o menor, ter demanda contra o menor, ser inimigo do menor, ter sido condenado por crimes específicos, ter mau procedimento ou ter exercido função pública incompatível com a tutela.", "O documento trata do Direito de Família, especificamente da Tutela, Curatela e Tomada de Decisão Apoiada. O Capítulo I aborda a Tutela, com a Seção III tratando da Escusa dos Tutores. O artigo 1.736 lista as condições em que os tutores podem se escusar da tutela, como mulheres casadas, maiores de sessenta anos, entre outros. O artigo 1.737 estabelece que quem não for parente do menor não pode ser obrigado a aceitar a tutela se houver parente idôneo disponível. O artigo 1.738 determina o prazo para apresentação da escusa e as consequências da não apresentação. O artigo 1.739 estabelece que, se a escusa não for admitida pelo juiz, o nomeado exercerá a tutela até que haja um provimento do recurso, sendo responsável por eventuais perdas e danos ao menor.", "O documento trata do exercício da tutela, que é a responsabilidade de cuidar de menores de idade e administrar seus bens. O tutor deve dirigir a educação, prestar alimentos, administrar os bens do tutelado com zelo e boa-fé, e representar o menor em atos da vida civil. O tutor também pode pagar dívidas do menor, aceitar heranças, vender bens do menor, entre outras responsabilidades. O tutor responde por prejuízos causados ao tutelado por culpa ou dolo, mas tem direito a ser reembolsado pelas despesas feitas na tutela e a receber uma remuneração proporcional aos bens administrados. O documento também aborda a necessidade de autorização judicial para certas ações do tutor, como adquirir bens em nome do menor ou dispor dos bens do menor gratuitamente.", "O documento trata do direito de família, especificamente sobre a tutela, curatela e tomada de decisão apoiada. No que diz respeito à tutela, os tutores não podem conservar dinheiro dos tutelados, devendo utilizá-lo apenas para despesas ordinárias com sustento, educação e administração de bens. Em caso de necessidade, objetos de valor devem ser avaliados e alienados com autorização judicial. Os valores em estabelecimento bancário oficial só podem ser retirados com autorização do juiz, para despesas do tutelado, compra de bens imóveis, emprego conforme doação ou entrega aos órfãos. Os tutores respondem por demora na aplicação dos valores, devendo pagar juros legais.", "O documento trata da prestação de contas dos tutores em relação à administração dos bens dos tutelados. Os tutores são obrigados a prestar contas anualmente, submetendo o balanço ao juiz para aprovação. As contas devem ser prestadas a cada dois anos, quando deixarem a tutela ou sempre que o juiz considerar conveniente. A quitação do menor após o fim da tutela não terá efeito antes da aprovação das contas pelo juiz. Em caso de morte, ausência ou interdição do tutor, as contas serão prestadas por seus herdeiros ou representantes. As despesas justificadas em benefício do menor serão creditadas ao tutor, e as despesas com a prestação de contas serão pagas pelo tutelado. O alcance do tutor e o saldo contra o tutelado são considerados dívidas de valor e vencem juros a partir do julgamento definitivo das contas.", "O documento trata do Direito de Família, especificamente da Tutela, Curatela e Tomada de Decisão Apoiada. No caso da Tutela, a condição de tutelado cessa com a maioridade ou emancipação do menor, ou ao cair o menor sob o poder familiar no caso de reconhecimento ou adoção. As funções do tutor cessam ao expirar o termo, ao sobrevir escusa legítima ou ao ser removido. O tutor é obrigado a servir por dois anos, podendo continuar além desse prazo se o juiz julgar conveniente ao menor. O tutor será destituído se for negligente, prevaricador ou incapaz.", "O documento trata do Direito de Família, especificamente da Curatela, que é aplicada a pessoas que não podem expressar sua vontade devido a causas transitórias ou permanentes, ébrios habituais, viciados em tóxicos e pródigos. O cônjuge ou companheiro é o curador do outro quando interdito, seguido pelos pais, descendentes e, na falta destes, o juiz escolhe o curador. O documento também menciona a possibilidade de estabelecer curatela compartilhada para pessoas com deficiência. Além disso, destaca a importância de garantir o direito à convivência familiar e comunitária para as pessoas sob curatela.", "O documento trata da curatela do nascituro e do enfermo ou portador de deficiência física, estabelecendo que será designado um curador para o nascituro caso o pai faleça enquanto a mãe estiver grávida e não tiver o poder familiar. No caso da mulher estar interditada, o curador será o mesmo do nascituro. O artigo 1.780 foi revogado pela Lei nº 13.146 de 2015.", "O documento aborda as regras relacionadas à curatela e à tomada de decisão apoiada de pessoas com deficiência. Na curatela, o curador priva o pródigo de realizar certos atos sem sua supervisão. No caso de curador ser o cônjuge em regime de comunhão universal de bens, não é obrigado a prestar contas, exceto por ordem judicial. Já a tomada de decisão apoiada é um processo em que a pessoa com deficiência escolhe pelo menos duas pessoas de confiança para ajudá-la a tomar decisões sobre sua vida civil. O documento também estabelece os procedimentos para solicitar a tomada de decisão apoiada, as responsabilidades dos apoiadores, as consequências de agir de forma negligente e a possibilidade de encerrar o acordo a qualquer momento. Além disso, as disposições sobre prestação de contas na curatela também se aplicam à tomada de decisão apoiada.", "O documento trata do Direito das Sucessões, especificamente da sucessão em geral. Aborda as disposições gerais relacionadas à abertura da sucessão, transmissão da herança aos herdeiros legítimos e testamentários, local de abertura da sucessão, formas de sucessão por lei ou por disposição de última vontade, regulamentação da sucessão pela lei vigente no momento da abertura, transmissão da herança aos herdeiros legítimos em caso de ausência de testamento, limitações para disposição da herança por testamento em caso de herdeiros necessários, e a participação do companheiro na sucessão do outro em união estável.", "O artigo 1.791 estabelece que a herança é deferida como um todo unitário, mesmo que haja vários herdeiros. O artigo 1.792 determina que o herdeiro não responde por encargos superiores às forças da herança, mas deve provar o excesso. O artigo 1.793 permite a cessão do direito à sucessão aberta por escritura pública. O artigo 1.794 estabelece que um co-herdeiro não pode ceder sua quota hereditária a uma pessoa estranha à sucessão se outro co-herdeiro quiser. O artigo 1.796 determina que o inventário do patrimônio hereditário deve ser instaurado no prazo de trinta dias após a abertura da sucessão. O artigo 1.797 estabelece a ordem de administração da herança até o compromisso do inventariante.", "O documento trata do Direito das Sucessões, especificamente sobre a Vocação Hereditária. Ele estabelece quem pode suceder na abertura da sucessão, incluindo pessoas nascidas ou concebidas no momento da abertura da sucessão, filhos ainda não concebidos de pessoas indicadas pelo testador, pessoas jurídicas e pessoas jurídicas organizadas como fundação. Também aborda a nomeação de herdeiros e legatários, estabelecendo quem não pode ser nomeado, como o cônjuge do escriba do testamento, testemunhas do testamento, concubino casado do testador, entre outros. Além disso, o documento trata da nulidade de disposições testamentárias em favor de pessoas não legitimadas a suceder e da possibilidade de deixar bens para o filho do concubino, desde que também seja filho do testador.", "O documento trata do Direito das Sucessões, especificamente sobre a aceitação e renúncia da herança. A aceitação da herança torna definitiva a transmissão ao herdeiro, enquanto a renúncia impede essa transmissão. A aceitação pode ser expressa por declaração escrita ou tácita por atos próprios da qualidade de herdeiro. A renúncia deve constar em instrumento público ou termo judicial. Não é possível aceitar ou renunciar a herança em parte, sob condição ou a termo. Em caso de renúncia, a parte do renunciante acresce aos outros herdeiros da mesma classe. Os atos de aceitação ou renúncia da herança são irrevogáveis. Em caso de renúncia prejudicar os credores, estes podem, com autorização do juiz, aceitar a herança em nome do renunciante.", "O documento trata dos casos em que herdeiros ou legatários podem ser excluídos da sucessão, como por exemplo, se forem autores de homicídio doloso contra a pessoa de cuja sucessão se tratar, se acusarem caluniosamente o autor da herança em juízo, ou se inibirem o autor da herança de dispor livremente de seus bens por meios fraudulentos. A exclusão do herdeiro ou legatário por indignidade deve ser declarada por sentença, e o Ministério Público tem legitimidade para demandar essa exclusão em casos de homicídio doloso. O trânsito em julgado de sentença penal condenatória acarreta a imediata exclusão do herdeiro indigno. Os descendentes do herdeiro excluído sucedem como se ele estivesse morto antes da abertura da sucessão. São válidas as alienações onerosas de bens hereditários a terceiros de boa-fé e os atos de administração praticados pelo herdeiro antes da sentença de exclusão. O excluído da sucessão é obrigado a restituir os frutos e rendimentos dos bens da herança que houver percebido. Aquele que incorreu em atos que determinem a exclusão da herança pode ser admitido a suceder se o ofendido o reabilitar expressamente em testamento ou em outro ato autêntico.", "O documento trata do Direito das Sucessões, especificamente sobre a herança jacente. Quando alguém falece sem deixar testamento ou herdeiro legítimo conhecido, os bens da herança ficam sob a guarda de um curador até a entrega ao sucessor habilitado ou declaração de vacância. Após um ano da primeira publicação dos editais de arrecadação, se não houver herdeiro habilitado, a herança é declarada vacante. Os credores têm direito de pedir o pagamento das dívidas reconhecidas. Após cinco anos da abertura da sucessão, se não houver habilitação, os bens passam para o domínio público. Se todos os chamados a suceder renunciarem à herança, ela é declarada vacante imediatamente.", "O capítulo VII do Título I do Livro V trata da petição de herança, onde o herdeiro pode demandar o reconhecimento de seu direito sucessório para obter a restituição da herança contra quem a possua, mesmo sem título. A ação de petição de herança pode abranger todos os bens hereditários, e o possuidor da herança está obrigado à restituição dos bens do acervo. A responsabilidade do possuidor é determinada pela posse de má-fé e pela mora a partir da citação. O herdeiro pode demandar os bens da herança mesmo em poder de terceiros, com eficácia das alienações feitas pelo herdeiro aparente a terceiros de boa-fé. O herdeiro aparente que pagou um legado de boa-fé não está obrigado a prestar o equivalente ao verdadeiro sucessor, mas este último tem o direito de proceder contra quem recebeu o pagamento.", "O documento trata da sucessão legítima, que é a forma de transferência de bens de uma pessoa falecida para seus herdeiros de acordo com a lei. A ordem de vocação hereditária é estabelecida, dando preferência aos descendentes, ascendentes, cônjuge sobrevivente e colaterais, nessa ordem. São estabelecidas regras específicas para cada categoria de herdeiros, como direito real de habitação para o cônjuge sobrevivente e a divisão da herança entre os herdeiros. Em caso de falta de herdeiros sucessíveis, a herança pode ser devolvida ao Município, Distrito Federal ou União.", "O documento trata do Direito das Sucessões, especificamente da Sucessão Legítima, abordando os Herdeiros Necessários. São considerados herdeiros necessários os descendentes, ascendentes e o cônjuge. Eles têm direito a metade dos bens da herança, chamada de legítima, que é calculada sobre o valor dos bens na abertura da sucessão. O testador não pode estabelecer cláusulas de inalienabilidade, impenhorabilidade e incomunicabilidade sobre os bens da legítima, a menos que haja justa causa. Também não pode converter os bens da legítima em outros de espécie diversa, exceto com autorização judicial e justa causa. O herdeiro necessário que receber parte disponível ou legado do testador não perde o direito à legítima. Para excluir os herdeiros colaterais da sucessão, basta que o testador disponha de seu patrimônio sem contemplá-los.", "O documento aborda o direito de representação na sucessão legítima, onde certos parentes do falecido são chamados a suceder em seu lugar. O direito de representação ocorre na linha reta descendente, mas nunca na ascendente, e na linha transversal somente se dá em favor dos filhos de irmãos do falecido. Os representantes herdam o que o representado herdaria se estivesse vivo, e o quinhão do representado é dividido igualmente entre os representantes. Além disso, um renunciante à herança de uma pessoa pode representá-la na sucessão de outra. O documento também aborda a sucessão testamentária, onde toda pessoa capaz pode dispor de seus bens por testamento, exceto a legítima dos herdeiros necessários. O testamento é ato personalíssimo e pode ser alterado a qualquer momento, e o direito de impugnar sua validade se extingue em cinco anos a partir do registro.", "O documento trata da capacidade de testar no Direito das Sucessões. O artigo 1.860 estabelece que além dos incapazes, aqueles que não tiverem pleno discernimento no momento de fazer o testamento também não podem testar. No entanto, o parágrafo único do mesmo artigo afirma que os maiores de dezesseis anos podem testar. Já o artigo 1.861 diz que a incapacidade superveniente do testador não invalida o testamento, e que o testamento de um incapaz não se torna válido com a superveniência da capacidade.", "O documento trata das formas ordinárias do testamento, que são o público, o cerrado e o particular. Também destaca que é proibido o testamento conjuntivo, seja simultâneo, recíproco ou correspectivo.", "O documento trata dos requisitos essenciais para a elaboração de um testamento público, que deve ser escrito por um tabelião ou seu substituto legal em seu livro de notas, lido em voz alta ao testador e duas testemunhas, e assinado por todas as partes envolvidas. Caso o testador não possa assinar, o tabelião ou seu substituto legal poderá fazê-lo em seu lugar, com a presença de uma testemunha. Para indivíduos surdos ou cegos, são estabelecidas regras específicas para a elaboração do testamento público.", "O documento descreve as formalidades necessárias para a validade de um testamento cerrado. O testamento deve ser escrito pelo testador ou por outra pessoa a seu pedido, e aprovado pelo tabelião, seguindo as etapas de entrega do documento ao tabelião na presença de duas testemunhas, declaração do testador sobre o testamento, lavratura do auto de aprovação, leitura do documento às testemunhas e assinatura do auto pelo tabelião, testador e testemunhas. O testamento pode ser escrito mecanicamente desde que seja numerado e autenticado pelo subscritor. O tabelião deve iniciar o auto de aprovação imediatamente após a última palavra do testador e, se não houver espaço na última folha, deve mencionar a circunstância no auto. O testamento pode ser escrito em língua nacional ou estrangeira, desde que o testador saiba ler. O documento também aborda a possibilidade de testamento cerrado para surdo-mudos, desde que seja escrito e assinado por eles mesmos. Após a aprovação e fechamento do testamento, o documento é entregue ao testador e registrado pelo tabelião. Após a morte do testador, o testamento é apresentado ao juiz para abertura, registro e cumprimento, desde que não haja vícios externos que o tornem nulo ou suspeito de falsidade.", "O documento trata das formas ordinárias do testamento, especificamente do testamento particular. O testamento particular pode ser escrito de próprio punho ou por processo mecânico. Se escrito de próprio punho, deve ser lido e assinado pelo testador na presença de pelo menos três testemunhas. Se elaborado por processo mecânico, não pode conter rasuras ou espaços em branco e deve ser assinado pelo testador na presença de pelo menos três testemunhas. Após a morte do testador, o testamento deve ser publicado em juízo com citação dos herdeiros legítimos. Se houver contestação das testemunhas sobre a disposição do testamento, ele poderá ser confirmado se as assinaturas forem reconhecidas. Em circunstâncias excepcionais, um testamento particular de próprio punho e assinado pelo testador, sem testemunhas, poderá ser confirmado a critério do juiz. O testamento particular pode ser escrito em língua estrangeira, desde que as testemunhas a compreendam.", "O documento trata dos codicilos, que são disposições especiais feitas por uma pessoa capaz de testar em um escrito particular datado e assinado. Os codicilos podem incluir instruções sobre o enterro, doações de pequeno valor para pessoas específicas ou para os pobres de um determinado local, bem como legados de móveis, roupas ou jóias de pouco valor. Os atos feitos por meio de codicilos podem nomear ou substituir testamenteiros e revogar-se mutuamente. Caso haja um testamento posterior, este pode confirmar ou modificar os codicilos. Em caso de codicilo fechado, ele deve ser aberto da mesma forma que um testamento cerrado.", "O documento trata do Direito das Sucessões, especificamente sobre os testamentos especiais. São considerados testamentos especiais o marítimo, o aeronáutico e o militar. Não são admitidos outros testamentos especiais além dos mencionados no Código.", "O documento trata dos testamentos especiais, mais especificamente do testamento marítimo e do testamento aeronáutico. O artigo 1.888 estabelece que quem estiver em viagem a bordo de navio nacional pode testar perante o comandante, com a presença de duas testemunhas. O registro do testamento deve ser feito no diário de bordo. O artigo 1.889 trata do testamento aeronáutico, que pode ser feito a bordo de aeronave militar ou comercial, perante pessoa designada pelo comandante. O testamento ficará sob a guarda do comandante e será entregue às autoridades administrativas do primeiro porto ou aeroporto nacional. O artigo 1.891 estabelece que o testamento marítimo ou aeronáutico caducará se o testador não morrer na viagem ou nos noventa dias seguintes ao desembarque. Já o artigo 1.892 determina que o testamento marítimo não terá validade se o navio estiver em porto onde o testador pudesse desembarcar e testar de forma ordinária.", "O artigo 1.893 do Código Civil trata do Testamento Militar, que pode ser feito por militares e pessoas a serviço das Forças Armadas em situações específicas, como em campanha, em praça sitiada ou com comunicações interrompidas. O testamento pode ser feito na presença de duas ou três testemunhas, caso o testador não possa ou não saiba assinar. Se o testador pertencer a um corpo destacado, o testamento será escrito pelo respectivo comandante. Se estiver em tratamento em hospital, será escrito pelo oficial de saúde ou pelo diretor do estabelecimento. Se for o oficial mais graduado, será escrito por aquele que o substituir. O artigo 1.894 permite que o testador faça o testamento de próprio punho, desde que o date e assine por extenso na presença de duas testemunhas. O testamento militar caduca se o testador estiver por noventa dias seguidos em um lugar onde possa testar de forma ordinária. O artigo 1.896 permite que pessoas em combate ou feridas testem oralmente, confiando sua última vontade a duas testemunhas, mas o testamento só terá efeito se o testador morrer na guerra ou se recuperar do ferimento.", "O documento apresenta uma série de artigos relacionados às disposições testamentárias no Direito das Sucessões. São abordados temas como a nomeação de herdeiros e legatários, condições para as disposições testamentárias, nulidade de certas disposições, designação de pessoas incertas, disposições em favor dos pobres e instituições de caridade, erro na designação de herdeiros, partilha da herança entre herdeiros nomeados individualmente e coletivamente, entre outros. Também são mencionadas as condições de anulação de disposições testamentárias e a cláusula de inalienabilidade de bens por ato de liberalidade.", "O documento apresenta uma série de disposições relacionadas aos legados em um testamento. Estabelece que um legado de coisa certa que não pertença ao testador no momento da abertura da sucessão é ineficaz. Também aborda a renúncia à herança ou legado caso o herdeiro ou legatário não cumpra a ordem de entregar algo de sua propriedade a outrem. Além disso, define regras para legados de coisas que pertencem parcialmente ao testador, de coisas determinadas pelo gênero, de coisas singulares, de crédito, de alimentos, de usufruto, entre outros. Também menciona a possibilidade de inclusão de novas aquisições em um legado de imóvel, desde que haja declaração expressa do testador.", "O artigo 1.923 estabelece que desde a abertura da sucessão, o legatário tem direito à coisa certa existente no acervo, exceto se o legado estiver sob condição suspensiva. O artigo 1.924 determina que o direito de pedir o legado não pode ser exercido enquanto houver litígio sobre a validade do testamento. O artigo 1.925 estabelece que o legado em dinheiro só vence juros a partir do momento em que a pessoa obrigada a prestá-lo entrar em mora. Os artigos subsequentes tratam dos efeitos do legado, incluindo a transferência dos frutos da coisa legada, a data de vencimento de legados em dinheiro, renda vitalícia ou pensão periódica, e as regras para legados de quantidades certas em prestações periódicas. Também são abordadas questões como a escolha de coisas determinadas pelo gênero, a opção em legados alternativos, a responsabilidade pela entrega do legado, entre outros.", "O documento trata da caducidade dos legados em um testamento, ou seja, das situações em que um legado deixa de ter efeito. Isso pode ocorrer se o testador modificar a coisa legada, alienar total ou parcialmente a coisa, se a coisa perecer ou for evicta sem culpa do herdeiro, se o legatário for excluído da sucessão ou se o legatário falecer antes do testador. Além disso, se o legado for de duas ou mais coisas alternativamente e algumas delas perecerem, o legado subsistirá quanto às restantes.", "O documento trata do direito de acrescer entre herdeiros e legatários em casos específicos, como quando vários herdeiros são chamados à herança em quinhões não determinados e um deles não pode ou não quer aceitá-la, nesse caso sua parte acrescerá aos co-herdeiros. O direito de acrescer também se aplica aos co-legatários em situações específicas. Caso não ocorra o direito de acrescer, a quota vaga do nomeado é transmitida aos herdeiros legítimos. O beneficiário do acréscimo não pode repudiá-lo separadamente da herança ou legado que lhe caiba, exceto se houver encargos especiais impostos pelo testador. Também é mencionado o caso de legado de usufruto conjuntamente a duas ou mais pessoas, onde a parte da que faltar acresce aos co-legatários.", "O documento trata das substituições em testamentos, onde o testador pode nomear outra pessoa como substituta caso o herdeiro ou legatário nomeado não queira ou não possa aceitar a herança ou legado. Também é permitido substituir várias pessoas por uma só, ou vice-versa, com ou sem reciprocidade. O substituto fica sujeito às mesmas condições ou encargos impostos ao substituído, a menos que a intenção do testador seja diferente. Em caso de substituição recíproca entre co-herdeiros ou legatários de partes desiguais, a proporção dos quinhões será mantida na segunda disposição, e se mais pessoas forem incluídas na substituição, o quinhão vago será dividido igualmente entre os substitutos.", "O documento trata da substituição fideicomissária no Direito das Sucessões, onde o testador pode instituir herdeiros ou legatários, estabelecendo que a herança ou legado se transmita ao fiduciário, resolvendo-se o direito deste em favor de outrem, que se qualifica de fideicomissário. A substituição fideicomissária só é permitida em favor dos não concebidos ao tempo da morte do testador. O fiduciário tem a propriedade da herança ou legado, mas restrita e resolúvel, sendo obrigado a proceder ao inventário dos bens gravados. A nulidade da substituição ilegal não prejudica a instituição, que valerá sem o encargo resolutório.", "O documento trata das regras de deserdação no Direito das Sucessões. Os herdeiros necessários podem ser privados de sua legítima em casos em que podem ser excluídos da sucessão. Além das causas mencionadas, autorizam a deserdação dos descendentes por seus ascendentes ofensa física, injúria grave, relações ilícitas com madrasta ou padrasto, e desamparo do ascendente em alienação mental ou grave enfermidade. Já a deserdação dos ascendentes pelos descendentes pode ocorrer por ofensa física, injúria grave, relações ilícitas com cônjuges dos filhos ou netos, e desamparo do filho ou neto com deficiência mental ou grave enfermidade. A deserdação só pode ser ordenada em testamento com expressa declaração de causa, e cabe ao herdeiro instituído provar a veracidade da causa alegada pelo testador. O direito de provar a causa da deserdação prescreve em quatro anos a partir da abertura do testamento.", "O documento trata da redução das disposições testamentárias que excedem a parte disponível da herança, estabelecendo que o remanescente pertencerá aos herdeiros legítimos nesses casos. Também aborda a possibilidade de revogação total ou parcial do testamento, com a ressalva de que o testamento anterior subsiste em tudo que não for contrário ao posterior, caso a revogação seja parcial. Além disso, menciona que a revogação do testamento produzirá efeitos mesmo que o testamento revogatório seja anulado por omissão ou infração de formalidades essenciais.", "Os artigos 1.973, 1.974 e 1.975 do Livro V, Título II, Capítulo XIII do Direito das Sucessões tratam do rompimento do testamento em diferentes situações. O artigo 1.973 estabelece que o testamento é rompido caso um descendente sucessível ao testador, que não era conhecido quando o testamento foi feito, sobreviva ao testador. O artigo 1.974 determina que o testamento também é rompido se for feito na ignorância da existência de outros herdeiros necessários. Já o artigo 1.975 estabelece que o testamento não é rompido se o testador dispuser da sua metade, desde que não exclua os herdeiros necessários de cuja existência saiba.", "O documento trata do direito das sucessões, especificamente sobre o testamenteiro. O testador pode nomear um ou mais testamenteiros para cumprir suas disposições de última vontade. O testamenteiro pode receber a posse e administração da herança, requerer inventário e cumprir o testamento, defender a validade do testamento, prestar contas do que recebeu e despendeu, entre outras atribuições. O prazo para cumprir o testamento e prestar contas é de cento e oitenta dias, podendo ser prorrogado. Na falta de testamenteiro nomeado, a execução testamentária compete a um dos cônjuges ou ao herdeiro nomeado pelo juiz. O testamenteiro tem direito a um prêmio, que pode ser preferido à herança ou legado, e que reverte à herança se o testamenteiro perder por ser removido ou não cumprir o testamento. Se o testador distribuir toda a herança em legados, o testamenteiro exercerá as funções de inventariante.", "O documento trata do Direito das Sucessões, especificamente do Inventário e da Partilha. O inventariante é responsável pela administração da herança desde a assinatura do compromisso até a homologação da partilha.", "O texto trata sobre os sonegados em um inventário e partilha de bens de uma herança. O herdeiro que sonegar bens da herança perderá o direito sobre eles. Além disso, se o sonegador for o próprio inventariante, ele será removido do cargo. A pena de sonegados só pode ser requerida em ação movida pelos herdeiros ou credores da herança, e a sentença favorável a um dos interessados beneficiará os demais. Se os bens sonegados não forem restituídos, o sonegador terá que pagar a importância dos valores ocultados, mais perdas e danos. A sonegação só pode ser alegada após a descrição dos bens no inventário e a declaração de que não existem outros a inventariar e partir.", "O Artigo 1.997 estabelece que a herança é responsável pelo pagamento das dívidas do falecido, mas após a partilha, os herdeiros são responsáveis proporcionalmente à parte que receberam. O Artigo 1.998 determina que as despesas funerárias saem da herança, enquanto as despesas de sufrágios só são obrigatórias se estiverem previstas em testamento. O Artigo 1.999 estabelece a divisão da parte do co-herdeiro insolvente entre os demais em caso de ação regressiva. O Artigo 2.000 permite que legatários e credores da herança sejam preferidos no pagamento em relação aos credores do herdeiro. O Artigo 2.001 determina que se o herdeiro for devedor ao espólio, a dívida será dividida entre todos, a menos que a maioria concorde em imputar a dívida apenas ao devedor.", "O documento trata da colação, que é a obrigação dos descendentes que concorrem à sucessão do ascendente comum de conferir o valor das doações recebidas em vida, para igualar as legítimas. São detalhadas as regras para cálculo da colação, dispensa da colação, redução das doações em caso de excesso, obrigações dos netos em relação aos avós, gastos ordinários do ascendente com o descendente que não entram na colação, doações remuneratórias de serviços feitos ao ascendente e a divisão das doações feitas por ambos os cônjuges.", "O Artigo 2.013 estabelece que o herdeiro pode requerer a partilha mesmo que o testador o proíba, assim como seus cessionários e credores. O Artigo 2.014 permite que o testador indique os bens que devem compor os quinhões hereditários, prevalecendo a partilha feita por ele, a menos que o valor dos bens não corresponda às quotas estabelecidas. O Artigo 2.015 permite que os herdeiros capazes façam uma partilha amigável por escritura pública, termo nos autos do inventário ou escrito particular homologado pelo juiz. O Artigo 2.016 determina que a partilha será sempre judicial se os herdeiros divergirem ou se algum deles for incapaz. O Artigo 2.017 estabelece que na partilha dos bens deve-se observar a maior igualdade possível quanto ao seu valor, natureza e qualidade. O Artigo 2.018 valida a partilha feita por ascendente desde que não prejudique a legítima dos herdeiros necessários. O Artigo 2.019 determina que os bens insuscetíveis de divisão cômoda serão vendidos judicialmente se não couberem na meação do cônjuge sobrevivente ou no quinhão de um só herdeiro, a menos que haja acordo para serem adjudicados a todos. O Artigo 2.020 estabelece que os herdeiros em posse dos bens da herança, o cônjuge sobrevivente e o inventariante devem trazer ao acervo os frutos que perceberam desde a abertura da sucessão, tendo direito ao reembolso das despesas necessárias e úteis. O Artigo 2.021 permite que parte da herança seja reservada para uma ou mais sobrepartilhas se consistir em bens remotos, litigiosos ou de liquidação morosa. O Artigo 2.022 determina que os bens sonegados e outros bens da herança de que se tenha ciência após a partilha ficam sujeitos a sobrepartilha."]